#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_RC_Vehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_RC_Vehicle.ABP_RC_Vehicle_C
// 0x0180 (0x0440 - 0x02C0)
class UABP_RC_Vehicle_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x02F8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0318(0x0108)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0420(0x0010)()
	struct FRotator                               TrailerRotation;                                   // 0x0430(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_RC_Vehicle(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_RC_Vehicle_C">();
	}
	static class UABP_RC_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_RC_Vehicle_C>();
	}
};
static_assert(alignof(UABP_RC_Vehicle_C) == 0x000010, "Wrong alignment on UABP_RC_Vehicle_C");
static_assert(sizeof(UABP_RC_Vehicle_C) == 0x000440, "Wrong size on UABP_RC_Vehicle_C");
static_assert(offsetof(UABP_RC_Vehicle_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_RC_Vehicle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_RC_Vehicle_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_RC_Vehicle_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_RC_Vehicle_C, AnimGraphNode_ComponentToLocalSpace) == 0x0002F8, "Member 'UABP_RC_Vehicle_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_RC_Vehicle_C, AnimGraphNode_ModifyBone) == 0x000318, "Member 'UABP_RC_Vehicle_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_RC_Vehicle_C, AnimGraphNode_MeshRefPose) == 0x000420, "Member 'UABP_RC_Vehicle_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UABP_RC_Vehicle_C, TrailerRotation) == 0x000430, "Member 'UABP_RC_Vehicle_C::TrailerRotation' has a wrong offset!");

}

