#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Blender

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Blender.BP_Blender_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_Blender_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Blender_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Blender_C_UserConstructionScript");
static_assert(sizeof(BP_Blender_C_UserConstructionScript) == 0x000050, "Wrong size on BP_Blender_C_UserConstructionScript");
static_assert(offsetof(BP_Blender_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'BP_Blender_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blender_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_Blender_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blender_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'BP_Blender_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blender_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000048, "Member 'BP_Blender_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_Blender.BP_Blender_C.ExecuteUbergraph_BP_Blender
// 0x0004 (0x0004 - 0x0000)
struct BP_Blender_C_ExecuteUbergraph_BP_Blender final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Blender_C_ExecuteUbergraph_BP_Blender) == 0x000004, "Wrong alignment on BP_Blender_C_ExecuteUbergraph_BP_Blender");
static_assert(sizeof(BP_Blender_C_ExecuteUbergraph_BP_Blender) == 0x000004, "Wrong size on BP_Blender_C_ExecuteUbergraph_BP_Blender");
static_assert(offsetof(BP_Blender_C_ExecuteUbergraph_BP_Blender, EntryPoint) == 0x000000, "Member 'BP_Blender_C_ExecuteUbergraph_BP_Blender::EntryPoint' has a wrong offset!");

}

