#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Blender

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Blender.BP_Blender_C
// 0x0028 (0x0248 - 0x0220)
class ABP_Blender_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rotor;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Blender;                                           // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseFoundation;                                    // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Blender(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Blender_C">();
	}
	static class ABP_Blender_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Blender_C>();
	}
};
static_assert(alignof(ABP_Blender_C) == 0x000008, "Wrong alignment on ABP_Blender_C");
static_assert(sizeof(ABP_Blender_C) == 0x000248, "Wrong size on ABP_Blender_C");
static_assert(offsetof(ABP_Blender_C, UberGraphFrame) == 0x000220, "Member 'ABP_Blender_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Blender_C, RotatingMovement) == 0x000228, "Member 'ABP_Blender_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_Blender_C, Rotor) == 0x000230, "Member 'ABP_Blender_C::Rotor' has a wrong offset!");
static_assert(offsetof(ABP_Blender_C, Blender) == 0x000238, "Member 'ABP_Blender_C::Blender' has a wrong offset!");
static_assert(offsetof(ABP_Blender_C, Speed) == 0x000240, "Member 'ABP_Blender_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_Blender_C, bUseFoundation) == 0x000244, "Member 'ABP_Blender_C::bUseFoundation' has a wrong offset!");

}

