#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarPark

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CarPark.BP_CarPark_C.UserConstructionScript
// 0x0190 (0x0190 - 0x0000)
struct BP_CarPark_C_UserConstructionScript final
{
public:
	struct FVector2D                              PolesStartLoc;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_4;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DFloat_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_5;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_6;          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_7;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_8;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0xC];                                      // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_2;                // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CarPark_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_CarPark_C_UserConstructionScript");
static_assert(sizeof(BP_CarPark_C_UserConstructionScript) == 0x000190, "Wrong size on BP_CarPark_C_UserConstructionScript");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, PolesStartLoc) == 0x000000, "Member 'BP_CarPark_C_UserConstructionScript::PolesStartLoc' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, Temp_int_Variable) == 0x000008, "Member 'BP_CarPark_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, Temp_int_Variable_1) == 0x000010, "Member 'BP_CarPark_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00002C, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000030, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000034, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000040, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000084, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x000088, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_BreakVector2D_X) == 0x000094, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_BreakVector2D_Y) == 0x000098, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_1) == 0x0000A0, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x0000D0, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x0000D4, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_4) == 0x0000D8, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue) == 0x0000DC, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x0000E4, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Add_Vector2DFloat_ReturnValue) == 0x0000E8, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Add_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_5) == 0x0000F0, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000F4, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F8, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000FC, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000100, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_6) == 0x000104, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, Temp_int_Variable_2) == 0x000108, "Member 'BP_CarPark_C_UserConstructionScript::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x00010C, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_7) == 0x000110, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000114, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000118, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_8) == 0x00011C, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000120, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000124, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x000128, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_2) == 0x000140, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000170, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue_1) == 0x000174, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue_2) == 0x000178, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x00017C, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarPark_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000180, "Member 'BP_CarPark_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");

}

