#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Construction_Building

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Construction_Building.BP_Construction_Building_C.BuildSide
// 0x0100 (0x0100 - 0x0000)
struct BP_Construction_Building_C_BuildSide final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherNum;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsY;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_3;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue_4;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_1;                           // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Construction_Building_C_BuildSide) == 0x000010, "Wrong alignment on BP_Construction_Building_C_BuildSide");
static_assert(sizeof(BP_Construction_Building_C_BuildSide) == 0x000100, "Wrong size on BP_Construction_Building_C_BuildSide");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, Num) == 0x000000, "Member 'BP_Construction_Building_C_BuildSide::Num' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, OtherNum) == 0x000004, "Member 'BP_Construction_Building_C_BuildSide::OtherNum' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, bIsY) == 0x000008, "Member 'BP_Construction_Building_C_BuildSide::bIsY' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_SelectRotator_ReturnValue) == 0x00000C, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000024, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000028, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000030, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, Temp_int_Variable) == 0x000034, "Member 'BP_Construction_Building_C_BuildSide::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, Temp_bool_Variable) == 0x000038, "Member 'BP_Construction_Building_C_BuildSide::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000039, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x00003A, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x00003B, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_NotEqual_IntInt_ReturnValue_3) == 0x00003D, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_NotEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000040, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_BooleanAND_ReturnValue_1) == 0x000044, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, K2Node_Select_Default) == 0x00004C, "Member 'BP_Construction_Building_C_BuildSide::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000050, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_SelectFloat_ReturnValue_1) == 0x000054, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_SelectFloat_ReturnValue_2) == 0x000058, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_SelectFloat_ReturnValue_3) == 0x00006C, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_SelectFloat_ReturnValue_4) == 0x0000A0, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_SelectFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_AddInstance_ReturnValue) == 0x0000A4, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_MakeVector_ReturnValue_1) == 0x0000A8, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_MakeTransform_ReturnValue_1) == 0x0000C0, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_AddInstance_ReturnValue_1) == 0x0000F4, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_AddInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_Construction_Building_C_BuildSide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, Temp_bool_Variable_1) == 0x0000FC, "Member 'BP_Construction_Building_C_BuildSide::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildSide, K2Node_Select_Default_1) == 0x0000FD, "Member 'BP_Construction_Building_C_BuildSide::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_Construction_Building.BP_Construction_Building_C.BuildWall
// 0x0008 (0x0008 - 0x0000)
struct BP_Construction_Building_C_BuildWall final
{
public:
	int32                                         NumX;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumY;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Construction_Building_C_BuildWall) == 0x000004, "Wrong alignment on BP_Construction_Building_C_BuildWall");
static_assert(sizeof(BP_Construction_Building_C_BuildWall) == 0x000008, "Wrong size on BP_Construction_Building_C_BuildWall");
static_assert(offsetof(BP_Construction_Building_C_BuildWall, NumX) == 0x000000, "Member 'BP_Construction_Building_C_BuildWall::NumX' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_BuildWall, NumY) == 0x000004, "Member 'BP_Construction_Building_C_BuildWall::NumY' has a wrong offset!");

// Function BP_Construction_Building.BP_Construction_Building_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Construction_Building_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Construction_Building_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Construction_Building_C_UserConstructionScript");
static_assert(sizeof(BP_Construction_Building_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Construction_Building_C_UserConstructionScript");
static_assert(offsetof(BP_Construction_Building_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'BP_Construction_Building_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Construction_Building_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000004, "Member 'BP_Construction_Building_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

}

