#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fluppism_Sequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Fluppism_Sequence.BP_Fluppism_Sequence_C.UserConstructionScript
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Fluppism_Sequence_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fluppism_Sequence_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Fluppism_Sequence_C_UserConstructionScript");
static_assert(sizeof(BP_Fluppism_Sequence_C_UserConstructionScript) == 0x0000A0, "Wrong size on BP_Fluppism_Sequence_C_UserConstructionScript");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000004, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00000C, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, Temp_int_Variable) == 0x000018, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000028, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000034, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000038, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000040, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x00004C, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fluppism_Sequence_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'BP_Fluppism_Sequence_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

