#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_House_Builder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_House_Builder.BP_House_Builder_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_House_Builder_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuildingPart*                          CallFunc_ConstructBuildingPart_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_House_Builder_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_House_Builder_C_UserConstructionScript");
static_assert(sizeof(BP_House_Builder_C_UserConstructionScript) == 0x000018, "Wrong size on BP_House_Builder_C_UserConstructionScript");
static_assert(offsetof(BP_House_Builder_C_UserConstructionScript, CallFunc_Divide_IntInt_ReturnValue) == 0x000000, "Member 'BP_House_Builder_C_UserConstructionScript::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_House_Builder_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'BP_House_Builder_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_House_Builder_C_UserConstructionScript, CallFunc_ConstructBuildingPart_ReturnValue) == 0x000010, "Member 'BP_House_Builder_C_UserConstructionScript::CallFunc_ConstructBuildingPart_ReturnValue' has a wrong offset!");

}

