#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hospital_Builder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Hospital_Builder.BP_Hospital_Builder_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BP_Hospital_Builder_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuildingPart*                          CallFunc_ConstructBuildingPart_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBuildingPart*                          CallFunc_ConstructBuildingPart_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuildingPart*                          CallFunc_ConstructBuildingPart_ReturnValue_2;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hospital_Builder_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Hospital_Builder_C_UserConstructionScript");
static_assert(sizeof(BP_Hospital_Builder_C_UserConstructionScript) == 0x000048, "Wrong size on BP_Hospital_Builder_C_UserConstructionScript");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000004, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000008, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_Divide_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_ConstructBuildingPart_ReturnValue) == 0x000020, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_ConstructBuildingPart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000028, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_ConstructBuildingPart_ReturnValue_1) == 0x000038, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_ConstructBuildingPart_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hospital_Builder_C_UserConstructionScript, CallFunc_ConstructBuildingPart_ReturnValue_2) == 0x000040, "Member 'BP_Hospital_Builder_C_UserConstructionScript::CallFunc_ConstructBuildingPart_ReturnValue_2' has a wrong offset!");

}

