#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Kick_Sequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Kick_Sequence.BP_Kick_Sequence_C.ExecuteUbergraph_BP_Kick_Sequence
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence) == 0x000004, "Wrong alignment on BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence");
static_assert(sizeof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence) == 0x0000D0, "Wrong size on BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, EntryPoint) == 0x000000, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_BreakVector_X) == 0x000010, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_BreakVector_Y) == 0x000014, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_BreakVector_Z) == 0x000018, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000030, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_GetForwardVector_ReturnValue) == 0x0000B8, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000C4, "Member 'BP_Kick_Sequence_C_ExecuteUbergraph_BP_Kick_Sequence::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function BP_Kick_Sequence.BP_Kick_Sequence_C.GetLookAtTarget
// 0x0028 (0x0028 - 0x0000)
struct BP_Kick_Sequence_C_GetLookAtTarget final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVehicleDestroyed_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLookAtTarget_ReturnValue;              // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Kick_Sequence_C_GetLookAtTarget) == 0x000004, "Wrong alignment on BP_Kick_Sequence_C_GetLookAtTarget");
static_assert(sizeof(BP_Kick_Sequence_C_GetLookAtTarget) == 0x000028, "Wrong size on BP_Kick_Sequence_C_GetLookAtTarget");
static_assert(offsetof(BP_Kick_Sequence_C_GetLookAtTarget, ReturnValue) == 0x000000, "Member 'BP_Kick_Sequence_C_GetLookAtTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_GetLookAtTarget, CallFunc_IsVehicleDestroyed_ReturnValue) == 0x00000C, "Member 'BP_Kick_Sequence_C_GetLookAtTarget::CallFunc_IsVehicleDestroyed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_GetLookAtTarget, CallFunc_GetSocketLocation_ReturnValue) == 0x000010, "Member 'BP_Kick_Sequence_C_GetLookAtTarget::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Kick_Sequence_C_GetLookAtTarget, CallFunc_GetLookAtTarget_ReturnValue) == 0x00001C, "Member 'BP_Kick_Sequence_C_GetLookAtTarget::CallFunc_GetLookAtTarget_ReturnValue' has a wrong offset!");

}

