#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RC_Sequence_Winter

#include "Basic.hpp"

#include "BP_RC_Sequence_2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RC_Sequence_Winter.BP_RC_Sequence_Winter_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_RC_Sequence_Winter_C final : public ABP_RC_Sequence_2_C
{
public:
	class UChildActorComponent*                   FloodLight2;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FloodLight1;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FloodLight;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RC_Sequence_Winter_C">();
	}
	static class ABP_RC_Sequence_Winter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RC_Sequence_Winter_C>();
	}
};
static_assert(alignof(ABP_RC_Sequence_Winter_C) == 0x000008, "Wrong alignment on ABP_RC_Sequence_Winter_C");
static_assert(sizeof(ABP_RC_Sequence_Winter_C) == 0x0002A8, "Wrong size on ABP_RC_Sequence_Winter_C");
static_assert(offsetof(ABP_RC_Sequence_Winter_C, FloodLight2) == 0x000290, "Member 'ABP_RC_Sequence_Winter_C::FloodLight2' has a wrong offset!");
static_assert(offsetof(ABP_RC_Sequence_Winter_C, FloodLight1) == 0x000298, "Member 'ABP_RC_Sequence_Winter_C::FloodLight1' has a wrong offset!");
static_assert(offsetof(ABP_RC_Sequence_Winter_C, FloodLight) == 0x0002A0, "Member 'ABP_RC_Sequence_Winter_C::FloodLight' has a wrong offset!");

}

