#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RC_Sequence_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RC_Sequence_2.BP_RC_Sequence_2_C.GetHandTargetLocation
// 0x0050 (0x0050 - 0x0000)
struct BP_RC_Sequence_2_C_GetHandTargetLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RC_Sequence_2_C_GetHandTargetLocation) == 0x000010, "Wrong alignment on BP_RC_Sequence_2_C_GetHandTargetLocation");
static_assert(sizeof(BP_RC_Sequence_2_C_GetHandTargetLocation) == 0x000050, "Wrong size on BP_RC_Sequence_2_C_GetHandTargetLocation");
static_assert(offsetof(BP_RC_Sequence_2_C_GetHandTargetLocation, ReturnValue) == 0x000000, "Member 'BP_RC_Sequence_2_C_GetHandTargetLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RC_Sequence_2_C_GetHandTargetLocation, CallFunc_GetSocketTransform_ReturnValue) == 0x000010, "Member 'BP_RC_Sequence_2_C_GetHandTargetLocation::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RC_Sequence_2_C_GetHandTargetLocation, CallFunc_TransformLocation_ReturnValue) == 0x000040, "Member 'BP_RC_Sequence_2_C_GetHandTargetLocation::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");

}

