#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shredder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Shredder.BP_Shredder_C.UserConstructionScript
// 0x0150 (0x0150 - 0x0000)
struct BP_Shredder_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0xB];                                       // 0x0065(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_1;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_2;                // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shredder_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Shredder_C_UserConstructionScript");
static_assert(sizeof(BP_Shredder_C_UserConstructionScript) == 0x000150, "Wrong size on BP_Shredder_C_UserConstructionScript");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue) == 0x000000, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000014, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000058, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000060, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000064, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_1) == 0x000070, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_2) == 0x0000A0, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_3) == 0x0000D0, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_4) == 0x000100, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x000130, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000138, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x00013C, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue_1) == 0x000140, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue_2) == 0x000144, "Member 'BP_Shredder_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue_2' has a wrong offset!");

// Function BP_Shredder.BP_Shredder_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Shredder_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Shredder_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Shredder_C_ReceiveTick");
static_assert(sizeof(BP_Shredder_C_ReceiveTick) == 0x000004, "Wrong size on BP_Shredder_C_ReceiveTick");
static_assert(offsetof(BP_Shredder_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Shredder_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Shredder.BP_Shredder_C.ExecuteUbergraph_BP_Shredder
// 0x0150 (0x0150 - 0x0000)
struct BP_Shredder_C_ExecuteUbergraph_BP_Shredder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x003C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder) == 0x000008, "Wrong alignment on BP_Shredder_C_ExecuteUbergraph_BP_Shredder");
static_assert(sizeof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder) == 0x000150, "Wrong size on BP_Shredder_C_ExecuteUbergraph_BP_Shredder");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, EntryPoint) == 0x000000, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000010, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_NormalizeAxis_ReturnValue) == 0x000020, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_NormalizeAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_MakeRotator_ReturnValue) == 0x000024, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_MakeRotator_ReturnValue_1) == 0x000030, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00003C, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Shredder_C_ExecuteUbergraph_BP_Shredder, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000C4, "Member 'BP_Shredder_C_ExecuteUbergraph_BP_Shredder::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

}

