#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIStyle_Orange

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UIStyle_Orange.BP_UIStyle_Orange_C.ExecuteUbergraph_BP_UIStyle_Orange
// 0x00B4 (0x00B4 - 0x0000)
struct BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_Dark;                   // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_Medium;                 // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_Bright;                 // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_Negative;               // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_Positive;               // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_Background;             // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_BrightBackground;       // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_Border;                 // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_BrickRigs;              // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_Fluppisoft;             // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeDefaultColors_FluppisoftForeground;   // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange) == 0x000004, "Wrong alignment on BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange");
static_assert(sizeof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange) == 0x0000B4, "Wrong size on BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, EntryPoint) == 0x000000, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_Dark) == 0x000004, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_Dark' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_Medium) == 0x000014, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_Medium' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_Bright) == 0x000024, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_Bright' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_Negative) == 0x000034, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_Negative' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_Positive) == 0x000044, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_Positive' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_Background) == 0x000054, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_Background' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_BrightBackground) == 0x000064, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_BrightBackground' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_Border) == 0x000074, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_Border' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_BrickRigs) == 0x000084, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_BrickRigs' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_Fluppisoft) == 0x000094, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_Fluppisoft' has a wrong offset!");
static_assert(offsetof(BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange, CallFunc_MakeDefaultColors_FluppisoftForeground) == 0x0000A4, "Member 'BP_UIStyle_Orange_C_ExecuteUbergraph_BP_UIStyle_Orange::CallFunc_MakeDefaultColors_FluppisoftForeground' has a wrong offset!");

}

