#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Winter_Sequence

#include "Basic.hpp"

#include "BrickRigs_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Winter_Sequence.BP_Winter_Sequence_C
// 0x0038 (0x0278 - 0x0240)
class ABP_Winter_Sequence_C final : public AMenuSequence
{
public:
	class UChildActorComponent*                   ChildActor2;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor1;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Winter_Sequence_C">();
	}
	static class ABP_Winter_Sequence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Winter_Sequence_C>();
	}
};
static_assert(alignof(ABP_Winter_Sequence_C) == 0x000008, "Wrong alignment on ABP_Winter_Sequence_C");
static_assert(sizeof(ABP_Winter_Sequence_C) == 0x000278, "Wrong size on ABP_Winter_Sequence_C");
static_assert(offsetof(ABP_Winter_Sequence_C, ChildActor2) == 0x000240, "Member 'ABP_Winter_Sequence_C::ChildActor2' has a wrong offset!");
static_assert(offsetof(ABP_Winter_Sequence_C, ChildActor1) == 0x000248, "Member 'ABP_Winter_Sequence_C::ChildActor1' has a wrong offset!");
static_assert(offsetof(ABP_Winter_Sequence_C, ChildActor) == 0x000250, "Member 'ABP_Winter_Sequence_C::ChildActor' has a wrong offset!");
static_assert(offsetof(ABP_Winter_Sequence_C, Camera) == 0x000258, "Member 'ABP_Winter_Sequence_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_Winter_Sequence_C, InstancedStaticMesh) == 0x000260, "Member 'ABP_Winter_Sequence_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Winter_Sequence_C, Scene) == 0x000268, "Member 'ABP_Winter_Sequence_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Winter_Sequence_C, SkeletalMesh) == 0x000270, "Member 'ABP_Winter_Sequence_C::SkeletalMesh' has a wrong offset!");

}

