#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrickRigs

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "BrickRigs_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FluMoveSync_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CableComponent_classes.hpp"
#include "PhysicsCore_classes.hpp"
#include "Slate_structs.hpp"
#include "InputCore_structs.hpp"
#include "FluUGC_structs.hpp"


namespace SDK
{

// Class BrickRigs.PagedListEntryWidget
// 0x0028 (0x0288 - 0x0260)
class UPagedListEntryWidget : public UUserWidget
{
public:
	uint8                                         Pad_260[0x10];                                     // 0x0260(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickButtonWidget*                     Button;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_278[0x10];                                     // 0x0278(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitializeEntry();
	void OnClickedEntry();
	void OnDoubleClickedEntry();
	void UpdateButtonSelected(bool bNewSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PagedListEntryWidget">();
	}
	static class UPagedListEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPagedListEntryWidget>();
	}
};
static_assert(alignof(UPagedListEntryWidget) == 0x000008, "Wrong alignment on UPagedListEntryWidget");
static_assert(sizeof(UPagedListEntryWidget) == 0x000288, "Wrong size on UPagedListEntryWidget");
static_assert(offsetof(UPagedListEntryWidget, Button) == 0x000270, "Member 'UPagedListEntryWidget::Button' has a wrong offset!");

// Class BrickRigs.KickedPlayerWidget
// 0x0088 (0x0310 - 0x0288)
class UKickedPlayerWidget : public UPagedListEntryWidget
{
public:
	struct FKickedPlayer                          Entry;                                             // 0x0288(0x0060)(Transient, NativeAccessSpecifierPrivate)
	class UBrickTextBlock*                        NameTextBlock;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBrickTextBlock*                        IdTextBlock;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBrickTextBlock*                        KickTimeTextBlock;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBrickTextBlock*                        KickDurationTextBlock;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBrickTextBlock*                        KickTimeRemainingTextBlock;                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KickedPlayerWidget">();
	}
	static class UKickedPlayerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKickedPlayerWidget>();
	}
};
static_assert(alignof(UKickedPlayerWidget) == 0x000008, "Wrong alignment on UKickedPlayerWidget");
static_assert(sizeof(UKickedPlayerWidget) == 0x000310, "Wrong size on UKickedPlayerWidget");
static_assert(offsetof(UKickedPlayerWidget, Entry) == 0x000288, "Member 'UKickedPlayerWidget::Entry' has a wrong offset!");
static_assert(offsetof(UKickedPlayerWidget, NameTextBlock) == 0x0002E8, "Member 'UKickedPlayerWidget::NameTextBlock' has a wrong offset!");
static_assert(offsetof(UKickedPlayerWidget, IdTextBlock) == 0x0002F0, "Member 'UKickedPlayerWidget::IdTextBlock' has a wrong offset!");
static_assert(offsetof(UKickedPlayerWidget, KickTimeTextBlock) == 0x0002F8, "Member 'UKickedPlayerWidget::KickTimeTextBlock' has a wrong offset!");
static_assert(offsetof(UKickedPlayerWidget, KickDurationTextBlock) == 0x000300, "Member 'UKickedPlayerWidget::KickDurationTextBlock' has a wrong offset!");
static_assert(offsetof(UKickedPlayerWidget, KickTimeRemainingTextBlock) == 0x000308, "Member 'UKickedPlayerWidget::KickTimeRemainingTextBlock' has a wrong offset!");

// Class BrickRigs.BrickEditorObjectStaticInfo
// 0x0068 (0x0090 - 0x0028)
class UBrickEditorObjectStaticInfo : public UObject
{
public:
	TSubclassOf<class UBrickEditorObject>         ObjectClass;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ObjectTypeDisplayName;                             // 0x0030(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0048(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         Price;                                             // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMirrorMode                                   MirrorMode;                                        // 0x0064(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         MirrorClassOverride;                               // 0x0068(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MirrorRotationOrigin;                              // 0x0080(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrickEditorObjectStaticInfo">();
	}
	static class UBrickEditorObjectStaticInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrickEditorObjectStaticInfo>();
	}
};
static_assert(alignof(UBrickEditorObjectStaticInfo) == 0x000008, "Wrong alignment on UBrickEditorObjectStaticInfo");
static_assert(sizeof(UBrickEditorObjectStaticInfo) == 0x000090, "Wrong size on UBrickEditorObjectStaticInfo");
static_assert(offsetof(UBrickEditorObjectStaticInfo, ObjectClass) == 0x000028, "Member 'UBrickEditorObjectStaticInfo::ObjectClass' has a wrong offset!");
static_assert(offsetof(UBrickEditorObjectStaticInfo, ObjectTypeDisplayName) == 0x000030, "Member 'UBrickEditorObjectStaticInfo::ObjectTypeDisplayName' has a wrong offset!");
static_assert(offsetof(UBrickEditorObjectStaticInfo, Description) == 0x000048, "Member 'UBrickEditorObjectStaticInfo::Description' has a wrong offset!");
static_assert(offsetof(UBrickEditorObjectStaticInfo, Price) == 0x000060, "Member 'UBrickEditorObjectStaticInfo::Price' has a wrong offset!");
static_assert(offsetof(UBrickEditorObjectStaticInfo, MirrorMode) == 0x000064, "Member 'UBrickEditorObjectStaticInfo::MirrorMode' has a wrong offset!");
static_assert(offsetof(UBrickEditorObjectStaticInfo, MirrorClassOverride) == 0x000068, "Member 'UBrickEditorObjectStaticInfo::MirrorClassOverride' has a wrong offset!");
static_assert(offsetof(UBrickEditorObjectStaticInfo, MirrorRotationOrigin) == 0x000080, "Member 'UBrickEditorObjectStaticInfo::MirrorRotationOrigin' has a wrong offset!");

// Class BrickRigs.BrickEditorObject
// 0x0060 (0x0088 - 0x0028)
class UBrickEditorObject : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 StaticInfoClass;                                   // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FTransform GetBodyTransform() const;
	class ABrickEditor* GetBrickEditor() const;
	struct FVector GetBrickEditorObjectBoundsOrigin() const;
	class FText GetBrickEditorObjectDisplayName() const;
	bool GetBrickEditorObjectLocalBounds(struct FVector* OutBoundsMin, struct FVector* OutBoundsMax) const;
	struct FVector GetBrickEditorObjectSpawnLocation() const;
	struct FRotator GetBrickEditorObjectSpawnRotation() const;
	struct FTransform GetBrickEditorObjectSpawnTransform() const;
	class FText GetBrickEditorObjectTypeDisplayName() const;
	const class UBrickEditorStaticInfo* GetBrickEditorStaticInfo() const;
	class UBrickEditorInterfaceComponent* GetEditorInterface() const;
	const struct FBrickEditorObjectID GetEditorObjectID() const;
	class UPrimitiveComponent* GetRootComponent() const;
	const class UBrickEditorObjectStaticInfo* GetStaticInfo() const;
	class UClass* GetStaticInfoClass() const;
	struct FTransform GetWorldTransform() const;
	bool IsBrickEditorObjectBeingInitialized() const;
	bool IsBrickEditorObjectBeingUninitialized() const;
	bool IsBrickEditorObjectInitialized() const;
	bool IsInEditor() const;
	bool IsInThumbnailRender() const;
	bool IsSpawned() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrickEditorObject">();
	}
	static class UBrickEditorObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrickEditorObject>();
	}
};
static_assert(alignof(UBrickEditorObject) == 0x000008, "Wrong alignment on UBrickEditorObject");
static_assert(sizeof(UBrickEditorObject) == 0x000088, "Wrong size on UBrickEditorObject");
static_assert(offsetof(UBrickEditorObject, StaticInfoClass) == 0x000030, "Member 'UBrickEditorObject::StaticInfoClass' has a wrong offset!");

// Class BrickRigs.Brick
// 0x0070 (0x00F8 - 0x0088)
class UBrick : public UBrickEditorObject
{
public:
	TArray<class UBrickConnection*>               BrickConnections;                                  // 0x0088(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UBrick*                                 BrickPartRoot;                                     // 0x0098(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBrick*                                 BrickClusterRoot;                                  // 0x00A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x16];                                      // 0x00A8(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bEnableBlueprintEvents : 1;                        // 0x00BE(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrickTickFunction                     PrimaryBrickTick;                                  // 0x00C0(0x0018)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UBrickMaterial*                         BrickMaterial;                                     // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 BrickColor;                                        // 0x00E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBrickPattern>              BrickPattern;                                      // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGenerateLift;                                     // 0x00F0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginPlay();
	bool ClusterConsumeFuel(float Amount);
	void EndPlay();
	bool ExtinguishFire();
	void Interact_PickUp(class ABrickPlayerController* OtherPC);
	void MarkBrickBurnt();
	void Repair();
	void SetIsBrickBurnt(bool bNewBurnt);
	void SetIsBrickDamaged(bool bNewDamaged);
	bool SetOnFire();
	void Tick(float DeltaTime);
	bool UpdateBrickTickEnabled();

	bool CanBrickBurn() const;
	bool ClusterRootHasAnyFuel() const;
	class UBrick* GetBrickClusterRoot() const;
	const TArray<class UBrickConnection*> GetBrickConnections() const;
	class UBrick* GetBrickPartRoot() const;
	class ABrickVehicle* GetVehicle() const;
	class UBrickVehicleComponent* GetVehicleComponent() const;
	const class UBrickVehicleStaticInfo* GetVehicleStaticInfo() const;
	bool IsBrickBurnt() const;
	bool IsBrickClusterRoot() const;
	bool IsBrickDamaged() const;
	bool IsBrickPartRoot() const;
	bool IsBrickTickEnabled() const;
	bool IsConnectedToAnyBrick() const;
	bool IsConnectedToRoot() const;
	bool IsControllable() const;
	bool IsOnFire() const;
	bool ShouldTick() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Brick">();
	}
	static class UBrick* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrick>();
	}
};
static_assert(alignof(UBrick) == 0x000008, "Wrong alignment on UBrick");
static_assert(sizeof(UBrick) == 0x0000F8, "Wrong size on UBrick");
static_assert(offsetof(UBrick, BrickConnections) == 0x000088, "Member 'UBrick::BrickConnections' has a wrong offset!");
static_assert(offsetof(UBrick, BrickPartRoot) == 0x000098, "Member 'UBrick::BrickPartRoot' has a wrong offset!");
static_assert(offsetof(UBrick, BrickClusterRoot) == 0x0000A0, "Member 'UBrick::BrickClusterRoot' has a wrong offset!");
static_assert(offsetof(UBrick, PrimaryBrickTick) == 0x0000C0, "Member 'UBrick::PrimaryBrickTick' has a wrong offset!");
static_assert(offsetof(UBrick, BrickMaterial) == 0x0000D8, "Member 'UBrick::BrickMaterial' has a wrong offset!");
static_assert(offsetof(UBrick, BrickColor) == 0x0000E0, "Member 'UBrick::BrickColor' has a wrong offset!");
static_assert(offsetof(UBrick, BrickPattern) == 0x0000E8, "Member 'UBrick::BrickPattern' has a wrong offset!");
static_assert(offsetof(UBrick, bGenerateLift) == 0x0000F0, "Member 'UBrick::bGenerateLift' has a wrong offset!");

// Class BrickRigs.ScalableBrickBase
// 0x0018 (0x0110 - 0x00F8)
class UScalableBrickBase : public UBrick
{
public:
	uint8                                         Pad_F8[0x14];                                      // 0x00F8(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableBrickConnectorSpacing         ConnectorSpacing;                                  // 0x010C(0x0002)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScalableBrickBase">();
	}
	static class UScalableBrickBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScalableBrickBase>();
	}
};
static_assert(alignof(UScalableBrickBase) == 0x000008, "Wrong alignment on UScalableBrickBase");
static_assert(sizeof(UScalableBrickBase) == 0x000110, "Wrong size on UScalableBrickBase");
static_assert(offsetof(UScalableBrickBase, ConnectorSpacing) == 0x00010C, "Member 'UScalableBrickBase::ConnectorSpacing' has a wrong offset!");

// Class BrickRigs.BrickBorder
// 0x0010 (0x0280 - 0x0270)
class UBrickBorder final : public UBorder
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EBrickUIBrushStyle                            BrushStyle;                                        // 0x0278(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBrickUIColorStyle                            ColorStyle;                                        // 0x0279(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBrickUIStyleState                            StyleState;                                        // 0x027A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBrickUIPaddingStyle                          PaddingStyle;                                      // 0x027B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBrushStyle(EBrickUIBrushStyle NewStyle);
	void SetColorStyle(EBrickUIColorStyle NewStyle);
	void SetPaddingStyle(EBrickUIPaddingStyle NewStyle);
	void SetStyleState(EBrickUIStyleState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrickBorder">();
	}
	static class UBrickBorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrickBorder>();
	}
};
static_assert(alignof(UBrickBorder) == 0x000008, "Wrong alignment on UBrickBorder");
static_assert(sizeof(UBrickBorder) == 0x000280, "Wrong size on UBrickBorder");
static_assert(offsetof(UBrickBorder, BrushStyle) == 0x000278, "Member 'UBrickBorder::BrushStyle' has a wrong offset!");
static_assert(offsetof(UBrickBorder, ColorStyle) == 0x000279, "Member 'UBrickBorder::ColorStyle' has a wrong offset!");
static_assert(offsetof(UBrickBorder, StyleState) == 0x00027A, "Member 'UBrickBorder::StyleState' has a wrong offset!");
static_assert(offsetof(UBrickBorder, PaddingStyle) == 0x00027B, "Member 'UBrickBorder::PaddingStyle' has a wrong offset!");

// Class BrickRigs.CameraBrickWidget
// 0x0018 (0x0278 - 0x0260)
class UCameraBrickWidget : public UUserWidget
{
public:
	uint8                                         Pad_260[0xC];                                      // 0x0260(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUpdateTargetRange;                                // 0x026C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetRangeUpdateInterval;                         // 0x0270(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateTargetRange(bool bHitSomething, float Distance);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraBrickWidget">();
	}
	static class UCameraBrickWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraBrickWidget>();
	}
};
static_assert(alignof(UCameraBrickWidget) == 0x000008, "Wrong alignment on UCameraBrickWidget");
static_assert(sizeof(UCameraBrickWidget) == 0x000278, "Wrong size on UCameraBrickWidget");
static_assert(offsetof(UCameraBrickWidget, bUpdateTargetRange) == 0x00026C, "Member 'UCameraBrickWidget::bUpdateTargetRange' has a wrong offset!");
static_assert(offsetof(UCameraBrickWidget, TargetRangeUpdateInterval) == 0x000270, "Member 'UCameraBrickWidget::TargetRangeUpdateInterval' has a wrong offset!");

// Class BrickRigs.BrickStaticInfo
// 0x00D8 (0x0168 - 0x0090)
class UBrickStaticInfo : public UBrickEditorObjectStaticInfo
{
public:
	float                                         LiftSurfaceRadius;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LiftSurfaceLocation;                               // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LiftSurfaceNormal;                                 // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh;                                        // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBrickMaterial*                         DefaultBrickMaterial;                              // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     DefaultMaterial;                                   // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     TranslucentMaterial;                               // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HiddenMaterial;                                    // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PhysicsVisualizationMaterial;                      // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ThumbnailBrickColor;                               // 0x00E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BrickSize;                                         // 0x00E4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAppendBrickSizeToDisplayName;                     // 0x00F0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PricePerSize;                                      // 0x00F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FConnectorField>                Connectors;                                        // 0x00F8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         MaxConnectorDist;                                  // 0x0108(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MassScale;                                         // 0x010C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisplayMassScale;                                  // 0x0110(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InertiaTensorScale;                                // 0x0114(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBrickPhysicalMaterial*                 PhysicalMaterialOverride;                          // 0x0120(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bGenerateFluidDynamicSurface : 1;                  // 0x0128(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDefaultGenerateLift : 1;                          // 0x0128(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCalculatePhysicsPropertiesFromShapes : 1;         // 0x0128(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Volume;                                            // 0x012C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CenterOfMass;                                      // 0x0130(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InertiaTensor0;                                    // 0x013C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InertiaTensor1;                                    // 0x0148(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InertiaTensor2;                                    // 0x0154(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MovementReplicationPriority;                       // 0x0160(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrickStaticInfo">();
	}
	static class UBrickStaticInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrickStaticInfo>();
	}
};
static_assert(alignof(UBrickStaticInfo) == 0x000008, "Wrong alignment on UBrickStaticInfo");
static_assert(sizeof(UBrickStaticInfo) == 0x000168, "Wrong size on UBrickStaticInfo");
static_assert(offsetof(UBrickStaticInfo, LiftSurfaceRadius) == 0x000090, "Member 'UBrickStaticInfo::LiftSurfaceRadius' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, LiftSurfaceLocation) == 0x000094, "Member 'UBrickStaticInfo::LiftSurfaceLocation' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, LiftSurfaceNormal) == 0x0000A0, "Member 'UBrickStaticInfo::LiftSurfaceNormal' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, StaticMesh) == 0x0000B0, "Member 'UBrickStaticInfo::StaticMesh' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, DefaultBrickMaterial) == 0x0000B8, "Member 'UBrickStaticInfo::DefaultBrickMaterial' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, DefaultMaterial) == 0x0000C0, "Member 'UBrickStaticInfo::DefaultMaterial' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, TranslucentMaterial) == 0x0000C8, "Member 'UBrickStaticInfo::TranslucentMaterial' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, HiddenMaterial) == 0x0000D0, "Member 'UBrickStaticInfo::HiddenMaterial' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, PhysicsVisualizationMaterial) == 0x0000D8, "Member 'UBrickStaticInfo::PhysicsVisualizationMaterial' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, ThumbnailBrickColor) == 0x0000E0, "Member 'UBrickStaticInfo::ThumbnailBrickColor' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, BrickSize) == 0x0000E4, "Member 'UBrickStaticInfo::BrickSize' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, bAppendBrickSizeToDisplayName) == 0x0000F0, "Member 'UBrickStaticInfo::bAppendBrickSizeToDisplayName' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, PricePerSize) == 0x0000F4, "Member 'UBrickStaticInfo::PricePerSize' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, Connectors) == 0x0000F8, "Member 'UBrickStaticInfo::Connectors' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, MaxConnectorDist) == 0x000108, "Member 'UBrickStaticInfo::MaxConnectorDist' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, MassScale) == 0x00010C, "Member 'UBrickStaticInfo::MassScale' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, DisplayMassScale) == 0x000110, "Member 'UBrickStaticInfo::DisplayMassScale' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, InertiaTensorScale) == 0x000114, "Member 'UBrickStaticInfo::InertiaTensorScale' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, PhysicalMaterialOverride) == 0x000120, "Member 'UBrickStaticInfo::PhysicalMaterialOverride' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, Volume) == 0x00012C, "Member 'UBrickStaticInfo::Volume' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, CenterOfMass) == 0x000130, "Member 'UBrickStaticInfo::CenterOfMass' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, InertiaTensor0) == 0x00013C, "Member 'UBrickStaticInfo::InertiaTensor0' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, InertiaTensor1) == 0x000148, "Member 'UBrickStaticInfo::InertiaTensor1' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, InertiaTensor2) == 0x000154, "Member 'UBrickStaticInfo::InertiaTensor2' has a wrong offset!");
static_assert(offsetof(UBrickStaticInfo, MovementReplicationPriority) == 0x000160, "Member 'UBrickStaticInfo::MovementReplicationPriority' has a wrong offset!");

// Class BrickRigs.BrickBuildingDebris
// 0x0050 (0x0270 - 0x0220)
class ABrickBuildingDebris : public AActor
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          DebrisMeshComponent;                               // 0x0228(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystemComponent*               CollapsePSC;                                       // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                        CollapseAC;                                        // 0x0238(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            DebrisMesh;                                        // 0x0240(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DebrisSpacing;                                     // 0x0248(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DebrisLocationJitter;                              // 0x024C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DebrisRotationJitter;                              // 0x0258(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CollapseSound;                                     // 0x0260(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                        CollapseEmitter;                                   // 0x0268(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrickBuildingDebris">();
	}
	static class ABrickBuildingDebris* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABrickBuildingDebris>();
	}
};
static_assert(alignof(ABrickBuildingDebris) == 0x000008, "Wrong alignment on ABrickBuildingDebris");
static_assert(sizeof(ABrickBuildingDebris) == 0x000270, "Wrong size on ABrickBuildingDebris");
static_assert(offsetof(ABrickBuildingDebris, DebrisMeshComponent) == 0x000228, "Member 'ABrickBuildingDebris::DebrisMeshComponent' has a wrong offset!");
static_assert(offsetof(ABrickBuildingDebris, CollapsePSC) == 0x000230, "Member 'ABrickBuildingDebris::CollapsePSC' has a wrong offset!");
static_assert(offsetof(ABrickBuildingDebris, CollapseAC) == 0x000238, "Member 'ABrickBuildingDebris::CollapseAC' has a wrong offset!");
static_assert(offsetof(ABrickBuildingDebris, DebrisMesh) == 0x000240, "Member 'ABrickBuildingDebris::DebrisMesh' has a wrong offset!");
static_assert(offsetof(ABrickBuildingDebris, DebrisSpacing) == 0x000248, "Member 'ABrickBuildingDebris::DebrisSpacing' has a wrong offset!");
static_assert(offsetof(ABrickBuildingDebris, DebrisLocationJitter) == 0x00024C, "Member 'ABrickBuildingDebris::DebrisLocationJitter' has a wrong offset!");
static_assert(offsetof(ABrickBuildingDebris, DebrisRotationJitter) == 0x000258, "Member 'ABrickBuildingDebris::DebrisRotationJitter' has a wrong offset!");
static_assert(offsetof(ABrickBuildingDebris, CollapseSound) == 0x000260, "Member 'ABrickBuildingDebris::CollapseSound' has a wrong offset!");
static_assert(offsetof(ABrickBuildingDebris, CollapseEmitter) == 0x000268, "Member 'ABrickBuildingDebris::CollapseEmitter' has a wrong offset!");

// Class BrickRigs.HUDIconWidget
// 0x0028 (0x0288 - 0x0260)
class UHUDIconWidget : public UUserWidget
{
public:
	uint8                                         Pad_260[0x18];                                     // 0x0260(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickImage*                            IconImage;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              IconSize;                                          // 0x0280(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void InitializeIcon();
	void PostInitializeIcon();
	void SetIconColorStyle(EBrickUIColorStyle NewColorStyle);
	void SetIconSlot(const struct FBrickUIIconSlot& NewSlot);
	void UninitializeIcon();
	void UpdateIconRotation(float NewRotation);
	void UpdateIconStyle(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InStyleState);
	void UpdateNameText();

	class FText GetIconDisplayName() const;
	bool GetIconWorldRotation(float* OutRotation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDIconWidget">();
	}
	static class UHUDIconWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDIconWidget>();
	}
};
static_assert(alignof(UHUDIconWidget) == 0x000008, "Wrong alignment on UHUDIconWidget");
static_assert(sizeof(UHUDIconWidget) == 0x000288, "Wrong size on UHUDIconWidget");
static_assert(offsetof(UHUDIconWidget, IconImage) == 0x000278, "Member 'UHUDIconWidget::IconImage' has a wrong offset!");
static_assert(offsetof(UHUDIconWidget, IconSize) == 0x000280, "Member 'UHUDIconWidget::IconSize' has a wrong offset!");

// Class BrickRigs.InteractionIconWidget
// 0x0000 (0x0288 - 0x0288)
class UInteractionIconWidget : public UHUDIconWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InteractionIconWidget">();
	}
	static class UInteractionIconWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionIconWidget>();
	}
};
static_assert(alignof(UInteractionIconWidget) == 0x000008, "Wrong alignment on UInteractionIconWidget");
static_assert(sizeof(UInteractionIconWidget) == 0x000288, "Wrong size on UInteractionIconWidget");

// Class BrickRigs.ActuatorBrickBaseStaticInfo
// 0x0010 (0x0178 - 0x0168)
class UActuatorBrickBaseStaticInfo : public UBrickStaticInfo
{
public:
	EAxis                                         ActuationAxis;                                     // 0x0168(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LinearActuationOffset;                             // 0x016C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearActuationRange;                              // 0x0170(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActuatorBrickBaseStaticInfo">();
	}
	static class UActuatorBrickBaseStaticInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActuatorBrickBaseStaticInfo>();
	}
};
static_assert(alignof(UActuatorBrickBaseStaticInfo) == 0x000008, "Wrong alignment on UActuatorBrickBaseStaticInfo");
static_assert(sizeof(UActuatorBrickBaseStaticInfo) == 0x000178, "Wrong size on UActuatorBrickBaseStaticInfo");
static_assert(offsetof(UActuatorBrickBaseStaticInfo, ActuationAxis) == 0x000168, "Member 'UActuatorBrickBaseStaticInfo::ActuationAxis' has a wrong offset!");
static_assert(offsetof(UActuatorBrickBaseStaticInfo, LinearActuationOffset) == 0x00016C, "Member 'UActuatorBrickBaseStaticInfo::LinearActuationOffset' has a wrong offset!");
static_assert(offsetof(UActuatorBrickBaseStaticInfo, LinearActuationRange) == 0x000170, "Member 'UActuatorBrickBaseStaticInfo::LinearActuationRange' has a wrong offset!");

// Class BrickRigs.CameraBrickStaticInfo
// 0x05D8 (0x0740 - 0x0168)
#pragma pack(push, 0x1)
class alignas(0x10) UCameraBrickStaticInfo : public UBrickStaticInfo
{
public:
	struct FVector                                LenseOffset;                                       // 0x0168(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FViewTargetZoomParams                  ZoomParams;                                        // 0x0174(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bViewRotationInWorldSpace;                         // 0x018C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateViewWhenInteracting;                        // 0x018D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0190(0x0560)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     NotConnectedPostProcessMaterial;                   // 0x06F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   HUDWidgetClass;                                    // 0x06F8(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTargetRange;                                    // 0x0720(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         ViewPitchRange;                                    // 0x0724(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         ViewYawRange;                                      // 0x072C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraBrickStaticInfo">();
	}
	static class UCameraBrickStaticInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraBrickStaticInfo>();
	}
};
#pragma pack(pop)
static_assert(alignof(UCameraBrickStaticInfo) == 0x000010, "Wrong alignment on UCameraBrickStaticInfo");
static_assert(sizeof(UCameraBrickStaticInfo) == 0x000740, "Wrong size on UCameraBrickStaticInfo");
static_assert(offsetof(UCameraBrickStaticInfo, LenseOffset) == 0x000168, "Member 'UCameraBrickStaticInfo::LenseOffset' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, ZoomParams) == 0x000174, "Member 'UCameraBrickStaticInfo::ZoomParams' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, bViewRotationInWorldSpace) == 0x00018C, "Member 'UCameraBrickStaticInfo::bViewRotationInWorldSpace' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, bRotateViewWhenInteracting) == 0x00018D, "Member 'UCameraBrickStaticInfo::bRotateViewWhenInteracting' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, PostProcessSettings) == 0x000190, "Member 'UCameraBrickStaticInfo::PostProcessSettings' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, NotConnectedPostProcessMaterial) == 0x0006F0, "Member 'UCameraBrickStaticInfo::NotConnectedPostProcessMaterial' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, HUDWidgetClass) == 0x0006F8, "Member 'UCameraBrickStaticInfo::HUDWidgetClass' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, MaxTargetRange) == 0x000720, "Member 'UCameraBrickStaticInfo::MaxTargetRange' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, ViewPitchRange) == 0x000724, "Member 'UCameraBrickStaticInfo::ViewPitchRange' has a wrong offset!");
static_assert(offsetof(UCameraBrickStaticInfo, ViewYawRange) == 0x00072C, "Member 'UCameraBrickStaticInfo::ViewYawRange' has a wrong offset!");

// Class BrickRigs.BaseCharacterMovementComponent
// 0x0010 (0x0B00 - 0x0AF0)
class UBaseCharacterMovementComponent : public UCharacterMovementComponent
{
public:
	uint8                                         Pad_AF0[0xC];                                      // 0x0AF0(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxSprintSpeed;                                    // 0x0AFC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseCharacterMovementComponent">();
	}
	static class UBaseCharacterMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCharacterMovementComponent>();
	}
};
static_assert(alignof(UBaseCharacterMovementComponent) == 0x000010, "Wrong alignment on UBaseCharacterMovementComponent");
static_assert(sizeof(UBaseCharacterMovementComponent) == 0x000B00, "Wrong size on UBaseCharacterMovementComponent");
static_assert(offsetof(UBaseCharacterMovementComponent, MaxSprintSpeed) == 0x000AFC, "Member 'UBaseCharacterMovementComponent::MaxSprintSpeed' has a wrong offset!");

// Class BrickRigs.BrickCharacterMovementComponent
// 0x0000 (0x0B00 - 0x0B00)
class UBrickCharacterMovementComponent final : public UBaseCharacterMovementComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrickCharacterMovementComponent">();
	}
	static class UBrickCharacterMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrickCharacterMovementComponent>();
	}
};
static_assert(alignof(UBrickCharacterMovementComponent) == 0x000010, "Wrong alignment on UBrickCharacterMovementComponent");
static_assert(sizeof(UBrickCharacterMovementComponent) == 0x000B00, "Wrong size on UBrickCharacterMovementComponent");

// Class BrickRigs.AdminLoginWidget
// 0x0038 (0x0298 - 0x0260)
class UAdminLoginWidget : public UUserWidget
{
public:
	class UBrickTextBoxWidget*                    TextBox;                                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   EnterPasswordText;                                 // 0x0268(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   LoggedInText;                                      // 0x0280(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnTextChanged(const class FText& Text, EValueChangedEventType EventType);
	void UpdateCanEverBeAdmin(bool bCanBeAdmin);
	void UpdateIsAdmin(bool bNewIsAdmin);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdminLoginWidget">();
	}
	static class UAdminLoginWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdminLoginWidget>();
	}
};
static_assert(alignof(UAdminLoginWidget) == 0x000008, "Wrong alignment on UAdminLoginWidget");
static_assert(sizeof(UAdminLoginWidget) == 0x000298, "Wrong size on UAdminLoginWidget");
static_assert(offsetof(UAdminLoginWidget, TextBox) == 0x000260, "Member 'UAdminLoginWidget::TextBox' has a wrong offset!");
static_assert(offsetof(UAdminLoginWidget, EnterPasswordText) == 0x000268, "Member 'UAdminLoginWidget::EnterPasswordText' has a wrong offset!");
static_assert(offsetof(UAdminLoginWidget, LoggedInText) == 0x000280, "Member 'UAdminLoginWidget::LoggedInText' has a wrong offset!");

// Class BrickRigs.BrickBuilding
// 0x00A0 (0x02C0 - 0x0220)
class alignas(0x10) ABrickBuilding : public AActor
{
public:
	uint8                                         Pad_220[0x30];                                     // 0x0220(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BuildingBoundsOrigin;                              // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                BuildingBoundsExtent;                              // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_268[0xC];                                      // 0x0268(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCollapsed : 1;                                    // 0x0274(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         CollapseAxisCompressed;                            // 0x0275(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_276[0xA];                                      // 0x0276(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrickBuildingDebris*                   DebrisActor;                                       // 0x0280(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0288(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            StaticMesh;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInterface*>             RandomMaterials;                                   // 0x0298(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FRandomStream                          RandomStream;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         MaxDamage;                                         // 0x02B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ABrickBuildingDebris>       DebrisClass;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_bCollapsed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BrickBuilding">();
	}
	static class ABrickBuilding* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABrickBuilding>();
	}
};
static_assert(alignof(ABrickBuilding) == 0x000010, "Wrong alignment on ABrickBuilding");
static_assert(sizeof(ABrickBuilding) == 0x0002C0, "Wrong size on ABrickBuilding");
static_assert(offsetof(ABrickBuilding, BuildingBoundsOrigin) == 0x000250, "Member 'ABrickBuilding::BuildingBoundsOrigin' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, BuildingBoundsExtent) == 0x00025C, "Member 'ABrickBuilding::BuildingBoundsExtent' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, CollapseAxisCompressed) == 0x000275, "Member 'ABrickBuilding::CollapseAxisCompressed' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, DebrisActor) == 0x000280, "Member 'ABrickBuilding::DebrisActor' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, StaticMeshComponent) == 0x000288, "Member 'ABrickBuilding::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, StaticMesh) == 0x000290, "Member 'ABrickBuilding::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, RandomMaterials) == 0x000298, "Member 'ABrickBuilding::RandomMaterials' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, RandomStream) == 0x0002A8, "Member 'ABrickBuilding::RandomStream' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, MaxDamage) == 0x0002B0, "Member 'ABrickBuilding::MaxDamage' has a wrong offset!");
static_assert(offsetof(ABrickBuilding, DebrisClass) == 0x0002B8, "Member 'ABrickBuilding::DebrisClass' has a wrong offset!");

// Class BrickRigs.ActuatorBrickStaticInfo
// 0x0020 (0x0198 - 0x0178)
class UActuatorBrickStaticInfo : public UActuatorBrickBaseStaticInfo
{
public:
	bool                                          bIsAngularActuator;                                // 0x0178(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActuationSpeed;                                    // 0x017C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLegacyLinearSlider;                             // 0x0180(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ActuatorSound;                                     // 0x0188(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReplicationErrorSmoothTime;                        // 0x0190(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActuatorBrickStaticInfo">();
	}
	static class UActuatorBrickStaticInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActuatorBrickStaticInfo>();
	}
};
static_assert(alignof(UActuatorBrickStaticInfo) == 0x000008, "Wrong alignment on UActuatorBrickStaticInfo");
static_assert(sizeof(UActuatorBrickStaticInfo) == 0x000198, "Wrong size on UActuatorBrickStaticInfo");
static_assert(offsetof(UActuatorBrickStaticInfo, bIsAngularActuator) == 0x000178, "Member 'UActuatorBrickStaticInfo::bIsAngularActuator' has a wrong offset!");
static_assert(offsetof(UActuatorBrickStaticInfo, ActuationSpeed) == 0x00017C, "Member 'UActuatorBrickStaticInfo::ActuationSpeed' has a wrong offset!");
static_assert(offsetof(UActuatorBrickStaticInfo, bIsLegacyLinearSlider) == 0x000180, "Member 'UActuatorBrickStaticInfo::bIsLegacyLinearSlider' has a wrong offset!");
static_assert(offsetof(UActuatorBrickStaticInfo, ActuatorSound) == 0x000188, "Member 'UActuatorBrickStaticInfo::ActuatorSound' has a wrong offset!");
static_assert(offsetof(UActuatorBrickStaticInfo, ReplicationErrorSmoothTime) == 0x000190, "Member 'UActuatorBrickStaticInfo::ReplicationErrorSmoothTime' has a wrong offset!");

// Class BrickRigs.ButtonWidgetBase
// 0x0020 (0x0280 - 0x0260)
class UButtonWidgetBase : public UUserWidget
{
public:
	uint8                                         Pad_260[0x10];                                     // 0x0260(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickBorder*                           Border;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
