#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrickRigs

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "FluUGC_structs.hpp"


namespace SDK
{

// Enum BrickRigs.EBrickUITextStyle
// NumValues: 0x000B
enum class EBrickUITextStyle : uint8
{
	Default                                  = 0,
	Bold                                     = 1,
	Small                                    = 2,
	Large                                    = 3,
	Positive                                 = 4,
	Negative                                 = 5,
	Neutral                                  = 6,
	HUD                                      = 7,
	HighContrast                             = 8,
	Custom                                   = 9,
	Max                                      = 10,
};

// Enum BrickRigs.EBrickUIStyleState
// NumValues: 0x0010
enum class EBrickUIStyleState : uint8
{
	Default                                  = 0,
	Border                                   = 1,
	Button                                   = 2,
	Pressed                                  = 3,
	Focused                                  = 4,
	Selected                                 = 5,
	FocusedSelected                          = 6,
	Marquee                                  = 7,
	Foreground                               = 8,
	ForegroundPressed                        = 9,
	ForegroundFocused                        = 10,
	ForegroundSelected                       = 11,
	ForegroundFocusedSelected                = 12,
	Background                               = 13,
	Custom                                   = 14,
	Max                                      = 15,
};

// Enum BrickRigs.EBrickUIBrushStyle
// NumValues: 0x000A
enum class EBrickUIBrushStyle : uint8
{
	Default                                  = 0,
	Button                                   = 1,
	FolderButton                             = 2,
	MapButton                                = 3,
	BorderlessButton                         = 4,
	KeyBorder                                = 5,
	Slider                                   = 6,
	Spacer                                   = 7,
	Custom                                   = 8,
	Max                                      = 9,
};

// Enum BrickRigs.EBrickUIColorStyle
// NumValues: 0x000A
enum class EBrickUIColorStyle : uint8
{
	Default                                  = 0,
	Highlight                                = 1,
	Positive                                 = 2,
	Negative                                 = 3,
	Neutral                                  = 4,
	EditorOutline                            = 5,
	GameLogo                                 = 6,
	DeveloperLogo                            = 7,
	Custom                                   = 8,
	Max                                      = 9,
};

// Enum BrickRigs.EBrickUIPaddingStyle
// NumValues: 0x0009
enum class EBrickUIPaddingStyle : uint8
{
	Border                                   = 0,
	Button                                   = 1,
	FolderButton                             = 2,
	MapButton                                = 3,
	BorderlessButton                         = 4,
	KeyBorder                                = 5,
	Slider                                   = 6,
	Custom                                   = 7,
	Max                                      = 8,
};

// Enum BrickRigs.EBrickUISpacingStyle
// NumValues: 0x0005
enum class EBrickUISpacingStyle : uint8
{
	Small                                    = 0,
	Medium                                   = 1,
	Large                                    = 2,
	Custom                                   = 3,
	Max                                      = 4,
};

// Enum BrickRigs.EBrickUIIconAtlas
// NumValues: 0x0013
enum class EBrickUIIconAtlas : uint8
{
	Default                                  = 0,
	MenuButtons                              = 1,
	MouseKeys                                = 2,
	GamepadKeys                              = 3,
	HUDIcons                                 = 4,
	FireModes                                = 5,
	AmmoTypes                                = 6,
	HealthIcons                              = 7,
	ScoreboardIcons                          = 8,
	ConnectionIcons                          = 9,
	ServerIcons                              = 10,
	HUDNotifications                         = 11,
	DashboardIcons                           = 12,
	SocialMediaIcons                         = 13,
	WeatherIcons                             = 14,
	ConnectorSpacingIcons                    = 15,
	SpinnerBrickShapeIcons                   = 16,
	Custom                                   = 17,
	Max                                      = 18,
};

// Enum BrickRigs.EPopupResult
// NumValues: 0x0005
enum class EPopupResult : uint8
{
	Confirm                                  = 0,
	Cancel                                   = 1,
	Ignore                                   = 2,
	ForceClose                               = 3,
	EPopupResult_MAX                         = 4,
};

// Enum BrickRigs.EInputActionListMode
// NumValues: 0x0005
enum class EInputActionListMode : uint8
{
	InputHelpClosed                          = 0,
	InputHelpOpen                            = 1,
	ContextMenu                              = 2,
	EditorTopBar                             = 3,
	EInputActionListMode_MAX                 = 4,
};

// Enum BrickRigs.EInputActionTriggerType
// NumValues: 0x0007
enum class EInputActionTriggerType : uint8
{
	Press                                    = 0,
	Tab                                      = 1,
	Hold                                     = 2,
	Axis                                     = 3,
	AxisPositive                             = 4,
	AxisNegative                             = 5,
	EInputActionTriggerType_MAX              = 6,
};

// Enum BrickRigs.EInteractionOptionSlot
// NumValues: 0x0005
enum class EInteractionOptionSlot : uint8
{
	Pri                                      = 0,
	Sec                                      = 1,
	Ter                                      = 2,
	Inventory                                = 3,
	EInteractionOptionSlot_MAX               = 4,
};

// Enum BrickRigs.EHUDIconDomain
// NumValues: 0x0005
enum class EHUDIconDomain : uint8
{
	Map                                      = 0,
	Spawn                                    = 1,
	SpawnPoints                              = 2,
	HUD                                      = 3,
	EHUDIconDomain_MAX                       = 4,
};

// Enum BrickRigs.EHUDVisibility
// NumValues: 0x0004
enum class EHUDVisibility : uint8
{
	Full                                     = 0,
	Minimal                                  = 1,
	Off                                      = 2,
	Max                                      = 3,
};

// Enum BrickRigs.EInputMethod
// NumValues: 0x0003
enum class EInputMethod : uint8
{
	Keyboard                                 = 0,
	Gamepad                                  = 1,
	EInputMethod_MAX                         = 2,
};

// Enum BrickRigs.EBrickUnitsDisplayMode
// NumValues: 0x0003
enum class EBrickUnitsDisplayMode : uint8
{
	BrickUnits                               = 0,
	DistanceUnits                            = 1,
	EBrickUnitsDisplayMode_MAX               = 2,
};

// Enum BrickRigs.EColorDisplayMode
// NumValues: 0x0003
enum class EColorDisplayMode : uint8
{
	HSV                                      = 0,
	RGB                                      = 1,
	EColorDisplayMode_MAX                    = 2,
};

// Enum BrickRigs.EMeasurementSystem
// NumValues: 0x0003
enum class EMeasurementSystem : uint8
{
	Metric                                   = 0,
	Imperial                                 = 1,
	Max                                      = 2,
};

// Enum BrickRigs.EBrickEditorViewMode
// NumValues: 0x0005
enum class EBrickEditorViewMode : uint8
{
	Default                                  = 0,
	Wireframe                                = 1,
	Physics                                  = 2,
	InputChannels                            = 3,
	EBrickEditorViewMode_MAX                 = 4,
};

// Enum BrickRigs.ETransmissionMode
// NumValues: 0x0003
enum class ETransmissionMode : uint8
{
	Manual                                   = 0,
	Automatic                                = 1,
	ETransmissionMode_MAX                    = 2,
};

// Enum BrickRigs.ECameraMode
// NumValues: 0x0005
enum class ECameraMode : uint8
{
	Local                                    = 0,
	Global                                   = 1,
	Orbital                                  = 2,
	Velocity                                 = 3,
	ECameraMode_MAX                          = 4,
};

// Enum BrickRigs.EChatContext
// NumValues: 0x0005
enum class EChatContext : uint8
{
	None                                     = 0,
	Global                                   = 1,
	Team                                     = 2,
	Admin                                    = 3,
	Max                                      = 4,
};

// Enum BrickRigs.EUGCDepartmentTag
// NumValues: 0x0006
enum class EUGCDepartmentTag : uint8
{
	None                                     = 0,
	Civil                                    = 1,
	Military                                 = 2,
	Police                                   = 3,
	FireDepartment                           = 4,
	Max                                      = 5,
};

// Enum BrickRigs.EUGCEraTag
// NumValues: 0x0009
enum class EUGCEraTag : uint8
{
	None                                     = 0,
	_1800s                                   = 1,
	_1900s                                   = 2,
	_2000s                                   = 3,
	Futuristic                               = 4,
	Ancient                                  = 5,
	WW2                                      = 6,
	WW1                                      = 7,
	Max                                      = 8,
};

// Enum BrickRigs.EUGCTypeTag
// NumValues: 0x0011
enum class EUGCTypeTag : uint8
{
	None                                     = 0,
	Car                                      = 1,
	RaceCar                                  = 2,
	Truck                                    = 3,
	HeavyMachinery                           = 4,
	Plane                                    = 5,
	Helicopter                               = 6,
	Tank                                     = 7,
	Train                                    = 8,
	Trailer                                  = 9,
	Prop                                     = 10,
	Building                                 = 11,
	Ship                                     = 12,
	SpaceCraft                               = 13,
	Bus                                      = 14,
	Motorcycle                               = 15,
	Max                                      = 16,
};

// Enum BrickRigs.EUGCContentVersion
// NumValues: 0x0004
enum class EUGCContentVersion : uint8
{
	Default                                  = 0,
	AutoSave                                 = 1,
	Backup                                   = 2,
	Max                                      = 3,
};

// Enum BrickRigs.EUGCType
// NumValues: 0x0005
enum class EUGCType : uint8
{
	None                                     = 0,
	Vehicle                                  = 1,
	Scenario                                 = 2,
	Mod                                      = 3,
	Max                                      = 4,
};

// Enum BrickRigs.EUGCFileType
// NumValues: 0x0008
enum class EUGCFileType : uint8
{
	None                                     = 0,
	Saved                                    = 1,
	SavedDevelopment                         = 2,
	SavedLegacy                              = 3,
	Content                                  = 4,
	Online                                   = 5,
	Inline                                   = 6,
	Max                                      = 7,
};

// Enum BrickRigs.EMatchVehicleFilter
// NumValues: 0x0004
enum class EMatchVehicleFilter : uint8
{
	None                                     = 0,
	PublicOnline                             = 1,
	Whitelist                                = 2,
	EMatchVehicleFilter_MAX                  = 3,
};

// Enum BrickRigs.EHostServerType
// NumValues: 0x0004
enum class EHostServerType : uint8
{
	None                                     = 0,
	Private                                  = 1,
	Public                                   = 2,
	EHostServerType_MAX                      = 3,
};

// Enum BrickRigs.EValueChangedEventType
// NumValues: 0x0004
enum class EValueChangedEventType : uint8
{
	Commit                                   = 0,
	Cancel                                   = 1,
	Pending                                  = 2,
	EValueChangedEventType_MAX               = 3,
};

// Enum BrickRigs.EBrickSliderGridSnapMode
// NumValues: 0x0005
enum class EBrickSliderGridSnapMode : uint8
{
	None                                     = 0,
	MinRelative                              = 1,
	MaxRelative                              = 2,
	Absolute                                 = 3,
	EBrickSliderGridSnapMode_MAX             = 4,
};

// Enum BrickRigs.ENumericValueType
// NumValues: 0x0023
enum class ENumericValueType : uint8
{
	Float                                    = 0,
	Integer                                  = 1,
	Percent                                  = 2,
	Angle                                    = 3,
	RPM                                      = 4,
	Time                                     = 5,
	Seconds                                  = 6,
	Minutes                                  = 7,
	Hours                                    = 8,
	Days                                     = 9,
	Money                                    = 10,
	Gear                                     = 11,
	SpeedAuto                                = 12,
	SpeedMetric                              = 13,
	SpeedImperial                            = 14,
	DistanceAuto                             = 15,
	DistanceMetric                           = 16,
	DistanceImperial                         = 17,
	DistanceAutoOrBrickUnits                 = 18,
	DistanceBrickUnits                       = 19,
	DistanceZeroAsUnlimited                  = 20,
	VolumeAuto                               = 21,
	VolumeMetric                             = 22,
	VolumeImperial                           = 23,
	IntZeroAsUnlimited                       = 24,
	Bricks                                   = 25,
	BricksZeroAsUnlimited                    = 26,
	MassAuto                                 = 27,
	MassMetric                               = 28,
	MassImperial                             = 29,
	MassZeroAsUnlimited                      = 30,
	ForceAuto                                = 31,
	ForceMetric                              = 32,
	ForceImperial                            = 33,
	ENumericValueType_MAX                    = 34,
};

// Enum BrickRigs.EActuatorMode
// NumValues: 0x0007
enum class EActuatorMode : uint8
{
	Accumulated                              = 0,
	Seeking                                  = 1,
	Cycle                                    = 2,
	PhysicsDriven                            = 3,
	Static                                   = 4,
	Spring                                   = 5,
	EActuatorMode_MAX                        = 6,
};

// Enum BrickRigs.EAmmoType
// NumValues: 0x0007
enum class EAmmoType : uint8
{
	Default                                  = 0,
	Incendiary                               = 1,
	HighExplosive                            = 2,
	TargetSeeking                            = 3,
	Guided                                   = 4,
	Flare                                    = 5,
	Max                                      = 6,
};

// Enum BrickRigs.EAttachmentTag
// NumValues: 0x0004
enum class EAttachmentTag : uint8
{
	Sight                                    = 0,
	Barrel                                   = 1,
	Paint                                    = 2,
	EAttachmentTag_MAX                       = 3,
};

// Enum BrickRigs.EChatMessageType
// NumValues: 0x000D
enum class EChatMessageType : uint8
{
	None                                     = 0,
	Message                                  = 1,
	Join                                     = 2,
	Leave                                    = 3,
	Kick                                     = 4,
	JoinBanned                               = 5,
	Unban                                    = 6,
	Death                                    = 7,
	MatchSettings                            = 8,
	VehicleSpawnAttempt                      = 9,
	VehicleSpawnSuccess                      = 10,
	VehicleSpawnFailure                      = 11,
	EChatMessageType_MAX                     = 12,
};

// Enum BrickRigs.EConnectorShape
// NumValues: 0x000C
enum class EConnectorShape : uint8
{
	Rectangle                                = 0,
	Triangle                                 = 1,
	FlippedTriangle                          = 2,
	IsoscelesTriangle                        = 3,
	Circle                                   = 4,
	HalfCircle                               = 5,
	QuarterCircle                            = 6,
	FlippedQuarterCircle                     = 7,
	InvertedQuarterCircle                    = 8,
	FlippedInvertedQuarterCircle             = 9,
	Diamond                                  = 10,
	EConnectorShape_MAX                      = 11,
};

// Enum BrickRigs.EConnectorSpacing
// NumValues: 0x0008
enum class EConnectorSpacing : uint8
{
	None                                     = 0,
	Default                                  = 1,
	Half                                     = 2,
	Third                                    = 3,
	Double                                   = 4,
	Triple                                   = 5,
	Quadruple                                = 6,
	Max                                      = 7,
};

// Enum BrickRigs.EConnectorGender
// NumValues: 0x0004
enum class EConnectorGender : uint8
{
	Male                                     = 0,
	Female                                   = 1,
	Neutral                                  = 2,
	EConnectorGender_MAX                     = 3,
};

// Enum BrickRigs.EConnectorType
// NumValues: 0x001E
enum class EConnectorType : uint8
{
	None                                     = 0,
	Default                                  = 1,
	Wheel                                    = 2,
	SphereCoupling                           = 3,
	Hinge                                    = 4,
	Rotor                                    = 5,
	Muzzle                                   = 6,
	LauncherMuzzle                           = 7,
	FlatRadialHinge                          = 8,
	BigHinge                                 = 9,
	Piston                                   = 10,
	LinearCoupling                           = 11,
	Turntable                                = 12,
	FlatLinearActuator                       = 13,
	SmallHinge                               = 14,
	SmallMuzzle                              = 15,
	VerticalHinge                            = 16,
	Hinge3x2                                 = 17,
	SmallTurntable                           = 18,
	LargeTurntable                           = 19,
	LargePiston                              = 20,
	SmallFlatLinearActuator                  = 21,
	MediumHinge                              = 22,
	TinyTurntable                            = 23,
	TinyHinge                                = 24,
	TinyLinearActuator                       = 25,
	TinySphereCoupling                       = 26,
	TinyPiston                               = 27,
	FlareMuzzle                              = 28,
	EConnectorType_MAX                       = 29,
};

// Enum BrickRigs.EBrickDecalShape
// NumValues: 0x0004
enum class EBrickDecalShape : uint8
{
	Square                                   = 0,
	Triangle                                 = 1,
	Circle                                   = 2,
	EBrickDecalShape_MAX                     = 3,
};

// Enum BrickRigs.EBrickEditorArrowType
// NumValues: 0x0003
enum class EBrickEditorArrowType : uint8
{
	Linear                                   = 0,
	Circular                                 = 1,
	EBrickEditorArrowType_MAX                = 2,
};

// Enum BrickRigs.EMirrorMode
// NumValues: 0x0006
enum class EMirrorMode : uint8
{
	None                                     = 0,
	YForward                                 = 1,
	ZForward                                 = 2,
	XYSymmetry                               = 3,
	XYNegSymmetry                            = 4,
	EMirrorMode_MAX                          = 5,
};

// Enum BrickRigs.EJoinSessionState
// NumValues: 0x0005
enum class EJoinSessionState : uint8
{
	None                                     = 0,
	JoinSession                              = 1,
	ClientTravel                             = 2,
	Cancelled                                = 3,
	EJoinSessionState_MAX                    = 4,
};

// Enum BrickRigs.EFreeCamMode
// NumValues: 0x0006
enum class EFreeCamMode : uint8
{
	None                                     = 0,
	Default                                  = 1,
	FollowLocation                           = 2,
	FollowLocationAndRotation                = 3,
	LookAt                                   = 4,
	EFreeCamMode_MAX                         = 5,
};

// Enum BrickRigs.ESearchSessionType
// NumValues: 0x0003
enum class ESearchSessionType : uint8
{
	Server                                   = 0,
	Lobby                                    = 1,
	ESearchSessionType_MAX                   = 2,
};

// Enum BrickRigs.EServerSortMethod
// NumValues: 0x0007
enum class EServerSortMethod : uint8
{
	Name                                     = 0,
	Map                                      = 1,
	GameMode                                 = 2,
	Players                                  = 3,
	PlayersAsc                               = 4,
	Ping                                     = 5,
	EServerSortMethod_MAX                    = 6,
};

// Enum BrickRigs.EVehiclePinMode
// NumValues: 0x0004
enum class EVehiclePinMode : uint8
{
	None                                     = 0,
	RootBrick                                = 1,
	AllBricks                                = 2,
	EVehiclePinMode_MAX                      = 3,
};

// Enum BrickRigs.ECapturePointShape
// NumValues: 0x0004
enum class ECapturePointShape : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Capsule                                  = 2,
	ECapturePointShape_MAX                   = 3,
};

// Enum BrickRigs.ECharacterActionAuth
// NumValues: 0x0004
enum class ECharacterActionAuth : uint8
{
	Local                                    = 0,
	ClientAuth                               = 1,
	ServerAuth                               = 2,
	ECharacterActionAuth_MAX                 = 3,
};

// Enum BrickRigs.ECharacterActionLayer
// NumValues: 0x0004
enum class ECharacterActionLayer : uint8
{
	UpperBody                                = 0,
	LowerBody                                = 1,
	FullBody                                 = 2,
	ECharacterActionLayer_MAX                = 3,
};

// Enum BrickRigs.ECharacterHealingState
// NumValues: 0x0004
enum class ECharacterHealingState : uint8
{
	NotHealing                               = 0,
	Healing                                  = 1,
	HealingFirstAidKit                       = 2,
	ECharacterHealingState_MAX               = 3,
};

// Enum BrickRigs.ECharacterStateOfHealth
// NumValues: 0x0004
enum class ECharacterStateOfHealth : uint8
{
	Conscious                                = 0,
	Unconscious                              = 1,
	Dead                                     = 2,
	ECharacterStateOfHealth_MAX              = 3,
};

// Enum BrickRigs.EControlHintDisplayInfoMode
// NumValues: 0x0004
enum class EControlHintDisplayInfoMode : uint8
{
	Auto                                     = 0,
	Custom                                   = 1,
	Hidden                                   = 2,
	EControlHintDisplayInfoMode_MAX          = 3,
};

// Enum BrickRigs.ECouplingMode
// NumValues: 0x0003
enum class ECouplingMode : uint8
{
	Default                                  = 0,
	Static                                   = 1,
	ECouplingMode_MAX                        = 2,
};

// Enum BrickRigs.EJointFrame
// NumValues: 0x0003
enum class EJointFrame : uint8
{
	Frame0                                   = 0,
	Frame1                                   = 1,
	EJointFrame_MAX                          = 2,
};

// Enum BrickRigs.EDragRaceState
// NumValues: 0x0005
enum class EDragRaceState : uint8
{
	None                                     = 0,
	Countdown                                = 1,
	InProgress                               = 2,
	Cancelled                                = 3,
	EDragRaceState_MAX                       = 4,
};

// Enum BrickRigs.EElevatorDirection
// NumValues: 0x0004
enum class EElevatorDirection : uint8
{
	Stop                                     = 0,
	Up                                       = 1,
	Down                                     = 2,
	EElevatorDirection_MAX                   = 3,
};

// Enum BrickRigs.EExplosiveItemState
// NumValues: 0x0004
enum class EExplosiveItemState : uint8
{
	Safe                                     = 0,
	Primed                                   = 1,
	Exploded                                 = 2,
	EExplosiveItemState_MAX                  = 3,
};

// Enum BrickRigs.EChamberState
// NumValues: 0x0004
enum class EChamberState : uint8
{
	Empty                                    = 0,
	EmptyShell                               = 1,
	Cocked                                   = 2,
	EChamberState_MAX                        = 3,
};

// Enum BrickRigs.EFireMode
// NumValues: 0x0005
enum class EFireMode : uint8
{
	Single                                   = 0,
	Semi                                     = 1,
	Burst                                    = 2,
	Auto                                     = 3,
	EFireMode_MAX                            = 4,
};

// Enum BrickRigs.EFluAxisLock
// NumValues: 0x0006
enum class EFluAxisLock : uint8
{
	None                                     = 0,
	XY                                       = 1,
	XZ                                       = 2,
	YZ                                       = 3,
	All                                      = 4,
	EFluAxisLock_MAX                         = 5,
};

// Enum BrickRigs.EFluAxisSigned
// NumValues: 0x0008
enum class EFluAxisSigned : uint8
{
	None                                     = 0,
	XPos                                     = 1,
	YPos                                     = 2,
	ZPos                                     = 3,
	XNeg                                     = 4,
	YNeg                                     = 5,
	ZNeg                                     = 6,
	EFluAxisSigned_MAX                       = 7,
};

// Enum BrickRigs.EInputRowType
// NumValues: 0x0007
enum class EInputRowType : uint8
{
	PressAction                              = 0,
	ReleaseAction                            = 1,
	PressReleaseAction                       = 2,
	HoldAction                               = 3,
	Axis                                     = 4,
	HalfAxis                                 = 5,
	EInputRowType_MAX                        = 6,
};

// Enum BrickRigs.EItemTag
// NumValues: 0x000C
enum class EItemTag : uint8
{
	None                                     = 0,
	Weapon                                   = 1,
	Firearm                                  = 2,
	Attachment                               = 3,
	AmmoBox                                  = 4,
	Explosive                                = 5,
	Grenade                                  = 6,
	FirstAidKit                              = 7,
	FireExtinguisher                         = 8,
	Paint                                    = 9,
	Wearable                                 = 10,
	EItemTag_MAX                             = 11,
};

// Enum BrickRigs.EKickedPlayerSortMethod
// NumValues: 0x0007
enum class EKickedPlayerSortMethod : uint8
{
	PlayerName                               = 0,
	PlayerNameAsc                            = 1,
	KickDate                                 = 2,
	KickDateAsc                              = 3,
	TimeRemaining                            = 4,
	TimeRemainingAsc                         = 5,
	EKickedPlayerSortMethod_MAX              = 6,
};

// Enum BrickRigs.EBuildingSide
// NumValues: 0x0005
enum class EBuildingSide : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Front                                    = 2,
	Back                                     = 3,
	EBuildingSide_MAX                        = 4,
};

// Enum BrickRigs.ELightBrickDirection
// NumValues: 0x0009
enum class ELightBrickDirection : uint8
{
	None                                     = 0,
	Omnidirectional                          = 1,
	X                                        = 2,
	XNeg                                     = 3,
	Y                                        = 4,
	YNeg                                     = 5,
	Z                                        = 6,
	ZNeg                                     = 7,
	ELightBrickDirection_MAX                 = 8,
};

// Enum BrickRigs.EMathBrickOperation
// NumValues: 0x001E
enum class EMathBrickOperation : uint8
{
	Add                                      = 0,
	Subtract                                 = 1,
	Multiply                                 = 2,
	Divide                                   = 3,
	Fmod                                     = 4,
	Power                                    = 5,
	Greater                                  = 6,
	Less                                     = 7,
	Min                                      = 8,
	Max                                      = 9,
	MAX_Binary                               = 9,
	Abs                                      = 10,
	Sign                                     = 11,
	Round                                    = 12,
	Ceil                                     = 13,
	Floor                                    = 14,
	Sqrt                                     = 15,
	Sin                                      = 16,
	SinDeg                                   = 17,
	Asin                                     = 18,
	AsinDeg                                  = 19,
	Cos                                      = 20,
	CosDeg                                   = 21,
	Acos                                     = 22,
	AcosDeg                                  = 23,
	Tan                                      = 24,
	TanDeg                                   = 25,
	Atan                                     = 26,
	AtanDeg                                  = 27,
	MAX_Unary                                = 26,
};

// Enum BrickRigs.EMenuPageSize
// NumValues: 0x0003
enum class EMenuPageSize : uint8
{
	Default                                  = 0,
	Large                                    = 1,
	EMenuPageSize_MAX                        = 2,
};

// Enum BrickRigs.EDLSSMode
// NumValues: 0x0009
enum class EDLSSMode : uint8
{
	Off                                      = 0,
	Auto                                     = 1,
	DLAA                                     = 2,
	UltraQuality                             = 3,
	Quality                                  = 4,
	Balanced                                 = 5,
	Performance                              = 6,
	UltraPerformance                         = 7,
	EDLSSMode_MAX                            = 8,
};

// Enum BrickRigs.EPlayerSpawnResult
// NumValues: 0x0012
enum class EPlayerSpawnResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	UnsavedChanges                           = 2,
	SentToServer                             = 3,
	BrickLimitExceeded                       = 4,
	MassExceeded                             = 5,
	SizeExceeded                             = 6,
	VehicleLimitExceeded                     = 7,
	VehicleNotPublicOnline                   = 8,
	VehicleNotWhitelisted                    = 9,
	OnlyAdminsCanSpawn                       = 10,
	InsufficientFunds                        = 11,
	NoObjects                                = 12,
	Cooldown                                 = 13,
	CorruptFile                              = 14,
	ValidationFailure                        = 15,
	IncompatibleVersion                      = 16,
	EPlayerSpawnResult_MAX                   = 17,
};

// Enum BrickRigs.EPlayerVehicleSpawnInvincibility
// NumValues: 0x0004
enum class EPlayerVehicleSpawnInvincibility : uint8
{
	None                                     = 0,
	Invincible                               = 1,
	Pinned                                   = 2,
	EPlayerVehicleSpawnInvincibility_MAX     = 3,
};

// Enum BrickRigs.EPlayerVehicleSpawnType
// NumValues: 0x0006
enum class EPlayerVehicleSpawnType : uint8
{
	Exit                                     = 0,
	Teleport                                 = 1,
	Scrap                                    = 2,
	SpawnNew                                 = 3,
	ReplaceCurrent                           = 4,
	EPlayerVehicleSpawnType_MAX              = 5,
};

// Enum BrickRigs.EPlayerSpawnType
// NumValues: 0x0005
enum class EPlayerSpawnType : uint8
{
	None                                     = 0,
	OnSpot                                   = 1,
	AtTransform                              = 2,
	AtSpawnPoint                             = 3,
	EPlayerSpawnType_MAX                     = 4,
};

// Enum BrickRigs.EPopupSizeRule
// NumValues: 0x0005
enum class EPopupSizeRule : uint8
{
	Auto                                     = 0,
	Fill                                     = 1,
	FillH                                    = 2,
	FillV                                    = 3,
	EPopupSizeRule_MAX                       = 4,
};

// Enum BrickRigs.EScalableBrickShape
// NumValues: 0x001C
enum class EScalableBrickShape : uint8
{
	Box                                      = 0,
	Ramp                                     = 1,
	Cylinder                                 = 2,
	HalfCylinder                             = 3,
	Cone                                     = 4,
	QuarterCone                              = 5,
	HalfCone                                 = 6,
	ConeFlat                                 = 7,
	Hemisphere                               = 8,
	QuarterSphere                            = 9,
	RampRounded                              = 10,
	RampRoundedN                             = 11,
	Corner                                   = 12,
	CornerN                                  = 13,
	CornerRounded                            = 14,
	CornerRoundedN                           = 15,
	Pyramid                                  = 16,
	PyramidCorner                            = 17,
	PyramidCornerRounded                     = 18,
	Wedge                                    = 19,
	WedgeCorner                              = 20,
	Cylinder90R0                             = 21,
	Cylinder90R1                             = 22,
	Flag                                     = 23,
	TankCylinder                             = 24,
	Button                                   = 25,
	Flap                                     = 26,
	EScalableBrickShape_MAX                  = 27,
};

// Enum BrickRigs.EProximitySensorMask
// NumValues: 0x0007
enum class EProximitySensorMask : uint8
{
	All                                      = 0,
	Vehicles                                 = 1,
	OtherVehicles                            = 2,
	Pawn                                     = 3,
	Static                                   = 4,
	Water                                    = 5,
	EProximitySensorMask_MAX                 = 6,
};

// Enum BrickRigs.ESensorType
// NumValues: 0x0017
enum class ESensorType : uint8
{
	Speed                                    = 0,
	Acceleration                             = 1,
	Distance                                 = 2,
	Time                                     = 3,
	Proximity                                = 4,
	DistanceToGround                         = 5,
	Altitude                                 = 6,
	AbsAltitude                              = 7,
	Pitch                                    = 8,
	Yaw                                      = 9,
	Roll                                     = 10,
	AngularSpeed                             = 11,
	NormalSpeed                              = 12,
	NormalAcceleration                       = 13,
	NormalAngularSpeed                       = 14,
	NumSeekingProjectiles                    = 15,
	SeekingProjectileDistance                = 16,
	DeltaTime                                = 17,
	Framerate                                = 18,
	TimeOfDay                                = 19,
	WindSpeed                                = 20,
	WindDirection                            = 21,
	ESensorType_MAX                          = 22,
};

// Enum BrickRigs.ESpinnerBrickShape
// NumValues: 0x000E
enum class ESpinnerBrickShape : uint8
{
	Rectangle                                = 0,
	TriangleIn                               = 1,
	TriangleOut                              = 2,
	IsoscelesTriangleIn                      = 3,
	IsoscelesTriangleOut                     = 4,
	IsoscelesTriangleUp                      = 5,
	Circle                                   = 6,
	HalfCircleIn                             = 7,
	HalfCircleOut                            = 8,
	HalfCircleUp                             = 9,
	QuarterCircleIn                          = 10,
	QuarterCircleOut                         = 11,
	Diamond                                  = 12,
	Max                                      = 13,
};

// Enum BrickRigs.EUGCBrowserMode
// NumValues: 0x0009
enum class EUGCBrowserMode : uint8
{
	None                                     = 0,
	Spawn                                    = 1,
	Open                                     = 2,
	Import                                   = 3,
	Save                                     = 4,
	Upload                                   = 5,
	Property                                 = 6,
	ArrayProperty                            = 7,
	EUGCBrowserMode_MAX                      = 8,
};

// Enum BrickRigs.EUGCTaskPopupType
// NumValues: 0x0004
enum class EUGCTaskPopupType : uint8
{
	None                                     = 0,
	Download                                 = 1,
	Upload                                   = 2,
	EUGCTaskPopupType_MAX                    = 3,
};

// Enum BrickRigs.EUGCSortMethod
// NumValues: 0x000B
enum class EUGCSortMethod : uint8
{
	TitleAsc                                 = 0,
	CreationOrderAsc                         = 1,
	CreationOrderDesc                        = 2,
	LastUpdatedDesc                          = 3,
	SubscriptionDateDesc                     = 4,
	Trending                                 = 5,
	PlaytimeTrending                         = 6,
	TotalPlaytime                            = 7,
	TotalUniqueSubscriptions                 = 8,
	SearchRelevancy                          = 9,
	Max                                      = 10,
};

// Enum BrickRigs.EUGCQueryType
// NumValues: 0x0008
enum class EUGCQueryType : uint8
{
	Local                                    = 0,
	Online                                   = 1,
	Published                                = 2,
	Subscribed                               = 3,
	Favorited                                = 4,
	RecentlyUsed                             = 5,
	Selection                                = 6,
	Max                                      = 7,
};

// Enum BrickRigs.EVehicleDashboardType
// NumValues: 0x0006
enum class EVehicleDashboardType : uint8
{
	None                                     = 0,
	Car                                      = 1,
	RaceCar                                  = 2,
	Aircraft                                 = 3,
	Advanced                                 = 4,
	Max                                      = 5,
};

// Enum BrickRigs.EVehicleInputAxis
// NumValues: 0x002F
enum class EVehicleInputAxis : uint8
{
	None                                     = 0,
	Steering                                 = 1,
	FirstAxis                                = 1,
	FirstPlayerAxis                          = 1,
	Throttle                                 = 2,
	Brake                                    = 3,
	Pitch                                    = 4,
	ViewPitch                                = 5,
	ViewYaw                                  = 6,
	LastAxis                                 = 6,
	LastPlayerAxis                           = 6,
	SteeringAlt                              = 7,
	FirstAltAxis                             = 7,
	ThrottleAlt                              = 8,
	BrakeAlt                                 = 9,
	PitchAlt                                 = 10,
	ViewPitchAlt                             = 11,
	ViewYawAlt                               = 12,
	LastAltAxis                              = 12,
	Horn                                     = 13,
	FirstAction                              = 13,
	FirstPlayerAction                        = 13,
	Action1                                  = 14,
	FirstFireAction                          = 14,
	Action2                                  = 15,
	Action3                                  = 16,
	Action4                                  = 17,
	Action5                                  = 18,
	Action6                                  = 19,
	Action7                                  = 20,
	Action8                                  = 21,
	LastFireAction                           = 21,
	DisableSteering                          = 22,
	InvertSteering                           = 23,
	HandBrake                                = 24,
	OperationMode                            = 25,
	Headlight                                = 26,
	Beacon                                   = 27,
	WarningLight                             = 28,
	LastPlayerAction                         = 28,
	Taillight                                = 29,
	BrakeLight                               = 30,
	ReversingLight                           = 31,
	LastAction                               = 31,
	AlwaysOn                                 = 32,
	Custom                                   = 33,
	Max                                      = 34,
};

// Enum BrickRigs.EWearableTag
// NumValues: 0x0003
enum class EWearableTag : uint8
{
	Pants                                    = 0,
	Shirt                                    = 1,
	EWearableTag_MAX                         = 2,
};

// Enum BrickRigs.EPrecipitationType
// NumValues: 0x0004
enum class EPrecipitationType : uint8
{
	None                                     = 0,
	Rain                                     = 1,
	Snow                                     = 2,
	Max                                      = 3,
};

// Enum BrickRigs.EMainWidgetType
// NumValues: 0x0005
enum class EMainWidgetType : uint8
{
	None                                     = 0,
	IntroSequence                            = 1,
	Menu                                     = 2,
	HUD                                      = 3,
	Max                                      = 4,
};

// ScriptStruct BrickRigs.ConnectorField
// 0x0030 (0x0030 - 0x0000)
struct FConnectorField final
{
public:
	EConnectorType                                Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectorGender                              Gender;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFluAxisSigned                                Direction;                                         // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Origin;                                            // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NumX;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumY;                                              // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectorSpacing                             Spacing;                                           // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectorShape                               Shape;                                             // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ShapeRelativeSize;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConnectorField) == 0x000004, "Wrong alignment on FConnectorField");
static_assert(sizeof(FConnectorField) == 0x000030, "Wrong size on FConnectorField");
static_assert(offsetof(FConnectorField, Type) == 0x000000, "Member 'FConnectorField::Type' has a wrong offset!");
static_assert(offsetof(FConnectorField, Gender) == 0x000001, "Member 'FConnectorField::Gender' has a wrong offset!");
static_assert(offsetof(FConnectorField, Direction) == 0x000002, "Member 'FConnectorField::Direction' has a wrong offset!");
static_assert(offsetof(FConnectorField, Origin) == 0x000004, "Member 'FConnectorField::Origin' has a wrong offset!");
static_assert(offsetof(FConnectorField, Rotation) == 0x000010, "Member 'FConnectorField::Rotation' has a wrong offset!");
static_assert(offsetof(FConnectorField, NumX) == 0x00001C, "Member 'FConnectorField::NumX' has a wrong offset!");
static_assert(offsetof(FConnectorField, NumY) == 0x000020, "Member 'FConnectorField::NumY' has a wrong offset!");
static_assert(offsetof(FConnectorField, Spacing) == 0x000024, "Member 'FConnectorField::Spacing' has a wrong offset!");
static_assert(offsetof(FConnectorField, Shape) == 0x000025, "Member 'FConnectorField::Shape' has a wrong offset!");
static_assert(offsetof(FConnectorField, ShapeRelativeSize) == 0x000028, "Member 'FConnectorField::ShapeRelativeSize' has a wrong offset!");

// ScriptStruct BrickRigs.BrickUIBrushStyle
// 0x0770 (0x0770 - 0x0000)
struct FBrickUIBrushStyle final
{
public:
	struct FSlateBrush                            Brushes[0xE];                                      // 0x0000(0x0088)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBrickUIBrushStyle) == 0x000008, "Wrong alignment on FBrickUIBrushStyle");
static_assert(sizeof(FBrickUIBrushStyle) == 0x000770, "Wrong size on FBrickUIBrushStyle");
static_assert(offsetof(FBrickUIBrushStyle, Brushes) == 0x000000, "Member 'FBrickUIBrushStyle::Brushes' has a wrong offset!");

// ScriptStruct BrickRigs.BrickUIIconAtlas
// 0x0010 (0x0010 - 0x0000)
struct FBrickUIIconAtlas final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumX;                                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumY;                                              // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartIndex;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBrickUIIconAtlas) == 0x000008, "Wrong alignment on FBrickUIIconAtlas");
static_assert(sizeof(FBrickUIIconAtlas) == 0x000010, "Wrong size on FBrickUIIconAtlas");
static_assert(offsetof(FBrickUIIconAtlas, Texture) == 0x000000, "Member 'FBrickUIIconAtlas::Texture' has a wrong offset!");
static_assert(offsetof(FBrickUIIconAtlas, NumX) == 0x000008, "Member 'FBrickUIIconAtlas::NumX' has a wrong offset!");
static_assert(offsetof(FBrickUIIconAtlas, NumY) == 0x000009, "Member 'FBrickUIIconAtlas::NumY' has a wrong offset!");
static_assert(offsetof(FBrickUIIconAtlas, StartIndex) == 0x00000C, "Member 'FBrickUIIconAtlas::StartIndex' has a wrong offset!");

// ScriptStruct BrickRigs.BrickStructPropertyInterface
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FBrickStructPropertyInterface
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBrickStructPropertyInterface) == 0x000008, "Wrong alignment on FBrickStructPropertyInterface");
static_assert(sizeof(FBrickStructPropertyInterface) == 0x000008, "Wrong size on FBrickStructPropertyInterface");

// ScriptStruct BrickRigs.PagedListEntry
// 0x0000 (0x0008 - 0x0008)
struct FPagedListEntry : public FBrickStructPropertyInterface
{
};
static_assert(alignof(FPagedListEntry) == 0x000008, "Wrong alignment on FPagedListEntry");
static_assert(sizeof(FPagedListEntry) == 0x000008, "Wrong size on FPagedListEntry");

// ScriptStruct BrickRigs.BrickOnlineSessionInfo
// 0x0160 (0x0168 - 0x0008)
struct FBrickOnlineSessionInfo final : public FPagedListEntry
{
public:
	class FString                                 SessionName;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionDescription;                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelInfo*                             Level;                                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameModeInfo*                          GameMode;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPlayers;                                    // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPlayers;                                        // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Ping;                                              // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AverageFrameRate;                                  // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDedicated;                                      // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPasswordProtected;                              // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCompatibleBuild;                                // 0x004A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasMods;                                          // 0x004B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSameMods;                                      // 0x004C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowDifferentMods;                               // 0x004D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x11A];                                     // 0x004E(0x011A)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBrickOnlineSessionInfo) == 0x000008, "Wrong alignment on FBrickOnlineSessionInfo");
static_assert(sizeof(FBrickOnlineSessionInfo) == 0x000168, "Wrong size on FBrickOnlineSessionInfo");
static_assert(offsetof(FBrickOnlineSessionInfo, SessionName) == 0x000008, "Member 'FBrickOnlineSessionInfo::SessionName' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, SessionDescription) == 0x000018, "Member 'FBrickOnlineSessionInfo::SessionDescription' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, Level) == 0x000028, "Member 'FBrickOnlineSessionInfo::Level' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, GameMode) == 0x000030, "Member 'FBrickOnlineSessionInfo::GameMode' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, CurrentPlayers) == 0x000038, "Member 'FBrickOnlineSessionInfo::CurrentPlayers' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, MaxPlayers) == 0x00003C, "Member 'FBrickOnlineSessionInfo::MaxPlayers' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, Ping) == 0x000040, "Member 'FBrickOnlineSessionInfo::Ping' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, AverageFrameRate) == 0x000044, "Member 'FBrickOnlineSessionInfo::AverageFrameRate' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, bIsDedicated) == 0x000048, "Member 'FBrickOnlineSessionInfo::bIsDedicated' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, bIsPasswordProtected) == 0x000049, "Member 'FBrickOnlineSessionInfo::bIsPasswordProtected' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, bIsCompatibleBuild) == 0x00004A, "Member 'FBrickOnlineSessionInfo::bIsCompatibleBuild' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, bHasMods) == 0x00004B, "Member 'FBrickOnlineSessionInfo::bHasMods' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, bHasSameMods) == 0x00004C, "Member 'FBrickOnlineSessionInfo::bHasSameMods' has a wrong offset!");
static_assert(offsetof(FBrickOnlineSessionInfo, bAllowDifferentMods) == 0x00004D, "Member 'FBrickOnlineSessionInfo::bAllowDifferentMods' has a wrong offset!");

// ScriptStruct BrickRigs.BrickEditorObjectEditorParams
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FBrickEditorObjectEditorParams
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBrickEditorObjectEditorParams) == 0x000004, "Wrong alignment on FBrickEditorObjectEditorParams");
static_assert(sizeof(FBrickEditorObjectEditorParams) == 0x000010, "Wrong size on FBrickEditorObjectEditorParams");

// ScriptStruct BrickRigs.BrickEditorParams
// 0x0018 (0x0028 - 0x0010)
struct alignas(0x08) FBrickEditorParams : public FBrickEditorObjectEditorParams
{
public:
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBrickEditorParams) == 0x000008, "Wrong alignment on FBrickEditorParams");
static_assert(sizeof(FBrickEditorParams) == 0x000028, "Wrong size on FBrickEditorParams");

// ScriptStruct BrickRigs.ScalableBrickBaseEditorParams
// 0x0008 (0x0030 - 0x0028)
struct FScalableBrickBaseEditorParams : public FBrickEditorParams
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FScalableBrickBaseEditorParams) == 0x000008, "Wrong alignment on FScalableBrickBaseEditorParams");
static_assert(sizeof(FScalableBrickBaseEditorParams) == 0x000030, "Wrong size on FScalableBrickBaseEditorParams");

// ScriptStruct BrickRigs.ScalableBrickEditorParams
// 0x0008 (0x0038 - 0x0030)
struct FScalableBrickEditorParams : public FScalableBrickBaseEditorParams
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FScalableBrickEditorParams) == 0x000008, "Wrong alignment on FScalableBrickEditorParams");
static_assert(sizeof(FScalableBrickEditorParams) == 0x000038, "Wrong size on FScalableBrickEditorParams");

// ScriptStruct BrickRigs.FlapBrickEditorParams
// 0x0008 (0x0040 - 0x0038)
struct FFlapBrickEditorParams final : public FScalableBrickEditorParams
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFlapBrickEditorParams) == 0x000008, "Wrong alignment on FFlapBrickEditorParams");
static_assert(sizeof(FFlapBrickEditorParams) == 0x000040, "Wrong size on FFlapBrickEditorParams");

// ScriptStruct BrickRigs.BrickUIColorStyle
// 0x00E0 (0x00E0 - 0x0000)
struct FBrickUIColorStyle final
{
public:
	struct FLinearColor                           Colors[0xE];                                       // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBrickUIColorStyle) == 0x000004, "Wrong alignment on FBrickUIColorStyle");
static_assert(sizeof(FBrickUIColorStyle) == 0x0000E0, "Wrong size on FBrickUIColorStyle");
