#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrickRigs

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FluUGC_structs.hpp"


namespace SDK::Params
{

// Function BrickRigs.PagedListEntryWidget.UpdateButtonSelected
// 0x0001 (0x0001 - 0x0000)
struct PagedListEntryWidget_UpdateButtonSelected final
{
public:
	bool                                          bNewSelected;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PagedListEntryWidget_UpdateButtonSelected) == 0x000001, "Wrong alignment on PagedListEntryWidget_UpdateButtonSelected");
static_assert(sizeof(PagedListEntryWidget_UpdateButtonSelected) == 0x000001, "Wrong size on PagedListEntryWidget_UpdateButtonSelected");
static_assert(offsetof(PagedListEntryWidget_UpdateButtonSelected, bNewSelected) == 0x000000, "Member 'PagedListEntryWidget_UpdateButtonSelected::bNewSelected' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBodyTransform
// 0x0030 (0x0030 - 0x0000)
struct BrickEditorObject_GetBodyTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBodyTransform) == 0x000010, "Wrong alignment on BrickEditorObject_GetBodyTransform");
static_assert(sizeof(BrickEditorObject_GetBodyTransform) == 0x000030, "Wrong size on BrickEditorObject_GetBodyTransform");
static_assert(offsetof(BrickEditorObject_GetBodyTransform, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBodyTransform::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditor
// 0x0008 (0x0008 - 0x0000)
struct BrickEditorObject_GetBrickEditor final
{
public:
	class ABrickEditor*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBrickEditor) == 0x000008, "Wrong alignment on BrickEditorObject_GetBrickEditor");
static_assert(sizeof(BrickEditorObject_GetBrickEditor) == 0x000008, "Wrong size on BrickEditorObject_GetBrickEditor");
static_assert(offsetof(BrickEditorObject_GetBrickEditor, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBrickEditor::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditorObjectBoundsOrigin
// 0x000C (0x000C - 0x0000)
struct BrickEditorObject_GetBrickEditorObjectBoundsOrigin final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBrickEditorObjectBoundsOrigin) == 0x000004, "Wrong alignment on BrickEditorObject_GetBrickEditorObjectBoundsOrigin");
static_assert(sizeof(BrickEditorObject_GetBrickEditorObjectBoundsOrigin) == 0x00000C, "Wrong size on BrickEditorObject_GetBrickEditorObjectBoundsOrigin");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectBoundsOrigin, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBrickEditorObjectBoundsOrigin::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditorObjectDisplayName
// 0x0018 (0x0018 - 0x0000)
struct BrickEditorObject_GetBrickEditorObjectDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBrickEditorObjectDisplayName) == 0x000008, "Wrong alignment on BrickEditorObject_GetBrickEditorObjectDisplayName");
static_assert(sizeof(BrickEditorObject_GetBrickEditorObjectDisplayName) == 0x000018, "Wrong size on BrickEditorObject_GetBrickEditorObjectDisplayName");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectDisplayName, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBrickEditorObjectDisplayName::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditorObjectLocalBounds
// 0x001C (0x001C - 0x0000)
struct BrickEditorObject_GetBrickEditorObjectLocalBounds final
{
public:
	struct FVector                                OutBoundsMin;                                      // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutBoundsMax;                                      // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BrickEditorObject_GetBrickEditorObjectLocalBounds) == 0x000004, "Wrong alignment on BrickEditorObject_GetBrickEditorObjectLocalBounds");
static_assert(sizeof(BrickEditorObject_GetBrickEditorObjectLocalBounds) == 0x00001C, "Wrong size on BrickEditorObject_GetBrickEditorObjectLocalBounds");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectLocalBounds, OutBoundsMin) == 0x000000, "Member 'BrickEditorObject_GetBrickEditorObjectLocalBounds::OutBoundsMin' has a wrong offset!");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectLocalBounds, OutBoundsMax) == 0x00000C, "Member 'BrickEditorObject_GetBrickEditorObjectLocalBounds::OutBoundsMax' has a wrong offset!");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectLocalBounds, ReturnValue) == 0x000018, "Member 'BrickEditorObject_GetBrickEditorObjectLocalBounds::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditorObjectSpawnLocation
// 0x000C (0x000C - 0x0000)
struct BrickEditorObject_GetBrickEditorObjectSpawnLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBrickEditorObjectSpawnLocation) == 0x000004, "Wrong alignment on BrickEditorObject_GetBrickEditorObjectSpawnLocation");
static_assert(sizeof(BrickEditorObject_GetBrickEditorObjectSpawnLocation) == 0x00000C, "Wrong size on BrickEditorObject_GetBrickEditorObjectSpawnLocation");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectSpawnLocation, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBrickEditorObjectSpawnLocation::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditorObjectSpawnRotation
// 0x000C (0x000C - 0x0000)
struct BrickEditorObject_GetBrickEditorObjectSpawnRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBrickEditorObjectSpawnRotation) == 0x000004, "Wrong alignment on BrickEditorObject_GetBrickEditorObjectSpawnRotation");
static_assert(sizeof(BrickEditorObject_GetBrickEditorObjectSpawnRotation) == 0x00000C, "Wrong size on BrickEditorObject_GetBrickEditorObjectSpawnRotation");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectSpawnRotation, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBrickEditorObjectSpawnRotation::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditorObjectSpawnTransform
// 0x0030 (0x0030 - 0x0000)
struct BrickEditorObject_GetBrickEditorObjectSpawnTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBrickEditorObjectSpawnTransform) == 0x000010, "Wrong alignment on BrickEditorObject_GetBrickEditorObjectSpawnTransform");
static_assert(sizeof(BrickEditorObject_GetBrickEditorObjectSpawnTransform) == 0x000030, "Wrong size on BrickEditorObject_GetBrickEditorObjectSpawnTransform");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectSpawnTransform, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBrickEditorObjectSpawnTransform::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditorObjectTypeDisplayName
// 0x0018 (0x0018 - 0x0000)
struct BrickEditorObject_GetBrickEditorObjectTypeDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBrickEditorObjectTypeDisplayName) == 0x000008, "Wrong alignment on BrickEditorObject_GetBrickEditorObjectTypeDisplayName");
static_assert(sizeof(BrickEditorObject_GetBrickEditorObjectTypeDisplayName) == 0x000018, "Wrong size on BrickEditorObject_GetBrickEditorObjectTypeDisplayName");
static_assert(offsetof(BrickEditorObject_GetBrickEditorObjectTypeDisplayName, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBrickEditorObjectTypeDisplayName::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetBrickEditorStaticInfo
// 0x0008 (0x0008 - 0x0000)
struct BrickEditorObject_GetBrickEditorStaticInfo final
{
public:
	const class UBrickEditorStaticInfo*           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetBrickEditorStaticInfo) == 0x000008, "Wrong alignment on BrickEditorObject_GetBrickEditorStaticInfo");
static_assert(sizeof(BrickEditorObject_GetBrickEditorStaticInfo) == 0x000008, "Wrong size on BrickEditorObject_GetBrickEditorStaticInfo");
static_assert(offsetof(BrickEditorObject_GetBrickEditorStaticInfo, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetBrickEditorStaticInfo::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetEditorInterface
// 0x0008 (0x0008 - 0x0000)
struct BrickEditorObject_GetEditorInterface final
{
public:
	class UBrickEditorInterfaceComponent*         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetEditorInterface) == 0x000008, "Wrong alignment on BrickEditorObject_GetEditorInterface");
static_assert(sizeof(BrickEditorObject_GetEditorInterface) == 0x000008, "Wrong size on BrickEditorObject_GetEditorInterface");
static_assert(offsetof(BrickEditorObject_GetEditorInterface, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetEditorInterface::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetEditorObjectID
// 0x0002 (0x0002 - 0x0000)
struct BrickEditorObject_GetEditorObjectID final
{
public:
	struct FBrickEditorObjectID                   ReturnValue;                                       // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetEditorObjectID) == 0x000002, "Wrong alignment on BrickEditorObject_GetEditorObjectID");
static_assert(sizeof(BrickEditorObject_GetEditorObjectID) == 0x000002, "Wrong size on BrickEditorObject_GetEditorObjectID");
static_assert(offsetof(BrickEditorObject_GetEditorObjectID, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetEditorObjectID::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetRootComponent
// 0x0008 (0x0008 - 0x0000)
struct BrickEditorObject_GetRootComponent final
{
public:
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetRootComponent) == 0x000008, "Wrong alignment on BrickEditorObject_GetRootComponent");
static_assert(sizeof(BrickEditorObject_GetRootComponent) == 0x000008, "Wrong size on BrickEditorObject_GetRootComponent");
static_assert(offsetof(BrickEditorObject_GetRootComponent, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetRootComponent::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetStaticInfo
// 0x0008 (0x0008 - 0x0000)
struct BrickEditorObject_GetStaticInfo final
{
public:
	const class UBrickEditorObjectStaticInfo*     ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetStaticInfo) == 0x000008, "Wrong alignment on BrickEditorObject_GetStaticInfo");
static_assert(sizeof(BrickEditorObject_GetStaticInfo) == 0x000008, "Wrong size on BrickEditorObject_GetStaticInfo");
static_assert(offsetof(BrickEditorObject_GetStaticInfo, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetStaticInfo::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetStaticInfoClass
// 0x0008 (0x0008 - 0x0000)
struct BrickEditorObject_GetStaticInfoClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetStaticInfoClass) == 0x000008, "Wrong alignment on BrickEditorObject_GetStaticInfoClass");
static_assert(sizeof(BrickEditorObject_GetStaticInfoClass) == 0x000008, "Wrong size on BrickEditorObject_GetStaticInfoClass");
static_assert(offsetof(BrickEditorObject_GetStaticInfoClass, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetStaticInfoClass::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.GetWorldTransform
// 0x0030 (0x0030 - 0x0000)
struct BrickEditorObject_GetWorldTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_GetWorldTransform) == 0x000010, "Wrong alignment on BrickEditorObject_GetWorldTransform");
static_assert(sizeof(BrickEditorObject_GetWorldTransform) == 0x000030, "Wrong size on BrickEditorObject_GetWorldTransform");
static_assert(offsetof(BrickEditorObject_GetWorldTransform, ReturnValue) == 0x000000, "Member 'BrickEditorObject_GetWorldTransform::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.IsBrickEditorObjectBeingInitialized
// 0x0001 (0x0001 - 0x0000)
struct BrickEditorObject_IsBrickEditorObjectBeingInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_IsBrickEditorObjectBeingInitialized) == 0x000001, "Wrong alignment on BrickEditorObject_IsBrickEditorObjectBeingInitialized");
static_assert(sizeof(BrickEditorObject_IsBrickEditorObjectBeingInitialized) == 0x000001, "Wrong size on BrickEditorObject_IsBrickEditorObjectBeingInitialized");
static_assert(offsetof(BrickEditorObject_IsBrickEditorObjectBeingInitialized, ReturnValue) == 0x000000, "Member 'BrickEditorObject_IsBrickEditorObjectBeingInitialized::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.IsBrickEditorObjectBeingUninitialized
// 0x0001 (0x0001 - 0x0000)
struct BrickEditorObject_IsBrickEditorObjectBeingUninitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_IsBrickEditorObjectBeingUninitialized) == 0x000001, "Wrong alignment on BrickEditorObject_IsBrickEditorObjectBeingUninitialized");
static_assert(sizeof(BrickEditorObject_IsBrickEditorObjectBeingUninitialized) == 0x000001, "Wrong size on BrickEditorObject_IsBrickEditorObjectBeingUninitialized");
static_assert(offsetof(BrickEditorObject_IsBrickEditorObjectBeingUninitialized, ReturnValue) == 0x000000, "Member 'BrickEditorObject_IsBrickEditorObjectBeingUninitialized::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.IsBrickEditorObjectInitialized
// 0x0001 (0x0001 - 0x0000)
struct BrickEditorObject_IsBrickEditorObjectInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_IsBrickEditorObjectInitialized) == 0x000001, "Wrong alignment on BrickEditorObject_IsBrickEditorObjectInitialized");
static_assert(sizeof(BrickEditorObject_IsBrickEditorObjectInitialized) == 0x000001, "Wrong size on BrickEditorObject_IsBrickEditorObjectInitialized");
static_assert(offsetof(BrickEditorObject_IsBrickEditorObjectInitialized, ReturnValue) == 0x000000, "Member 'BrickEditorObject_IsBrickEditorObjectInitialized::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.IsInEditor
// 0x0001 (0x0001 - 0x0000)
struct BrickEditorObject_IsInEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_IsInEditor) == 0x000001, "Wrong alignment on BrickEditorObject_IsInEditor");
static_assert(sizeof(BrickEditorObject_IsInEditor) == 0x000001, "Wrong size on BrickEditorObject_IsInEditor");
static_assert(offsetof(BrickEditorObject_IsInEditor, ReturnValue) == 0x000000, "Member 'BrickEditorObject_IsInEditor::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.IsInThumbnailRender
// 0x0001 (0x0001 - 0x0000)
struct BrickEditorObject_IsInThumbnailRender final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_IsInThumbnailRender) == 0x000001, "Wrong alignment on BrickEditorObject_IsInThumbnailRender");
static_assert(sizeof(BrickEditorObject_IsInThumbnailRender) == 0x000001, "Wrong size on BrickEditorObject_IsInThumbnailRender");
static_assert(offsetof(BrickEditorObject_IsInThumbnailRender, ReturnValue) == 0x000000, "Member 'BrickEditorObject_IsInThumbnailRender::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickEditorObject.IsSpawned
// 0x0001 (0x0001 - 0x0000)
struct BrickEditorObject_IsSpawned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickEditorObject_IsSpawned) == 0x000001, "Wrong alignment on BrickEditorObject_IsSpawned");
static_assert(sizeof(BrickEditorObject_IsSpawned) == 0x000001, "Wrong size on BrickEditorObject_IsSpawned");
static_assert(offsetof(BrickEditorObject_IsSpawned, ReturnValue) == 0x000000, "Member 'BrickEditorObject_IsSpawned::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.ClusterConsumeFuel
// 0x0008 (0x0008 - 0x0000)
struct Brick_ClusterConsumeFuel final
{
public:
	float                                         Amount;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Brick_ClusterConsumeFuel) == 0x000004, "Wrong alignment on Brick_ClusterConsumeFuel");
static_assert(sizeof(Brick_ClusterConsumeFuel) == 0x000008, "Wrong size on Brick_ClusterConsumeFuel");
static_assert(offsetof(Brick_ClusterConsumeFuel, Amount) == 0x000000, "Member 'Brick_ClusterConsumeFuel::Amount' has a wrong offset!");
static_assert(offsetof(Brick_ClusterConsumeFuel, ReturnValue) == 0x000004, "Member 'Brick_ClusterConsumeFuel::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.ExtinguishFire
// 0x0001 (0x0001 - 0x0000)
struct Brick_ExtinguishFire final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_ExtinguishFire) == 0x000001, "Wrong alignment on Brick_ExtinguishFire");
static_assert(sizeof(Brick_ExtinguishFire) == 0x000001, "Wrong size on Brick_ExtinguishFire");
static_assert(offsetof(Brick_ExtinguishFire, ReturnValue) == 0x000000, "Member 'Brick_ExtinguishFire::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.Interact_PickUp
// 0x0008 (0x0008 - 0x0000)
struct Brick_Interact_PickUp final
{
public:
	class ABrickPlayerController*                 OtherPC;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_Interact_PickUp) == 0x000008, "Wrong alignment on Brick_Interact_PickUp");
static_assert(sizeof(Brick_Interact_PickUp) == 0x000008, "Wrong size on Brick_Interact_PickUp");
static_assert(offsetof(Brick_Interact_PickUp, OtherPC) == 0x000000, "Member 'Brick_Interact_PickUp::OtherPC' has a wrong offset!");

// Function BrickRigs.Brick.SetIsBrickBurnt
// 0x0001 (0x0001 - 0x0000)
struct Brick_SetIsBrickBurnt final
{
public:
	bool                                          bNewBurnt;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_SetIsBrickBurnt) == 0x000001, "Wrong alignment on Brick_SetIsBrickBurnt");
static_assert(sizeof(Brick_SetIsBrickBurnt) == 0x000001, "Wrong size on Brick_SetIsBrickBurnt");
static_assert(offsetof(Brick_SetIsBrickBurnt, bNewBurnt) == 0x000000, "Member 'Brick_SetIsBrickBurnt::bNewBurnt' has a wrong offset!");

// Function BrickRigs.Brick.SetIsBrickDamaged
// 0x0001 (0x0001 - 0x0000)
struct Brick_SetIsBrickDamaged final
{
public:
	bool                                          bNewDamaged;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_SetIsBrickDamaged) == 0x000001, "Wrong alignment on Brick_SetIsBrickDamaged");
static_assert(sizeof(Brick_SetIsBrickDamaged) == 0x000001, "Wrong size on Brick_SetIsBrickDamaged");
static_assert(offsetof(Brick_SetIsBrickDamaged, bNewDamaged) == 0x000000, "Member 'Brick_SetIsBrickDamaged::bNewDamaged' has a wrong offset!");

// Function BrickRigs.Brick.SetOnFire
// 0x0001 (0x0001 - 0x0000)
struct Brick_SetOnFire final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_SetOnFire) == 0x000001, "Wrong alignment on Brick_SetOnFire");
static_assert(sizeof(Brick_SetOnFire) == 0x000001, "Wrong size on Brick_SetOnFire");
static_assert(offsetof(Brick_SetOnFire, ReturnValue) == 0x000000, "Member 'Brick_SetOnFire::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.Tick
// 0x0004 (0x0004 - 0x0000)
struct Brick_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_Tick) == 0x000004, "Wrong alignment on Brick_Tick");
static_assert(sizeof(Brick_Tick) == 0x000004, "Wrong size on Brick_Tick");
static_assert(offsetof(Brick_Tick, DeltaTime) == 0x000000, "Member 'Brick_Tick::DeltaTime' has a wrong offset!");

// Function BrickRigs.Brick.UpdateBrickTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct Brick_UpdateBrickTickEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_UpdateBrickTickEnabled) == 0x000001, "Wrong alignment on Brick_UpdateBrickTickEnabled");
static_assert(sizeof(Brick_UpdateBrickTickEnabled) == 0x000001, "Wrong size on Brick_UpdateBrickTickEnabled");
static_assert(offsetof(Brick_UpdateBrickTickEnabled, ReturnValue) == 0x000000, "Member 'Brick_UpdateBrickTickEnabled::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.CanBrickBurn
// 0x0001 (0x0001 - 0x0000)
struct Brick_CanBrickBurn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_CanBrickBurn) == 0x000001, "Wrong alignment on Brick_CanBrickBurn");
static_assert(sizeof(Brick_CanBrickBurn) == 0x000001, "Wrong size on Brick_CanBrickBurn");
static_assert(offsetof(Brick_CanBrickBurn, ReturnValue) == 0x000000, "Member 'Brick_CanBrickBurn::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.ClusterRootHasAnyFuel
// 0x0001 (0x0001 - 0x0000)
struct Brick_ClusterRootHasAnyFuel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_ClusterRootHasAnyFuel) == 0x000001, "Wrong alignment on Brick_ClusterRootHasAnyFuel");
static_assert(sizeof(Brick_ClusterRootHasAnyFuel) == 0x000001, "Wrong size on Brick_ClusterRootHasAnyFuel");
static_assert(offsetof(Brick_ClusterRootHasAnyFuel, ReturnValue) == 0x000000, "Member 'Brick_ClusterRootHasAnyFuel::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.GetBrickClusterRoot
// 0x0008 (0x0008 - 0x0000)
struct Brick_GetBrickClusterRoot final
{
public:
	class UBrick*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_GetBrickClusterRoot) == 0x000008, "Wrong alignment on Brick_GetBrickClusterRoot");
static_assert(sizeof(Brick_GetBrickClusterRoot) == 0x000008, "Wrong size on Brick_GetBrickClusterRoot");
static_assert(offsetof(Brick_GetBrickClusterRoot, ReturnValue) == 0x000000, "Member 'Brick_GetBrickClusterRoot::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.GetBrickConnections
// 0x0010 (0x0010 - 0x0000)
struct Brick_GetBrickConnections final
{
public:
	TArray<class UBrickConnection*>               ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_GetBrickConnections) == 0x000008, "Wrong alignment on Brick_GetBrickConnections");
static_assert(sizeof(Brick_GetBrickConnections) == 0x000010, "Wrong size on Brick_GetBrickConnections");
static_assert(offsetof(Brick_GetBrickConnections, ReturnValue) == 0x000000, "Member 'Brick_GetBrickConnections::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.GetBrickPartRoot
// 0x0008 (0x0008 - 0x0000)
struct Brick_GetBrickPartRoot final
{
public:
	class UBrick*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_GetBrickPartRoot) == 0x000008, "Wrong alignment on Brick_GetBrickPartRoot");
static_assert(sizeof(Brick_GetBrickPartRoot) == 0x000008, "Wrong size on Brick_GetBrickPartRoot");
static_assert(offsetof(Brick_GetBrickPartRoot, ReturnValue) == 0x000000, "Member 'Brick_GetBrickPartRoot::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.GetVehicle
// 0x0008 (0x0008 - 0x0000)
struct Brick_GetVehicle final
{
public:
	class ABrickVehicle*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_GetVehicle) == 0x000008, "Wrong alignment on Brick_GetVehicle");
static_assert(sizeof(Brick_GetVehicle) == 0x000008, "Wrong size on Brick_GetVehicle");
static_assert(offsetof(Brick_GetVehicle, ReturnValue) == 0x000000, "Member 'Brick_GetVehicle::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.GetVehicleComponent
// 0x0008 (0x0008 - 0x0000)
struct Brick_GetVehicleComponent final
{
public:
	class UBrickVehicleComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_GetVehicleComponent) == 0x000008, "Wrong alignment on Brick_GetVehicleComponent");
static_assert(sizeof(Brick_GetVehicleComponent) == 0x000008, "Wrong size on Brick_GetVehicleComponent");
static_assert(offsetof(Brick_GetVehicleComponent, ReturnValue) == 0x000000, "Member 'Brick_GetVehicleComponent::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.GetVehicleStaticInfo
// 0x0008 (0x0008 - 0x0000)
struct Brick_GetVehicleStaticInfo final
{
public:
	const class UBrickVehicleStaticInfo*          ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_GetVehicleStaticInfo) == 0x000008, "Wrong alignment on Brick_GetVehicleStaticInfo");
static_assert(sizeof(Brick_GetVehicleStaticInfo) == 0x000008, "Wrong size on Brick_GetVehicleStaticInfo");
static_assert(offsetof(Brick_GetVehicleStaticInfo, ReturnValue) == 0x000000, "Member 'Brick_GetVehicleStaticInfo::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsBrickBurnt
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsBrickBurnt final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsBrickBurnt) == 0x000001, "Wrong alignment on Brick_IsBrickBurnt");
static_assert(sizeof(Brick_IsBrickBurnt) == 0x000001, "Wrong size on Brick_IsBrickBurnt");
static_assert(offsetof(Brick_IsBrickBurnt, ReturnValue) == 0x000000, "Member 'Brick_IsBrickBurnt::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsBrickClusterRoot
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsBrickClusterRoot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsBrickClusterRoot) == 0x000001, "Wrong alignment on Brick_IsBrickClusterRoot");
static_assert(sizeof(Brick_IsBrickClusterRoot) == 0x000001, "Wrong size on Brick_IsBrickClusterRoot");
static_assert(offsetof(Brick_IsBrickClusterRoot, ReturnValue) == 0x000000, "Member 'Brick_IsBrickClusterRoot::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsBrickDamaged
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsBrickDamaged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsBrickDamaged) == 0x000001, "Wrong alignment on Brick_IsBrickDamaged");
static_assert(sizeof(Brick_IsBrickDamaged) == 0x000001, "Wrong size on Brick_IsBrickDamaged");
static_assert(offsetof(Brick_IsBrickDamaged, ReturnValue) == 0x000000, "Member 'Brick_IsBrickDamaged::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsBrickPartRoot
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsBrickPartRoot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsBrickPartRoot) == 0x000001, "Wrong alignment on Brick_IsBrickPartRoot");
static_assert(sizeof(Brick_IsBrickPartRoot) == 0x000001, "Wrong size on Brick_IsBrickPartRoot");
static_assert(offsetof(Brick_IsBrickPartRoot, ReturnValue) == 0x000000, "Member 'Brick_IsBrickPartRoot::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsBrickTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsBrickTickEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsBrickTickEnabled) == 0x000001, "Wrong alignment on Brick_IsBrickTickEnabled");
static_assert(sizeof(Brick_IsBrickTickEnabled) == 0x000001, "Wrong size on Brick_IsBrickTickEnabled");
static_assert(offsetof(Brick_IsBrickTickEnabled, ReturnValue) == 0x000000, "Member 'Brick_IsBrickTickEnabled::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsConnectedToAnyBrick
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsConnectedToAnyBrick final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsConnectedToAnyBrick) == 0x000001, "Wrong alignment on Brick_IsConnectedToAnyBrick");
static_assert(sizeof(Brick_IsConnectedToAnyBrick) == 0x000001, "Wrong size on Brick_IsConnectedToAnyBrick");
static_assert(offsetof(Brick_IsConnectedToAnyBrick, ReturnValue) == 0x000000, "Member 'Brick_IsConnectedToAnyBrick::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsConnectedToRoot
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsConnectedToRoot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsConnectedToRoot) == 0x000001, "Wrong alignment on Brick_IsConnectedToRoot");
static_assert(sizeof(Brick_IsConnectedToRoot) == 0x000001, "Wrong size on Brick_IsConnectedToRoot");
static_assert(offsetof(Brick_IsConnectedToRoot, ReturnValue) == 0x000000, "Member 'Brick_IsConnectedToRoot::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsControllable
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsControllable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsControllable) == 0x000001, "Wrong alignment on Brick_IsControllable");
static_assert(sizeof(Brick_IsControllable) == 0x000001, "Wrong size on Brick_IsControllable");
static_assert(offsetof(Brick_IsControllable, ReturnValue) == 0x000000, "Member 'Brick_IsControllable::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.IsOnFire
// 0x0001 (0x0001 - 0x0000)
struct Brick_IsOnFire final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_IsOnFire) == 0x000001, "Wrong alignment on Brick_IsOnFire");
static_assert(sizeof(Brick_IsOnFire) == 0x000001, "Wrong size on Brick_IsOnFire");
static_assert(offsetof(Brick_IsOnFire, ReturnValue) == 0x000000, "Member 'Brick_IsOnFire::ReturnValue' has a wrong offset!");

// Function BrickRigs.Brick.ShouldTick
// 0x0001 (0x0001 - 0x0000)
struct Brick_ShouldTick final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Brick_ShouldTick) == 0x000001, "Wrong alignment on Brick_ShouldTick");
static_assert(sizeof(Brick_ShouldTick) == 0x000001, "Wrong size on Brick_ShouldTick");
static_assert(offsetof(Brick_ShouldTick, ReturnValue) == 0x000000, "Member 'Brick_ShouldTick::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickBorder.SetBrushStyle
// 0x0001 (0x0001 - 0x0000)
struct BrickBorder_SetBrushStyle final
{
public:
	EBrickUIBrushStyle                            NewStyle;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickBorder_SetBrushStyle) == 0x000001, "Wrong alignment on BrickBorder_SetBrushStyle");
static_assert(sizeof(BrickBorder_SetBrushStyle) == 0x000001, "Wrong size on BrickBorder_SetBrushStyle");
static_assert(offsetof(BrickBorder_SetBrushStyle, NewStyle) == 0x000000, "Member 'BrickBorder_SetBrushStyle::NewStyle' has a wrong offset!");

// Function BrickRigs.BrickBorder.SetColorStyle
// 0x0001 (0x0001 - 0x0000)
struct BrickBorder_SetColorStyle final
{
public:
	EBrickUIColorStyle                            NewStyle;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickBorder_SetColorStyle) == 0x000001, "Wrong alignment on BrickBorder_SetColorStyle");
static_assert(sizeof(BrickBorder_SetColorStyle) == 0x000001, "Wrong size on BrickBorder_SetColorStyle");
static_assert(offsetof(BrickBorder_SetColorStyle, NewStyle) == 0x000000, "Member 'BrickBorder_SetColorStyle::NewStyle' has a wrong offset!");

// Function BrickRigs.BrickBorder.SetPaddingStyle
// 0x0001 (0x0001 - 0x0000)
struct BrickBorder_SetPaddingStyle final
{
public:
	EBrickUIPaddingStyle                          NewStyle;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickBorder_SetPaddingStyle) == 0x000001, "Wrong alignment on BrickBorder_SetPaddingStyle");
static_assert(sizeof(BrickBorder_SetPaddingStyle) == 0x000001, "Wrong size on BrickBorder_SetPaddingStyle");
static_assert(offsetof(BrickBorder_SetPaddingStyle, NewStyle) == 0x000000, "Member 'BrickBorder_SetPaddingStyle::NewStyle' has a wrong offset!");

// Function BrickRigs.BrickBorder.SetStyleState
// 0x0001 (0x0001 - 0x0000)
struct BrickBorder_SetStyleState final
{
public:
	EBrickUIStyleState                            NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickBorder_SetStyleState) == 0x000001, "Wrong alignment on BrickBorder_SetStyleState");
static_assert(sizeof(BrickBorder_SetStyleState) == 0x000001, "Wrong size on BrickBorder_SetStyleState");
static_assert(offsetof(BrickBorder_SetStyleState, NewState) == 0x000000, "Member 'BrickBorder_SetStyleState::NewState' has a wrong offset!");

// Function BrickRigs.CameraBrickWidget.UpdateTargetRange
// 0x0008 (0x0008 - 0x0000)
struct CameraBrickWidget_UpdateTargetRange final
{
public:
	bool                                          bHitSomething;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Distance;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraBrickWidget_UpdateTargetRange) == 0x000004, "Wrong alignment on CameraBrickWidget_UpdateTargetRange");
static_assert(sizeof(CameraBrickWidget_UpdateTargetRange) == 0x000008, "Wrong size on CameraBrickWidget_UpdateTargetRange");
static_assert(offsetof(CameraBrickWidget_UpdateTargetRange, bHitSomething) == 0x000000, "Member 'CameraBrickWidget_UpdateTargetRange::bHitSomething' has a wrong offset!");
static_assert(offsetof(CameraBrickWidget_UpdateTargetRange, Distance) == 0x000004, "Member 'CameraBrickWidget_UpdateTargetRange::Distance' has a wrong offset!");

// Function BrickRigs.HUDIconWidget.SetIconColorStyle
// 0x0001 (0x0001 - 0x0000)
struct HUDIconWidget_SetIconColorStyle final
{
public:
	EBrickUIColorStyle                            NewColorStyle;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HUDIconWidget_SetIconColorStyle) == 0x000001, "Wrong alignment on HUDIconWidget_SetIconColorStyle");
static_assert(sizeof(HUDIconWidget_SetIconColorStyle) == 0x000001, "Wrong size on HUDIconWidget_SetIconColorStyle");
static_assert(offsetof(HUDIconWidget_SetIconColorStyle, NewColorStyle) == 0x000000, "Member 'HUDIconWidget_SetIconColorStyle::NewColorStyle' has a wrong offset!");

// Function BrickRigs.HUDIconWidget.SetIconSlot
// 0x0008 (0x0008 - 0x0000)
struct HUDIconWidget_SetIconSlot final
{
public:
	struct FBrickUIIconSlot                       NewSlot;                                           // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HUDIconWidget_SetIconSlot) == 0x000004, "Wrong alignment on HUDIconWidget_SetIconSlot");
static_assert(sizeof(HUDIconWidget_SetIconSlot) == 0x000008, "Wrong size on HUDIconWidget_SetIconSlot");
static_assert(offsetof(HUDIconWidget_SetIconSlot, NewSlot) == 0x000000, "Member 'HUDIconWidget_SetIconSlot::NewSlot' has a wrong offset!");

// Function BrickRigs.HUDIconWidget.UpdateIconRotation
// 0x0004 (0x0004 - 0x0000)
struct HUDIconWidget_UpdateIconRotation final
{
public:
	float                                         NewRotation;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HUDIconWidget_UpdateIconRotation) == 0x000004, "Wrong alignment on HUDIconWidget_UpdateIconRotation");
static_assert(sizeof(HUDIconWidget_UpdateIconRotation) == 0x000004, "Wrong size on HUDIconWidget_UpdateIconRotation");
static_assert(offsetof(HUDIconWidget_UpdateIconRotation, NewRotation) == 0x000000, "Member 'HUDIconWidget_UpdateIconRotation::NewRotation' has a wrong offset!");

// Function BrickRigs.HUDIconWidget.UpdateIconStyle
// 0x0002 (0x0002 - 0x0000)
struct HUDIconWidget_UpdateIconStyle final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBrickUIStyleState                            InStyleState;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HUDIconWidget_UpdateIconStyle) == 0x000001, "Wrong alignment on HUDIconWidget_UpdateIconStyle");
static_assert(sizeof(HUDIconWidget_UpdateIconStyle) == 0x000002, "Wrong size on HUDIconWidget_UpdateIconStyle");
static_assert(offsetof(HUDIconWidget_UpdateIconStyle, InColorStyle) == 0x000000, "Member 'HUDIconWidget_UpdateIconStyle::InColorStyle' has a wrong offset!");
static_assert(offsetof(HUDIconWidget_UpdateIconStyle, InStyleState) == 0x000001, "Member 'HUDIconWidget_UpdateIconStyle::InStyleState' has a wrong offset!");

// Function BrickRigs.HUDIconWidget.GetIconDisplayName
// 0x0018 (0x0018 - 0x0000)
struct HUDIconWidget_GetIconDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HUDIconWidget_GetIconDisplayName) == 0x000008, "Wrong alignment on HUDIconWidget_GetIconDisplayName");
static_assert(sizeof(HUDIconWidget_GetIconDisplayName) == 0x000018, "Wrong size on HUDIconWidget_GetIconDisplayName");
static_assert(offsetof(HUDIconWidget_GetIconDisplayName, ReturnValue) == 0x000000, "Member 'HUDIconWidget_GetIconDisplayName::ReturnValue' has a wrong offset!");

// Function BrickRigs.HUDIconWidget.GetIconWorldRotation
// 0x0008 (0x0008 - 0x0000)
struct HUDIconWidget_GetIconWorldRotation final
{
public:
	float                                         OutRotation;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HUDIconWidget_GetIconWorldRotation) == 0x000004, "Wrong alignment on HUDIconWidget_GetIconWorldRotation");
static_assert(sizeof(HUDIconWidget_GetIconWorldRotation) == 0x000008, "Wrong size on HUDIconWidget_GetIconWorldRotation");
static_assert(offsetof(HUDIconWidget_GetIconWorldRotation, OutRotation) == 0x000000, "Member 'HUDIconWidget_GetIconWorldRotation::OutRotation' has a wrong offset!");
static_assert(offsetof(HUDIconWidget_GetIconWorldRotation, ReturnValue) == 0x000004, "Member 'HUDIconWidget_GetIconWorldRotation::ReturnValue' has a wrong offset!");

// Function BrickRigs.AdminLoginWidget.OnTextChanged
// 0x0020 (0x0020 - 0x0000)
struct AdminLoginWidget_OnTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EValueChangedEventType                        EventType;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdminLoginWidget_OnTextChanged) == 0x000008, "Wrong alignment on AdminLoginWidget_OnTextChanged");
static_assert(sizeof(AdminLoginWidget_OnTextChanged) == 0x000020, "Wrong size on AdminLoginWidget_OnTextChanged");
static_assert(offsetof(AdminLoginWidget_OnTextChanged, Text) == 0x000000, "Member 'AdminLoginWidget_OnTextChanged::Text' has a wrong offset!");
static_assert(offsetof(AdminLoginWidget_OnTextChanged, EventType) == 0x000018, "Member 'AdminLoginWidget_OnTextChanged::EventType' has a wrong offset!");

// Function BrickRigs.AdminLoginWidget.UpdateCanEverBeAdmin
// 0x0001 (0x0001 - 0x0000)
struct AdminLoginWidget_UpdateCanEverBeAdmin final
{
public:
	bool                                          bCanBeAdmin;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdminLoginWidget_UpdateCanEverBeAdmin) == 0x000001, "Wrong alignment on AdminLoginWidget_UpdateCanEverBeAdmin");
static_assert(sizeof(AdminLoginWidget_UpdateCanEverBeAdmin) == 0x000001, "Wrong size on AdminLoginWidget_UpdateCanEverBeAdmin");
static_assert(offsetof(AdminLoginWidget_UpdateCanEverBeAdmin, bCanBeAdmin) == 0x000000, "Member 'AdminLoginWidget_UpdateCanEverBeAdmin::bCanBeAdmin' has a wrong offset!");

// Function BrickRigs.AdminLoginWidget.UpdateIsAdmin
// 0x0001 (0x0001 - 0x0000)
struct AdminLoginWidget_UpdateIsAdmin final
{
public:
	bool                                          bNewIsAdmin;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdminLoginWidget_UpdateIsAdmin) == 0x000001, "Wrong alignment on AdminLoginWidget_UpdateIsAdmin");
static_assert(sizeof(AdminLoginWidget_UpdateIsAdmin) == 0x000001, "Wrong size on AdminLoginWidget_UpdateIsAdmin");
static_assert(offsetof(AdminLoginWidget_UpdateIsAdmin, bNewIsAdmin) == 0x000000, "Member 'AdminLoginWidget_UpdateIsAdmin::bNewIsAdmin' has a wrong offset!");

// Function BrickRigs.ButtonWidgetBase.OnUpdateContentStyle
// 0x0002 (0x0002 - 0x0000)
struct ButtonWidgetBase_OnUpdateContentStyle final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBrickUIStyleState                            InStyleState;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonWidgetBase_OnUpdateContentStyle) == 0x000001, "Wrong alignment on ButtonWidgetBase_OnUpdateContentStyle");
static_assert(sizeof(ButtonWidgetBase_OnUpdateContentStyle) == 0x000002, "Wrong size on ButtonWidgetBase_OnUpdateContentStyle");
static_assert(offsetof(ButtonWidgetBase_OnUpdateContentStyle, InColorStyle) == 0x000000, "Member 'ButtonWidgetBase_OnUpdateContentStyle::InColorStyle' has a wrong offset!");
static_assert(offsetof(ButtonWidgetBase_OnUpdateContentStyle, InStyleState) == 0x000001, "Member 'ButtonWidgetBase_OnUpdateContentStyle::InStyleState' has a wrong offset!");

// Function BrickRigs.ButtonWidgetBase.SetBrushStyle
// 0x0001 (0x0001 - 0x0000)
struct ButtonWidgetBase_SetBrushStyle final
{
public:
	EBrickUIBrushStyle                            NewBrushStyle;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonWidgetBase_SetBrushStyle) == 0x000001, "Wrong alignment on ButtonWidgetBase_SetBrushStyle");
static_assert(sizeof(ButtonWidgetBase_SetBrushStyle) == 0x000001, "Wrong size on ButtonWidgetBase_SetBrushStyle");
static_assert(offsetof(ButtonWidgetBase_SetBrushStyle, NewBrushStyle) == 0x000000, "Member 'ButtonWidgetBase_SetBrushStyle::NewBrushStyle' has a wrong offset!");

// Function BrickRigs.ButtonWidgetBase.SetColorStyle
// 0x0001 (0x0001 - 0x0000)
struct ButtonWidgetBase_SetColorStyle final
{
public:
	EBrickUIColorStyle                            NewColorStyle;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonWidgetBase_SetColorStyle) == 0x000001, "Wrong alignment on ButtonWidgetBase_SetColorStyle");
static_assert(sizeof(ButtonWidgetBase_SetColorStyle) == 0x000001, "Wrong size on ButtonWidgetBase_SetColorStyle");
static_assert(offsetof(ButtonWidgetBase_SetColorStyle, NewColorStyle) == 0x000000, "Member 'ButtonWidgetBase_SetColorStyle::NewColorStyle' has a wrong offset!");

// Function BrickRigs.ButtonWidgetBase.SetCustomFocus
// 0x0002 (0x0002 - 0x0000)
struct ButtonWidgetBase_SetCustomFocus final
{
public:
	bool                                          bNewUseCustomFocus;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewFocused;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonWidgetBase_SetCustomFocus) == 0x000001, "Wrong alignment on ButtonWidgetBase_SetCustomFocus");
static_assert(sizeof(ButtonWidgetBase_SetCustomFocus) == 0x000002, "Wrong size on ButtonWidgetBase_SetCustomFocus");
static_assert(offsetof(ButtonWidgetBase_SetCustomFocus, bNewUseCustomFocus) == 0x000000, "Member 'ButtonWidgetBase_SetCustomFocus::bNewUseCustomFocus' has a wrong offset!");
static_assert(offsetof(ButtonWidgetBase_SetCustomFocus, bNewFocused) == 0x000001, "Member 'ButtonWidgetBase_SetCustomFocus::bNewFocused' has a wrong offset!");

// Function BrickRigs.ButtonWidgetBase.SetHiddenWhileUnfocused
// 0x0001 (0x0001 - 0x0000)
struct ButtonWidgetBase_SetHiddenWhileUnfocused final
{
public:
	bool                                          bNewHidden;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonWidgetBase_SetHiddenWhileUnfocused) == 0x000001, "Wrong alignment on ButtonWidgetBase_SetHiddenWhileUnfocused");
static_assert(sizeof(ButtonWidgetBase_SetHiddenWhileUnfocused) == 0x000001, "Wrong size on ButtonWidgetBase_SetHiddenWhileUnfocused");
static_assert(offsetof(ButtonWidgetBase_SetHiddenWhileUnfocused, bNewHidden) == 0x000000, "Member 'ButtonWidgetBase_SetHiddenWhileUnfocused::bNewHidden' has a wrong offset!");

// Function BrickRigs.ButtonWidgetBase.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct ButtonWidgetBase_SetIsSelected final
{
public:
	bool                                          bNewSelected;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonWidgetBase_SetIsSelected) == 0x000001, "Wrong alignment on ButtonWidgetBase_SetIsSelected");
static_assert(sizeof(ButtonWidgetBase_SetIsSelected) == 0x000001, "Wrong size on ButtonWidgetBase_SetIsSelected");
static_assert(offsetof(ButtonWidgetBase_SetIsSelected, bNewSelected) == 0x000000, "Member 'ButtonWidgetBase_SetIsSelected::bNewSelected' has a wrong offset!");

// Function BrickRigs.ButtonWidgetBase.GetButtonStyleState
// 0x0001 (0x0001 - 0x0000)
struct ButtonWidgetBase_GetButtonStyleState final
{
public:
	EBrickUIStyleState                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonWidgetBase_GetButtonStyleState) == 0x000001, "Wrong alignment on ButtonWidgetBase_GetButtonStyleState");
static_assert(sizeof(ButtonWidgetBase_GetButtonStyleState) == 0x000001, "Wrong size on ButtonWidgetBase_GetButtonStyleState");
static_assert(offsetof(ButtonWidgetBase_GetButtonStyleState, ReturnValue) == 0x000000, "Member 'ButtonWidgetBase_GetButtonStyleState::ReturnValue' has a wrong offset!");

// Function BrickRigs.ButtonWidgetBase.GetContentStyleState
// 0x0001 (0x0001 - 0x0000)
struct ButtonWidgetBase_GetContentStyleState final
{
public:
	EBrickUIStyleState                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonWidgetBase_GetContentStyleState) == 0x000001, "Wrong alignment on ButtonWidgetBase_GetContentStyleState");
static_assert(sizeof(ButtonWidgetBase_GetContentStyleState) == 0x000001, "Wrong size on ButtonWidgetBase_GetContentStyleState");
static_assert(offsetof(ButtonWidgetBase_GetContentStyleState, ReturnValue) == 0x000000, "Member 'ButtonWidgetBase_GetContentStyleState::ReturnValue' has a wrong offset!");

// Function BrickRigs.BrickButtonWidget.AddContentWidget
// 0x0008 (0x0008 - 0x0000)
struct BrickButtonWidget_AddContentWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BrickButtonWidget_AddContentWidget) == 0x000008, "Wrong alignment on BrickButtonWidget_AddContentWidget");
