#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FluMoveSync

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class FluMoveSync.FluMoveSyncActor
// 0x0008 (0x0228 - 0x0220)
class AFluMoveSyncActor : public AActor
{
public:
	float                                         RepMovementTimestamp;                              // 0x0220(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FluMoveSyncActor">();
	}
	static class AFluMoveSyncActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFluMoveSyncActor>();
	}
};
static_assert(alignof(AFluMoveSyncActor) == 0x000008, "Wrong alignment on AFluMoveSyncActor");
static_assert(sizeof(AFluMoveSyncActor) == 0x000228, "Wrong size on AFluMoveSyncActor");
static_assert(offsetof(AFluMoveSyncActor, RepMovementTimestamp) == 0x000220, "Member 'AFluMoveSyncActor::RepMovementTimestamp' has a wrong offset!");

// Class FluMoveSync.FluMoveSyncFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFluMoveSyncFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FluMoveSyncFunctionLibrary">();
	}
	static class UFluMoveSyncFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFluMoveSyncFunctionLibrary>();
	}
};
static_assert(alignof(UFluMoveSyncFunctionLibrary) == 0x000008, "Wrong alignment on UFluMoveSyncFunctionLibrary");
static_assert(sizeof(UFluMoveSyncFunctionLibrary) == 0x000028, "Wrong size on UFluMoveSyncFunctionLibrary");

// Class FluMoveSync.FluMoveSyncKinematicActor
// 0x0088 (0x02B0 - 0x0228)
class alignas(0x10) AFluMoveSyncKinematicActor : public AFluMoveSyncActor
{
public:
	uint8                                         Pad_228[0x70];                                     // 0x0228(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponent*                     MovementComponent;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        InterpolatedComponent;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetInterpolatedComponent(class USceneComponent* Comp);
	void SetMovementComponent(class UMovementComponent* Comp);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FluMoveSyncKinematicActor">();
	}
	static class AFluMoveSyncKinematicActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFluMoveSyncKinematicActor>();
	}
};
static_assert(alignof(AFluMoveSyncKinematicActor) == 0x000010, "Wrong alignment on AFluMoveSyncKinematicActor");
static_assert(sizeof(AFluMoveSyncKinematicActor) == 0x0002B0, "Wrong size on AFluMoveSyncKinematicActor");
static_assert(offsetof(AFluMoveSyncKinematicActor, MovementComponent) == 0x000298, "Member 'AFluMoveSyncKinematicActor::MovementComponent' has a wrong offset!");
static_assert(offsetof(AFluMoveSyncKinematicActor, InterpolatedComponent) == 0x0002A0, "Member 'AFluMoveSyncKinematicActor::InterpolatedComponent' has a wrong offset!");

}

