#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreboardTeam

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreboardTeam.WBP_ScoreboardTeam_C.ExecuteUbergraph_WBP_ScoreboardTeam
// 0x0014 (0x0014 - 0x0000)
struct WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsOwnTeam;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETeamAttitude                                 K2Node_Event_NewAttitude;                          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            CallFunc_GetTeamAttitudeColorStyle_ReturnValue;    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanJoin_1;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanJoin;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam) == 0x000004, "Wrong alignment on WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam");
static_assert(sizeof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam) == 0x000014, "Wrong size on WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, EntryPoint) == 0x000000, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, Temp_bool_Variable) == 0x000004, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, Temp_byte_Variable) == 0x000005, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, K2Node_Event_bIsOwnTeam) == 0x000009, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::K2Node_Event_bIsOwnTeam' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, K2Node_Event_NewAttitude) == 0x00000A, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::K2Node_Event_NewAttitude' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, CallFunc_GetTeamAttitudeColorStyle_ReturnValue) == 0x00000B, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::CallFunc_GetTeamAttitudeColorStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, K2Node_Select_Default) == 0x00000C, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, K2Node_Event_bCanJoin_1) == 0x00000D, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::K2Node_Event_bCanJoin_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, K2Node_Select_Default_1) == 0x00000E, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, K2Node_Event_bCanJoin) == 0x00000F, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::K2Node_Event_bCanJoin' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, K2Node_ComponentBoundEvent_InColorStyle) == 0x000010, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::K2Node_ComponentBoundEvent_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam, K2Node_ComponentBoundEvent_InContentStyleState) == 0x000011, "Member 'WBP_ScoreboardTeam_C_ExecuteUbergraph_WBP_ScoreboardTeam::K2Node_ComponentBoundEvent_InContentStyleState' has a wrong offset!");

// Function WBP_ScoreboardTeam.WBP_ScoreboardTeam_C.BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            InContentStyleState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature");
static_assert(sizeof(WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature) == 0x000002, "Wrong size on WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature");
static_assert(offsetof(WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature, InColorStyle) == 0x000000, "Member 'WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature::InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature, InContentStyleState) == 0x000001, "Member 'WBP_ScoreboardTeam_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature::InContentStyleState' has a wrong offset!");

// Function WBP_ScoreboardTeam.WBP_ScoreboardTeam_C.UpdateCanJoinTeam
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreboardTeam_C_UpdateCanJoinTeam final
{
public:
	bool                                          bCanJoin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScoreboardTeam_C_UpdateCanJoinTeam) == 0x000001, "Wrong alignment on WBP_ScoreboardTeam_C_UpdateCanJoinTeam");
static_assert(sizeof(WBP_ScoreboardTeam_C_UpdateCanJoinTeam) == 0x000001, "Wrong size on WBP_ScoreboardTeam_C_UpdateCanJoinTeam");
static_assert(offsetof(WBP_ScoreboardTeam_C_UpdateCanJoinTeam, bCanJoin) == 0x000000, "Member 'WBP_ScoreboardTeam_C_UpdateCanJoinTeam::bCanJoin' has a wrong offset!");

// Function WBP_ScoreboardTeam.WBP_ScoreboardTeam_C.UpdateCanEverJoinTeam
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreboardTeam_C_UpdateCanEverJoinTeam final
{
public:
	bool                                          bCanJoin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScoreboardTeam_C_UpdateCanEverJoinTeam) == 0x000001, "Wrong alignment on WBP_ScoreboardTeam_C_UpdateCanEverJoinTeam");
static_assert(sizeof(WBP_ScoreboardTeam_C_UpdateCanEverJoinTeam) == 0x000001, "Wrong size on WBP_ScoreboardTeam_C_UpdateCanEverJoinTeam");
static_assert(offsetof(WBP_ScoreboardTeam_C_UpdateCanEverJoinTeam, bCanJoin) == 0x000000, "Member 'WBP_ScoreboardTeam_C_UpdateCanEverJoinTeam::bCanJoin' has a wrong offset!");

// Function WBP_ScoreboardTeam.WBP_ScoreboardTeam_C.UpdateTeamAttitude
// 0x0002 (0x0002 - 0x0000)
struct WBP_ScoreboardTeam_C_UpdateTeamAttitude final
{
public:
	bool                                          bIsOwnTeam;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ETeamAttitude                                 NewAttitude;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreboardTeam_C_UpdateTeamAttitude) == 0x000001, "Wrong alignment on WBP_ScoreboardTeam_C_UpdateTeamAttitude");
static_assert(sizeof(WBP_ScoreboardTeam_C_UpdateTeamAttitude) == 0x000002, "Wrong size on WBP_ScoreboardTeam_C_UpdateTeamAttitude");
static_assert(offsetof(WBP_ScoreboardTeam_C_UpdateTeamAttitude, bIsOwnTeam) == 0x000000, "Member 'WBP_ScoreboardTeam_C_UpdateTeamAttitude::bIsOwnTeam' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardTeam_C_UpdateTeamAttitude, NewAttitude) == 0x000001, "Member 'WBP_ScoreboardTeam_C_UpdateTeamAttitude::NewAttitude' has a wrong offset!");

}

