#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IntroSequence

#include "Basic.hpp"

#include "GameLogoEnum_structs.hpp"
#include "Engine_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IntroSequence.WBP_IntroSequence_C
// 0x0028 (0x02A0 - 0x0278)
class UWBP_IntroSequence_C final : public UMainWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GameLogo_C*                        Logo;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         SequenceDuration;                                  // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTime;                                          // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadePauseTime;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SequenceIndex;                                     // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SequenceElapsed;                                   // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_IntroSequence(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void InitSequence();
	void UpdateFade();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	void NextSequence();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IntroSequence_C">();
	}
	static class UWBP_IntroSequence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IntroSequence_C>();
	}
};
static_assert(alignof(UWBP_IntroSequence_C) == 0x000008, "Wrong alignment on UWBP_IntroSequence_C");
static_assert(sizeof(UWBP_IntroSequence_C) == 0x0002A0, "Wrong size on UWBP_IntroSequence_C");
static_assert(offsetof(UWBP_IntroSequence_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IntroSequence_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IntroSequence_C, Logo) == 0x000280, "Member 'UWBP_IntroSequence_C::Logo' has a wrong offset!");
static_assert(offsetof(UWBP_IntroSequence_C, SequenceDuration) == 0x000288, "Member 'UWBP_IntroSequence_C::SequenceDuration' has a wrong offset!");
static_assert(offsetof(UWBP_IntroSequence_C, FadeTime) == 0x00028C, "Member 'UWBP_IntroSequence_C::FadeTime' has a wrong offset!");
static_assert(offsetof(UWBP_IntroSequence_C, FadePauseTime) == 0x000290, "Member 'UWBP_IntroSequence_C::FadePauseTime' has a wrong offset!");
static_assert(offsetof(UWBP_IntroSequence_C, SequenceIndex) == 0x000294, "Member 'UWBP_IntroSequence_C::SequenceIndex' has a wrong offset!");
static_assert(offsetof(UWBP_IntroSequence_C, SequenceElapsed) == 0x000298, "Member 'UWBP_IntroSequence_C::SequenceElapsed' has a wrong offset!");

}

