#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchState

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_MatchState.WBP_MatchState_C.ExecuteUbergraph_WBP_MatchState
// 0x0048 (0x0048 - 0x0000)
struct WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_NewDisplayText;                       // 0x0008(0x0018)(ConstParm)
	EBrickUIColorStyle                            K2Node_Event_NewColorStyle;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFadeOut;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState) == 0x000008, "Wrong alignment on WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState");
static_assert(sizeof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState) == 0x000048, "Wrong size on WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, EntryPoint) == 0x000000, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, K2Node_Event_NewDisplayText) == 0x000008, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::K2Node_Event_NewDisplayText' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, K2Node_Event_NewColorStyle) == 0x000020, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::K2Node_Event_NewColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, K2Node_Event_bFadeOut) == 0x000021, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::K2Node_Event_bFadeOut' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, CallFunc_SelectFloat_ReturnValue) == 0x000024, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, K2Node_Event_Animation) == 0x000028, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000030, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, CallFunc_GetEndTime_ReturnValue) == 0x000038, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00003C, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'WBP_MatchState_C_ExecuteUbergraph_WBP_MatchState::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_MatchState.WBP_MatchState_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_MatchState_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MatchState_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_MatchState_C_OnAnimationFinished");
static_assert(sizeof(WBP_MatchState_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_MatchState_C_OnAnimationFinished");
static_assert(offsetof(WBP_MatchState_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_MatchState_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_MatchState.WBP_MatchState_C.UpdateMatchState
// 0x0020 (0x0020 - 0x0000)
struct WBP_MatchState_C_UpdateMatchState final
{
public:
	class FText                                   NewDisplayText;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EBrickUIColorStyle                            NewColorStyle;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFadeOut;                                          // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MatchState_C_UpdateMatchState) == 0x000008, "Wrong alignment on WBP_MatchState_C_UpdateMatchState");
static_assert(sizeof(WBP_MatchState_C_UpdateMatchState) == 0x000020, "Wrong size on WBP_MatchState_C_UpdateMatchState");
static_assert(offsetof(WBP_MatchState_C_UpdateMatchState, NewDisplayText) == 0x000000, "Member 'WBP_MatchState_C_UpdateMatchState::NewDisplayText' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_UpdateMatchState, NewColorStyle) == 0x000018, "Member 'WBP_MatchState_C_UpdateMatchState::NewColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_MatchState_C_UpdateMatchState, bFadeOut) == 0x000019, "Member 'WBP_MatchState_C_UpdateMatchState::bFadeOut' has a wrong offset!");

}

