#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BrickEditorObjectProperty

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_BrickEditorObjectProperty.WBP_BrickEditorObjectProperty_C.ExecuteUbergraph_WBP_BrickEditorObjectProperty
// 0x0108 (0x0108 - 0x0000)
struct WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIBrushStyle                            Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIBrushStyle                            Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_FirstObjectName;                      // 0x0010(0x0018)(ConstParm)
	int32                                         K2Node_Event_NumSelectedObjects;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDefaultObjects;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_3;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00E8(0x0018)()
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewReadOnly;                         // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIBrushStyle                            K2Node_Select_Default_3;                           // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty) == 0x000008, "Wrong alignment on WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty");
static_assert(sizeof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty) == 0x000108, "Wrong size on WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, EntryPoint) == 0x000000, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_bool_Variable) == 0x000004, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_byte_Variable) == 0x000005, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_bool_Variable_2) == 0x00000A, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_byte_Variable_4) == 0x00000B, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_byte_Variable_5) == 0x00000C, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_Event_FirstObjectName) == 0x000010, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_Event_FirstObjectName' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_Event_NumSelectedObjects) == 0x000028, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_Event_NumSelectedObjects' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_Event_bDefaultObjects) == 0x00002C, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_Event_bDefaultObjects' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, CallFunc_Not_PreBool_ReturnValue) == 0x00002D, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, CallFunc_Greater_IntInt_ReturnValue) == 0x00002E, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00002F, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, Temp_bool_Variable_3) == 0x0000C8, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_Select_Default) == 0x0000E8, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_ComponentBoundEvent_InColorStyle) == 0x000100, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_ComponentBoundEvent_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_ComponentBoundEvent_InContentStyleState) == 0x000101, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_ComponentBoundEvent_InContentStyleState' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_Event_bNewReadOnly) == 0x000102, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_Event_bNewReadOnly' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_Select_Default_1) == 0x000103, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_Select_Default_2) == 0x000104, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, CallFunc_Not_PreBool_ReturnValue_1) == 0x000105, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty, K2Node_Select_Default_3) == 0x000106, "Member 'WBP_BrickEditorObjectProperty_C_ExecuteUbergraph_WBP_BrickEditorObjectProperty::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_BrickEditorObjectProperty.WBP_BrickEditorObjectProperty_C.UpdateIsReadOnly
// 0x0001 (0x0001 - 0x0000)
struct WBP_BrickEditorObjectProperty_C_UpdateIsReadOnly final
{
public:
	bool                                          bNewReadOnly;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_BrickEditorObjectProperty_C_UpdateIsReadOnly) == 0x000001, "Wrong alignment on WBP_BrickEditorObjectProperty_C_UpdateIsReadOnly");
static_assert(sizeof(WBP_BrickEditorObjectProperty_C_UpdateIsReadOnly) == 0x000001, "Wrong size on WBP_BrickEditorObjectProperty_C_UpdateIsReadOnly");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_UpdateIsReadOnly, bNewReadOnly) == 0x000000, "Member 'WBP_BrickEditorObjectProperty_C_UpdateIsReadOnly::bNewReadOnly' has a wrong offset!");

// Function WBP_BrickEditorObjectProperty.WBP_BrickEditorObjectProperty_C.BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            InContentStyleState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature");
static_assert(sizeof(WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature) == 0x000002, "Wrong size on WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature, InColorStyle) == 0x000000, "Member 'WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature::InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature, InContentStyleState) == 0x000001, "Member 'WBP_BrickEditorObjectProperty_C_BndEvt__WBP_BrickEditorObjectProperty_SelectButton_K2Node_ComponentBoundEvent_2_OnUpdateContentStyle__DelegateSignature::InContentStyleState' has a wrong offset!");

// Function WBP_BrickEditorObjectProperty.WBP_BrickEditorObjectProperty_C.UpdateSelectedObjects
// 0x0020 (0x0020 - 0x0000)
struct WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects final
{
public:
	class FText                                   FirstObjectName;                                   // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         NumSelectedObjects;                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDefaultObjects;                                   // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects) == 0x000008, "Wrong alignment on WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects");
static_assert(sizeof(WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects) == 0x000020, "Wrong size on WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects, FirstObjectName) == 0x000000, "Member 'WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects::FirstObjectName' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects, NumSelectedObjects) == 0x000018, "Member 'WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects::NumSelectedObjects' has a wrong offset!");
static_assert(offsetof(WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects, bDefaultObjects) == 0x00001C, "Member 'WBP_BrickEditorObjectProperty_C_UpdateSelectedObjects::bDefaultObjects' has a wrong offset!");

}

