#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Player

#include "Basic.hpp"

#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_Player.WBP_Player_C.ExecuteUbergraph_WBP_Player
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Player_C_ExecuteUbergraph_WBP_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraBrickWidget*                     K2Node_Event_InWidget;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0010(0x0010)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0020(0x0010)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_2;                       // 0x0030(0x0010)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_3;                       // 0x0040(0x0010)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_4;                       // 0x0050(0x0010)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URestrictedAreaWidget*                  K2Node_Event_InWidget_5;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDashboardWidget*                       K2Node_Event_InWidget_4;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrosshairWidget*                       K2Node_Event_InWidget_3;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_2;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_3;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurrentItemWidget*                     K2Node_Event_InWidget_2;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHealthBarWidget*                       K2Node_Event_InWidget_1;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_4;           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_5;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors_5;                       // 0x00B8(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_Player_C_ExecuteUbergraph_WBP_Player) == 0x000008, "Wrong alignment on WBP_Player_C_ExecuteUbergraph_WBP_Player");
static_assert(sizeof(WBP_Player_C_ExecuteUbergraph_WBP_Player) == 0x0000C8, "Wrong size on WBP_Player_C_ExecuteUbergraph_WBP_Player");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, EntryPoint) == 0x000000, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_Event_InWidget) == 0x000008, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_Event_InWidget' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_MakeStruct_Anchors) == 0x000010, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_MakeStruct_Anchors_1) == 0x000020, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_MakeStruct_Anchors_2) == 0x000030, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_MakeStruct_Anchors_2' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_MakeStruct_Anchors_3) == 0x000040, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_MakeStruct_Anchors_3' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_MakeStruct_Anchors_4) == 0x000050, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_MakeStruct_Anchors_4' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, CallFunc_AddChildToCanvas_ReturnValue) == 0x000060, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_Event_InWidget_5) == 0x000068, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_Event_InWidget_5' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, CallFunc_AddChildToCanvas_ReturnValue_1) == 0x000070, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::CallFunc_AddChildToCanvas_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_Event_InWidget_4) == 0x000078, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_Event_InWidget_4' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_Event_InWidget_3) == 0x000080, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_Event_InWidget_3' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, CallFunc_AddChildToCanvas_ReturnValue_2) == 0x000088, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::CallFunc_AddChildToCanvas_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, CallFunc_AddChildToCanvas_ReturnValue_3) == 0x000090, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::CallFunc_AddChildToCanvas_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_Event_InWidget_2) == 0x000098, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_Event_InWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_Event_InWidget_1) == 0x0000A0, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_Event_InWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, CallFunc_AddChildToCanvas_ReturnValue_4) == 0x0000A8, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::CallFunc_AddChildToCanvas_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, CallFunc_AddChildToCanvas_ReturnValue_5) == 0x0000B0, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::CallFunc_AddChildToCanvas_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Player_C_ExecuteUbergraph_WBP_Player, K2Node_MakeStruct_Anchors_5) == 0x0000B8, "Member 'WBP_Player_C_ExecuteUbergraph_WBP_Player::K2Node_MakeStruct_Anchors_5' has a wrong offset!");

// Function WBP_Player.WBP_Player_C.AddCameraBrickWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Player_C_AddCameraBrickWidget final
{
public:
	class UCameraBrickWidget*                     InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Player_C_AddCameraBrickWidget) == 0x000008, "Wrong alignment on WBP_Player_C_AddCameraBrickWidget");
static_assert(sizeof(WBP_Player_C_AddCameraBrickWidget) == 0x000008, "Wrong size on WBP_Player_C_AddCameraBrickWidget");
static_assert(offsetof(WBP_Player_C_AddCameraBrickWidget, InWidget) == 0x000000, "Member 'WBP_Player_C_AddCameraBrickWidget::InWidget' has a wrong offset!");

// Function WBP_Player.WBP_Player_C.AddHealthBarWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Player_C_AddHealthBarWidget final
{
public:
	class UHealthBarWidget*                       InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Player_C_AddHealthBarWidget) == 0x000008, "Wrong alignment on WBP_Player_C_AddHealthBarWidget");
static_assert(sizeof(WBP_Player_C_AddHealthBarWidget) == 0x000008, "Wrong size on WBP_Player_C_AddHealthBarWidget");
static_assert(offsetof(WBP_Player_C_AddHealthBarWidget, InWidget) == 0x000000, "Member 'WBP_Player_C_AddHealthBarWidget::InWidget' has a wrong offset!");

// Function WBP_Player.WBP_Player_C.AddCurrentItemWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Player_C_AddCurrentItemWidget final
{
public:
	class UCurrentItemWidget*                     InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Player_C_AddCurrentItemWidget) == 0x000008, "Wrong alignment on WBP_Player_C_AddCurrentItemWidget");
static_assert(sizeof(WBP_Player_C_AddCurrentItemWidget) == 0x000008, "Wrong size on WBP_Player_C_AddCurrentItemWidget");
static_assert(offsetof(WBP_Player_C_AddCurrentItemWidget, InWidget) == 0x000000, "Member 'WBP_Player_C_AddCurrentItemWidget::InWidget' has a wrong offset!");

// Function WBP_Player.WBP_Player_C.AddCrosshairWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Player_C_AddCrosshairWidget final
{
public:
	class UCrosshairWidget*                       InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Player_C_AddCrosshairWidget) == 0x000008, "Wrong alignment on WBP_Player_C_AddCrosshairWidget");
static_assert(sizeof(WBP_Player_C_AddCrosshairWidget) == 0x000008, "Wrong size on WBP_Player_C_AddCrosshairWidget");
static_assert(offsetof(WBP_Player_C_AddCrosshairWidget, InWidget) == 0x000000, "Member 'WBP_Player_C_AddCrosshairWidget::InWidget' has a wrong offset!");

// Function WBP_Player.WBP_Player_C.AddDashboardWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Player_C_AddDashboardWidget final
{
public:
	class UDashboardWidget*                       InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Player_C_AddDashboardWidget) == 0x000008, "Wrong alignment on WBP_Player_C_AddDashboardWidget");
static_assert(sizeof(WBP_Player_C_AddDashboardWidget) == 0x000008, "Wrong size on WBP_Player_C_AddDashboardWidget");
static_assert(offsetof(WBP_Player_C_AddDashboardWidget, InWidget) == 0x000000, "Member 'WBP_Player_C_AddDashboardWidget::InWidget' has a wrong offset!");

// Function WBP_Player.WBP_Player_C.AddRestrictedAreaWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Player_C_AddRestrictedAreaWidget final
{
public:
	class URestrictedAreaWidget*                  InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Player_C_AddRestrictedAreaWidget) == 0x000008, "Wrong alignment on WBP_Player_C_AddRestrictedAreaWidget");
static_assert(sizeof(WBP_Player_C_AddRestrictedAreaWidget) == 0x000008, "Wrong size on WBP_Player_C_AddRestrictedAreaWidget");
static_assert(offsetof(WBP_Player_C_AddRestrictedAreaWidget, InWidget) == 0x000000, "Member 'WBP_Player_C_AddRestrictedAreaWidget::InWidget' has a wrong offset!");

}

