#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryContainer.WBP_InventoryContainer_C
// 0x0018 (0x0288 - 0x0270)
class UWBP_InventoryContainer_C final : public UInventoryContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           MoneyBorder;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        MoneyTextBlock;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InventoryContainer(int32 EntryPoint);
	void UpdateOwnerMoney(float NewMoney);
	void UpdateHasInventory(bool bHasInventory);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryContainer_C">();
	}
	static class UWBP_InventoryContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryContainer_C>();
	}
};
static_assert(alignof(UWBP_InventoryContainer_C) == 0x000008, "Wrong alignment on UWBP_InventoryContainer_C");
static_assert(sizeof(UWBP_InventoryContainer_C) == 0x000288, "Wrong size on UWBP_InventoryContainer_C");
static_assert(offsetof(UWBP_InventoryContainer_C, UberGraphFrame) == 0x000270, "Member 'UWBP_InventoryContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryContainer_C, MoneyBorder) == 0x000278, "Member 'UWBP_InventoryContainer_C::MoneyBorder' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryContainer_C, MoneyTextBlock) == 0x000280, "Member 'UWBP_InventoryContainer_C::MoneyTextBlock' has a wrong offset!");

}

