#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryPopup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_InventoryPopup.WBP_InventoryPopup_C.ExecuteUbergraph_WBP_InventoryPopup
// 0x0014 (0x0014 - 0x0000)
struct WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsDragging;                        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInCanDrop;                           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsDragOver;                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup) == 0x000004, "Wrong alignment on WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup");
static_assert(sizeof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup) == 0x000014, "Wrong size on WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, EntryPoint) == 0x000000, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, Temp_bool_Variable) == 0x000004, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, Temp_byte_Variable) == 0x000005, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, K2Node_Event_bInIsDragging) == 0x00000A, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::K2Node_Event_bInIsDragging' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, K2Node_Event_bInCanDrop) == 0x00000B, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::K2Node_Event_bInCanDrop' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, K2Node_Event_bInIsDragOver) == 0x00000C, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::K2Node_Event_bInIsDragOver' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, K2Node_ComponentBoundEvent_InColorStyle) == 0x00000D, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::K2Node_ComponentBoundEvent_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, K2Node_ComponentBoundEvent_InContentStyleState) == 0x00000E, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::K2Node_ComponentBoundEvent_InContentStyleState' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, K2Node_Select_Default) == 0x000010, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup, K2Node_Select_Default_1) == 0x000011, "Member 'WBP_InventoryPopup_C_ExecuteUbergraph_WBP_InventoryPopup::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_InventoryPopup.WBP_InventoryPopup_C.BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            InContentStyleState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature");
static_assert(sizeof(WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature) == 0x000002, "Wrong size on WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature");
static_assert(offsetof(WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature, InColorStyle) == 0x000000, "Member 'WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature::InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature, InContentStyleState) == 0x000001, "Member 'WBP_InventoryPopup_C_BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature::InContentStyleState' has a wrong offset!");

// Function WBP_InventoryPopup.WBP_InventoryPopup_C.UpdateDropArea
// 0x0003 (0x0003 - 0x0000)
struct WBP_InventoryPopup_C_UpdateDropArea final
{
public:
	bool                                          bInIsDragging;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInCanDrop;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInIsDragOver;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_InventoryPopup_C_UpdateDropArea) == 0x000001, "Wrong alignment on WBP_InventoryPopup_C_UpdateDropArea");
static_assert(sizeof(WBP_InventoryPopup_C_UpdateDropArea) == 0x000003, "Wrong size on WBP_InventoryPopup_C_UpdateDropArea");
static_assert(offsetof(WBP_InventoryPopup_C_UpdateDropArea, bInIsDragging) == 0x000000, "Member 'WBP_InventoryPopup_C_UpdateDropArea::bInIsDragging' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_UpdateDropArea, bInCanDrop) == 0x000001, "Member 'WBP_InventoryPopup_C_UpdateDropArea::bInCanDrop' has a wrong offset!");
static_assert(offsetof(WBP_InventoryPopup_C_UpdateDropArea, bInIsDragOver) == 0x000002, "Member 'WBP_InventoryPopup_C_UpdateDropArea::bInIsDragOver' has a wrong offset!");

}

