#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdminMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_AdminMenu.WBP_AdminMenu_C.ExecuteUbergraph_WBP_AdminMenu
// 0x0088 (0x0088 - 0x0000)
struct WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWidget*                            CallFunc_GetMenuWidget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuButtonWidget*                      CallFunc_CreateShowProfileButton_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UMenuButtonWidget*                      CallFunc_CreateButton_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateRefreshButton_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuButtonWidget*                      CallFunc_CreateButton_ReturnValue_1;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewSelected;                         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewCanViewAndEdit;                   // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu) == 0x000008, "Wrong alignment on WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu");
static_assert(sizeof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu) == 0x000088, "Wrong size on WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, EntryPoint) == 0x000000, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_IsStandalone_ReturnValue) == 0x000004, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, Temp_byte_Variable) == 0x000005, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_GetMenuWidget_ReturnValue) == 0x000008, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, Temp_byte_Variable_1) == 0x000020, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_CreateShowProfileButton_ReturnValue) == 0x000028, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_CreateShowProfileButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_CreateButton_ReturnValue) == 0x000050, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_CreateButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_CreateRefreshButton_ReturnValue) == 0x000058, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_CreateRefreshButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, Temp_bool_Variable) == 0x000060, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000064, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, CallFunc_CreateButton_ReturnValue_1) == 0x000078, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::CallFunc_CreateButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_Select_Default) == 0x000080, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_Event_bNewSelected) == 0x000081, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_Event_bNewSelected' has a wrong offset!");
static_assert(offsetof(WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu, K2Node_Event_bNewCanViewAndEdit) == 0x000082, "Member 'WBP_AdminMenu_C_ExecuteUbergraph_WBP_AdminMenu::K2Node_Event_bNewCanViewAndEdit' has a wrong offset!");

// Function WBP_AdminMenu.WBP_AdminMenu_C.UpdateCanViewAndEditKicks
// 0x0001 (0x0001 - 0x0000)
struct WBP_AdminMenu_C_UpdateCanViewAndEditKicks final
{
public:
	bool                                          bNewCanViewAndEdit;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_AdminMenu_C_UpdateCanViewAndEditKicks) == 0x000001, "Wrong alignment on WBP_AdminMenu_C_UpdateCanViewAndEditKicks");
static_assert(sizeof(WBP_AdminMenu_C_UpdateCanViewAndEditKicks) == 0x000001, "Wrong size on WBP_AdminMenu_C_UpdateCanViewAndEditKicks");
static_assert(offsetof(WBP_AdminMenu_C_UpdateCanViewAndEditKicks, bNewCanViewAndEdit) == 0x000000, "Member 'WBP_AdminMenu_C_UpdateCanViewAndEditKicks::bNewCanViewAndEdit' has a wrong offset!");

// Function WBP_AdminMenu.WBP_AdminMenu_C.UpdateHasSelectedKick
// 0x0001 (0x0001 - 0x0000)
struct WBP_AdminMenu_C_UpdateHasSelectedKick final
{
public:
	bool                                          bNewSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_AdminMenu_C_UpdateHasSelectedKick) == 0x000001, "Wrong alignment on WBP_AdminMenu_C_UpdateHasSelectedKick");
static_assert(sizeof(WBP_AdminMenu_C_UpdateHasSelectedKick) == 0x000001, "Wrong size on WBP_AdminMenu_C_UpdateHasSelectedKick");
static_assert(offsetof(WBP_AdminMenu_C_UpdateHasSelectedKick, bNewSelected) == 0x000000, "Member 'WBP_AdminMenu_C_UpdateHasSelectedKick::bNewSelected' has a wrong offset!");

}

