#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialMediaLink

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_SocialMediaLink.WBP_SocialMediaLink_C.ExecuteUbergraph_WBP_SocialMediaLink
// 0x000C (0x000C - 0x0000)
struct WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink) == 0x000004, "Wrong alignment on WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink");
static_assert(sizeof(WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink) == 0x00000C, "Wrong size on WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink");
static_assert(offsetof(WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink, EntryPoint) == 0x000000, "Member 'WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink, K2Node_Event_IsDesignTime) == 0x000006, "Member 'WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink, K2Node_ComponentBoundEvent_InColorStyle) == 0x000007, "Member 'WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink::K2Node_ComponentBoundEvent_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink, K2Node_ComponentBoundEvent_InContentStyleState) == 0x000008, "Member 'WBP_SocialMediaLink_C_ExecuteUbergraph_WBP_SocialMediaLink::K2Node_ComponentBoundEvent_InContentStyleState' has a wrong offset!");

// Function WBP_SocialMediaLink.WBP_SocialMediaLink_C.BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            InContentStyleState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature");
static_assert(sizeof(WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature) == 0x000002, "Wrong size on WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature");
static_assert(offsetof(WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature, InColorStyle) == 0x000000, "Member 'WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature::InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature, InContentStyleState) == 0x000001, "Member 'WBP_SocialMediaLink_C_BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature::InContentStyleState' has a wrong offset!");

// Function WBP_SocialMediaLink.WBP_SocialMediaLink_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SocialMediaLink_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_SocialMediaLink_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SocialMediaLink_C_PreConstruct");
static_assert(sizeof(WBP_SocialMediaLink_C_PreConstruct) == 0x000001, "Wrong size on WBP_SocialMediaLink_C_PreConstruct");
static_assert(offsetof(WBP_SocialMediaLink_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SocialMediaLink_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

