#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NumericProperty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NumericProperty.WBP_NumericProperty_C
// 0x0018 (0x02C8 - 0x02B0)
class UWBP_NumericProperty_C final : public UNumericPropertyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickHorizontalBox*                    SlidersBox;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButtonWidget*                      LockButton;                                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_NumericProperty(int32 EntryPoint);
	void Destruct();
	void OnLockButtonClicked();
	void UpdateNumericProperty(const ENumericValueType ValueType, const int32 NumAxes);
	void OnBrickUnitsButtonClicked();
	void AddSliderWidget(class UBrickSliderWidget* Slider);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NumericProperty_C">();
	}
	static class UWBP_NumericProperty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NumericProperty_C>();
	}
};
static_assert(alignof(UWBP_NumericProperty_C) == 0x000008, "Wrong alignment on UWBP_NumericProperty_C");
static_assert(sizeof(UWBP_NumericProperty_C) == 0x0002C8, "Wrong size on UWBP_NumericProperty_C");
static_assert(offsetof(UWBP_NumericProperty_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_NumericProperty_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NumericProperty_C, SlidersBox) == 0x0002B8, "Member 'UWBP_NumericProperty_C::SlidersBox' has a wrong offset!");
static_assert(offsetof(UWBP_NumericProperty_C, LockButton) == 0x0002C0, "Member 'UWBP_NumericProperty_C::LockButton' has a wrong offset!");

}

