#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputKeySpacer

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputKeySpacer.WBP_InputKeySpacer_C.ExecuteUbergraph_WBP_InputKeySpacer
// 0x0008 (0x0008 - 0x0000)
struct WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_CustomEvent_NewStyle;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_CustomEvent_NewState;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer) == 0x000004, "Wrong alignment on WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer");
static_assert(sizeof(WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer) == 0x000008, "Wrong size on WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer");
static_assert(offsetof(WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer, EntryPoint) == 0x000000, "Member 'WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer, K2Node_CustomEvent_NewStyle) == 0x000004, "Member 'WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer::K2Node_CustomEvent_NewStyle' has a wrong offset!");
static_assert(offsetof(WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer, K2Node_CustomEvent_NewState) == 0x000005, "Member 'WBP_InputKeySpacer_C_ExecuteUbergraph_WBP_InputKeySpacer::K2Node_CustomEvent_NewState' has a wrong offset!");

// Function WBP_InputKeySpacer.WBP_InputKeySpacer_C.UpdateStyleState
// 0x0002 (0x0002 - 0x0000)
struct WBP_InputKeySpacer_C_UpdateStyleState final
{
public:
	EBrickUIColorStyle                            NewStyle;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputKeySpacer_C_UpdateStyleState) == 0x000001, "Wrong alignment on WBP_InputKeySpacer_C_UpdateStyleState");
static_assert(sizeof(WBP_InputKeySpacer_C_UpdateStyleState) == 0x000002, "Wrong size on WBP_InputKeySpacer_C_UpdateStyleState");
static_assert(offsetof(WBP_InputKeySpacer_C_UpdateStyleState, NewStyle) == 0x000000, "Member 'WBP_InputKeySpacer_C_UpdateStyleState::NewStyle' has a wrong offset!");
static_assert(offsetof(WBP_InputKeySpacer_C_UpdateStyleState, NewState) == 0x000001, "Member 'WBP_InputKeySpacer_C_UpdateStyleState::NewState' has a wrong offset!");

}

