#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Crosshair.WBP_Crosshair_C
// 0x0018 (0x02E0 - 0x02C8)
class UWBP_Crosshair_C final : public UCrosshairWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HitMarkerAnim;                                     // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBrickImage*                            WinchIcon;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Crosshair(int32 EntryPoint);
	void UpdateWinchAttachment(bool bBlockingHit, bool bWithinRange);
	void UpdateIsAttachingWinch(bool bNewAttaching);
	void PlayHitAnimation(const struct FClientDamageInfo& DamageInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Crosshair_C">();
	}
	static class UWBP_Crosshair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Crosshair_C>();
	}
};
static_assert(alignof(UWBP_Crosshair_C) == 0x000008, "Wrong alignment on UWBP_Crosshair_C");
static_assert(sizeof(UWBP_Crosshair_C) == 0x0002E0, "Wrong size on UWBP_Crosshair_C");
static_assert(offsetof(UWBP_Crosshair_C, UberGraphFrame) == 0x0002C8, "Member 'UWBP_Crosshair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, HitMarkerAnim) == 0x0002D0, "Member 'UWBP_Crosshair_C::HitMarkerAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, WinchIcon) == 0x0002D8, "Member 'UWBP_Crosshair_C::WinchIcon' has a wrong offset!");

}

