#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConnectorSpacingProperty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ConnectorSpacingProperty.WBP_ConnectorSpacingProperty_C
// 0x0028 (0x02A8 - 0x0280)
class UWBP_ConnectorSpacingProperty_C final : public UConnectorSpacingPropertyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickGridPanel*                        GridPanel;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_ConnectorSpacingAxis_C*>    AxisWidgets;                                       // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FScalableBrickConnectorSpacing         ConnectorSpacing;                                  // 0x02A0(0x0002)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumAxesUsed;                                       // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ConnectorSpacingProperty(int32 EntryPoint);
	void UpdateConnectorSpacing(const struct FScalableBrickConnectorSpacing& NewSpacing, const uint8 AxisFlags);
	void Destruct();
	void OnAxisClicked(EFluAxisSigned Axis);

	class FName GetFocusedSubProperty(const struct FWidgetPathWrapper& WidgetPath) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ConnectorSpacingProperty_C">();
	}
	static class UWBP_ConnectorSpacingProperty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConnectorSpacingProperty_C>();
	}
};
static_assert(alignof(UWBP_ConnectorSpacingProperty_C) == 0x000008, "Wrong alignment on UWBP_ConnectorSpacingProperty_C");
static_assert(sizeof(UWBP_ConnectorSpacingProperty_C) == 0x0002A8, "Wrong size on UWBP_ConnectorSpacingProperty_C");
static_assert(offsetof(UWBP_ConnectorSpacingProperty_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ConnectorSpacingProperty_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ConnectorSpacingProperty_C, GridPanel) == 0x000288, "Member 'UWBP_ConnectorSpacingProperty_C::GridPanel' has a wrong offset!");
static_assert(offsetof(UWBP_ConnectorSpacingProperty_C, AxisWidgets) == 0x000290, "Member 'UWBP_ConnectorSpacingProperty_C::AxisWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_ConnectorSpacingProperty_C, ConnectorSpacing) == 0x0002A0, "Member 'UWBP_ConnectorSpacingProperty_C::ConnectorSpacing' has a wrong offset!");
static_assert(offsetof(UWBP_ConnectorSpacingProperty_C, NumAxesUsed) == 0x0002A4, "Member 'UWBP_ConnectorSpacingProperty_C::NumAxesUsed' has a wrong offset!");

}

