#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VideoSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VideoSettings.WBP_VideoSettings_C
// 0x0018 (0x02E0 - 0x02C8)
class UWBP_VideoSettings_C final : public UVideoSettingsPageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMenuButtonWidget*                      ApplyButton;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPopupHandle                           SaveSettingsPopupHandle;                           // 0x02D8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_WBP_VideoSettings(int32 EntryPoint);
	void AddProperties();
	void OnSaveSettingsPopupClosed(EPopupResult Result);
	void UpdateApplyButton(bool bCanApply);
	void Construct();
	bool StepBack();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VideoSettings_C">();
	}
	static class UWBP_VideoSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VideoSettings_C>();
	}
};
static_assert(alignof(UWBP_VideoSettings_C) == 0x000008, "Wrong alignment on UWBP_VideoSettings_C");
static_assert(sizeof(UWBP_VideoSettings_C) == 0x0002E0, "Wrong size on UWBP_VideoSettings_C");
static_assert(offsetof(UWBP_VideoSettings_C, UberGraphFrame) == 0x0002C8, "Member 'UWBP_VideoSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VideoSettings_C, ApplyButton) == 0x0002D0, "Member 'UWBP_VideoSettings_C::ApplyButton' has a wrong offset!");
static_assert(offsetof(UWBP_VideoSettings_C, SaveSettingsPopupHandle) == 0x0002D8, "Member 'UWBP_VideoSettings_C::SaveSettingsPopupHandle' has a wrong offset!");

}

