#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputMappingProperty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputMappingProperty.WBP_InputMappingProperty_C
// 0x0020 (0x02F0 - 0x02D0)
class UWBP_InputMappingProperty_C final : public UInputMappingPropertyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BrickButton_C*                     AddButton;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickImage*                            AddImage;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickHorizontalBox*                    KeysBox;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InputMappingProperty(int32 EntryPoint);
	void AddKeyWidget(class UInputMappingKeyWidget* Widget, int32 Index_0);
	void BndEvt__AddButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InContentStyleState);
	void BndEvt__AddButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void UpdateCanAddMapping(bool bCanAdd);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InputMappingProperty_C">();
	}
	static class UWBP_InputMappingProperty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputMappingProperty_C>();
	}
};
static_assert(alignof(UWBP_InputMappingProperty_C) == 0x000008, "Wrong alignment on UWBP_InputMappingProperty_C");
static_assert(sizeof(UWBP_InputMappingProperty_C) == 0x0002F0, "Wrong size on UWBP_InputMappingProperty_C");
static_assert(offsetof(UWBP_InputMappingProperty_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_InputMappingProperty_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InputMappingProperty_C, AddButton) == 0x0002D8, "Member 'UWBP_InputMappingProperty_C::AddButton' has a wrong offset!");
static_assert(offsetof(UWBP_InputMappingProperty_C, AddImage) == 0x0002E0, "Member 'UWBP_InputMappingProperty_C::AddImage' has a wrong offset!");
static_assert(offsetof(UWBP_InputMappingProperty_C, KeysBox) == 0x0002E8, "Member 'UWBP_InputMappingProperty_C::KeysBox' has a wrong offset!");

}

