#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PropertyContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PropertyContainer.WBP_PropertyContainer_C
// 0x0018 (0x02E0 - 0x02C8)
class UWBP_PropertyContainer_C final : public UPropertyContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           Border;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickGridPanel*                        GridPanel;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void AddPropertyWidget(class UPropertyWidget* Widget, EOrientation InOrientation);
	void UpdateOrientation(EOrientation InOrientation);
	void UpdateColorStyle(EBrickUIColorStyle InColorStyle);
	void OnMenuButtonClicked();
	void PostAddPropertyButtons();
	void ExecuteUbergraph_WBP_PropertyContainer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PropertyContainer_C">();
	}
	static class UWBP_PropertyContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PropertyContainer_C>();
	}
};
static_assert(alignof(UWBP_PropertyContainer_C) == 0x000008, "Wrong alignment on UWBP_PropertyContainer_C");
static_assert(sizeof(UWBP_PropertyContainer_C) == 0x0002E0, "Wrong size on UWBP_PropertyContainer_C");
static_assert(offsetof(UWBP_PropertyContainer_C, UberGraphFrame) == 0x0002C8, "Member 'UWBP_PropertyContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PropertyContainer_C, Border) == 0x0002D0, "Member 'UWBP_PropertyContainer_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_PropertyContainer_C, GridPanel) == 0x0002D8, "Member 'UWBP_PropertyContainer_C::GridPanel' has a wrong offset!");

}

