#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VideoSettings

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_VideoSettings.WBP_VideoSettings_C.ExecuteUbergraph_WBP_VideoSettings
// 0x0080 (0x0080 - 0x0000)
struct WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrickPropertyReflectionFilter         K2Node_MakeStruct_BrickPropertyReflectionFilter;   // 0x0008(0x0020)()
	class UMenuWidget*                            CallFunc_GetMenuWidget_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bCanApply;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuButtonWidget*                      CallFunc_CreateApplyButton_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupResult                                  K2Node_CustomEvent_Result;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWidget*                            CallFunc_GetMenuWidget_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StepBack_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyUserSettings*                        CallFunc_Get_ReturnValue;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings) == 0x000008, "Wrong alignment on WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings");
static_assert(sizeof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings) == 0x000080, "Wrong size on WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, EntryPoint) == 0x000000, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, K2Node_MakeStruct_BrickPropertyReflectionFilter) == 0x000008, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::K2Node_MakeStruct_BrickPropertyReflectionFilter' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, CallFunc_GetMenuWidget_ReturnValue) == 0x000028, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, K2Node_Event_bCanApply) == 0x000040, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::K2Node_Event_bCanApply' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, CallFunc_CreateApplyButton_ReturnValue) == 0x000048, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::CallFunc_CreateApplyButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, K2Node_CustomEvent_Result) == 0x000050, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, CallFunc_GetMenuWidget_ReturnValue_1) == 0x000058, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::CallFunc_GetMenuWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, CallFunc_StepBack_ReturnValue) == 0x000060, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::CallFunc_StepBack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, CallFunc_Get_ReturnValue) == 0x000068, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_VideoSettings_C_ExecuteUbergraph_WBP_VideoSettings::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_VideoSettings.WBP_VideoSettings_C.OnSaveSettingsPopupClosed
// 0x0001 (0x0001 - 0x0000)
struct WBP_VideoSettings_C_OnSaveSettingsPopupClosed final
{
public:
	EPopupResult                                  Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoSettings_C_OnSaveSettingsPopupClosed) == 0x000001, "Wrong alignment on WBP_VideoSettings_C_OnSaveSettingsPopupClosed");
static_assert(sizeof(WBP_VideoSettings_C_OnSaveSettingsPopupClosed) == 0x000001, "Wrong size on WBP_VideoSettings_C_OnSaveSettingsPopupClosed");
static_assert(offsetof(WBP_VideoSettings_C_OnSaveSettingsPopupClosed, Result) == 0x000000, "Member 'WBP_VideoSettings_C_OnSaveSettingsPopupClosed::Result' has a wrong offset!");

// Function WBP_VideoSettings.WBP_VideoSettings_C.UpdateApplyButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_VideoSettings_C_UpdateApplyButton final
{
public:
	bool                                          bCanApply;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_VideoSettings_C_UpdateApplyButton) == 0x000001, "Wrong alignment on WBP_VideoSettings_C_UpdateApplyButton");
static_assert(sizeof(WBP_VideoSettings_C_UpdateApplyButton) == 0x000001, "Wrong size on WBP_VideoSettings_C_UpdateApplyButton");
static_assert(offsetof(WBP_VideoSettings_C_UpdateApplyButton, bCanApply) == 0x000000, "Member 'WBP_VideoSettings_C_UpdateApplyButton::bCanApply' has a wrong offset!");

// Function WBP_VideoSettings.WBP_VideoSettings_C.StepBack
// 0x0030 (0x0030 - 0x0000)
struct WBP_VideoSettings_C_StepBack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupResult Result)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UBrickGameInstance*                     K2Node_DynamicCast_AsBrick_Game_Instance;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StepBack_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenMessagePopup_ReturnValue;             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreVideoSettingsDirty_ReturnValue;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_VideoSettings_C_StepBack) == 0x000008, "Wrong alignment on WBP_VideoSettings_C_StepBack");
static_assert(sizeof(WBP_VideoSettings_C_StepBack) == 0x000030, "Wrong size on WBP_VideoSettings_C_StepBack");
static_assert(offsetof(WBP_VideoSettings_C_StepBack, ReturnValue) == 0x000000, "Member 'WBP_VideoSettings_C_StepBack::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_StepBack, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WBP_VideoSettings_C_StepBack::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_StepBack, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_VideoSettings_C_StepBack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_StepBack, K2Node_DynamicCast_AsBrick_Game_Instance) == 0x000020, "Member 'WBP_VideoSettings_C_StepBack::K2Node_DynamicCast_AsBrick_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_StepBack, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_VideoSettings_C_StepBack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_StepBack, CallFunc_StepBack_ReturnValue) == 0x000029, "Member 'WBP_VideoSettings_C_StepBack::CallFunc_StepBack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_StepBack, CallFunc_OpenMessagePopup_ReturnValue) == 0x00002A, "Member 'WBP_VideoSettings_C_StepBack::CallFunc_OpenMessagePopup_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoSettings_C_StepBack, CallFunc_AreVideoSettingsDirty_ReturnValue) == 0x00002B, "Member 'WBP_VideoSettings_C_StepBack::CallFunc_AreVideoSettingsDirty_ReturnValue' has a wrong offset!");

}

