#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TeamScore

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_TeamScore.WBP_TeamScore_C.ExecuteUbergraph_WBP_TeamScore
// 0x0108 (0x0108 - 0x0000)
struct WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewScore;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewMaxScore;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 K2Node_Event_NewTeamAttitude;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	EBrickUIColorStyle                            CallFunc_GetTeamAttitudeColorStyle_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class UTexture2D*                             K2Node_Event_NewIcon;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00F0(0x0018)()
};
static_assert(alignof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore) == 0x000008, "Wrong alignment on WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore");
static_assert(sizeof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore) == 0x000108, "Wrong size on WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, EntryPoint) == 0x000000, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, Temp_bool_Variable) == 0x000004, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, K2Node_Event_NewScore) == 0x000008, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::K2Node_Event_NewScore' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, K2Node_Event_NewMaxScore) == 0x00000C, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::K2Node_Event_NewMaxScore' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, K2Node_Event_NewTeamAttitude) == 0x000010, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::K2Node_Event_NewTeamAttitude' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, CallFunc_GetTeamAttitudeColorStyle_ReturnValue) == 0x000058, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::CallFunc_GetTeamAttitudeColorStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, CallFunc_Greater_IntInt_ReturnValue) == 0x000059, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A0, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, K2Node_Event_NewIcon) == 0x0000C8, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::K2Node_Event_NewIcon' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E8, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore, K2Node_Select_Default) == 0x0000F0, "Member 'WBP_TeamScore_C_ExecuteUbergraph_WBP_TeamScore::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TeamScore.WBP_TeamScore_C.UpdateTeamIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_TeamScore_C_UpdateTeamIcon final
{
public:
	class UTexture2D*                             NewIcon;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeamScore_C_UpdateTeamIcon) == 0x000008, "Wrong alignment on WBP_TeamScore_C_UpdateTeamIcon");
static_assert(sizeof(WBP_TeamScore_C_UpdateTeamIcon) == 0x000008, "Wrong size on WBP_TeamScore_C_UpdateTeamIcon");
static_assert(offsetof(WBP_TeamScore_C_UpdateTeamIcon, NewIcon) == 0x000000, "Member 'WBP_TeamScore_C_UpdateTeamIcon::NewIcon' has a wrong offset!");

// Function WBP_TeamScore.WBP_TeamScore_C.UpdateTeamAttitude
// 0x0001 (0x0001 - 0x0000)
struct WBP_TeamScore_C_UpdateTeamAttitude final
{
public:
	ETeamAttitude                                 NewTeamAttitude;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeamScore_C_UpdateTeamAttitude) == 0x000001, "Wrong alignment on WBP_TeamScore_C_UpdateTeamAttitude");
static_assert(sizeof(WBP_TeamScore_C_UpdateTeamAttitude) == 0x000001, "Wrong size on WBP_TeamScore_C_UpdateTeamAttitude");
static_assert(offsetof(WBP_TeamScore_C_UpdateTeamAttitude, NewTeamAttitude) == 0x000000, "Member 'WBP_TeamScore_C_UpdateTeamAttitude::NewTeamAttitude' has a wrong offset!");

// Function WBP_TeamScore.WBP_TeamScore_C.UpdateScore
// 0x0008 (0x0008 - 0x0000)
struct WBP_TeamScore_C_UpdateScore final
{
public:
	int32                                         NewScore;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewMaxScore;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeamScore_C_UpdateScore) == 0x000004, "Wrong alignment on WBP_TeamScore_C_UpdateScore");
static_assert(sizeof(WBP_TeamScore_C_UpdateScore) == 0x000008, "Wrong size on WBP_TeamScore_C_UpdateScore");
static_assert(offsetof(WBP_TeamScore_C_UpdateScore, NewScore) == 0x000000, "Member 'WBP_TeamScore_C_UpdateScore::NewScore' has a wrong offset!");
static_assert(offsetof(WBP_TeamScore_C_UpdateScore, NewMaxScore) == 0x000004, "Member 'WBP_TeamScore_C_UpdateScore::NewMaxScore' has a wrong offset!");

}

