#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PropertiesPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PropertiesPanel.WBP_PropertiesPanel_C.AddCategoryWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_PropertiesPanel_C_AddCategoryWidget final
{
public:
	class UPropertyCategoryWidget*                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PropertiesPanel_C_AddCategoryWidget) == 0x000008, "Wrong alignment on WBP_PropertiesPanel_C_AddCategoryWidget");
static_assert(sizeof(WBP_PropertiesPanel_C_AddCategoryWidget) == 0x000010, "Wrong size on WBP_PropertiesPanel_C_AddCategoryWidget");
static_assert(offsetof(WBP_PropertiesPanel_C_AddCategoryWidget, Widget) == 0x000000, "Member 'WBP_PropertiesPanel_C_AddCategoryWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PropertiesPanel_C_AddCategoryWidget, Index_0) == 0x000008, "Member 'WBP_PropertiesPanel_C_AddCategoryWidget::Index_0' has a wrong offset!");

// Function WBP_PropertiesPanel.WBP_PropertiesPanel_C.ExecuteUbergraph_WBP_PropertiesPanel
// 0x0020 (0x0020 - 0x0000)
struct WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPropertyCategoryWidget*                K2Node_Event_Widget;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel) == 0x000008, "Wrong alignment on WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel");
static_assert(sizeof(WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel) == 0x000020, "Wrong size on WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel");
static_assert(offsetof(WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel, EntryPoint) == 0x000000, "Member 'WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel, K2Node_Event_Widget) == 0x000008, "Member 'WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel, K2Node_Event_Index) == 0x000010, "Member 'WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_PropertiesPanel_C_ExecuteUbergraph_WBP_PropertiesPanel::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

}

