#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ColorProperty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ColorProperty.WBP_ColorProperty_C
// 0x0088 (0x0308 - 0x0280)
class UWBP_ColorProperty_C final : public UColorPropertyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BrickSlider_C*                     AlphaSlider;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickBorder*                           ColorBorder;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        ColorNameTextBlock;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ColorPalette_C*                    ColorPalette;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ColorWheel_C*                      ColorWheel;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BrickButton_C*                     DisplayModeButton;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        DisplayModeTextBlock;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BrickTextBox_C*                    HexTextBox;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BrickSlider_C*                     HueSlider;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BrickSlider_C*                     SaturationSlider;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BrickSlider_C*                     ValueSlider;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           CurrentColor;                                      // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentColorHSV;                                   // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 LastUpdatedValue;                                  // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitializedColor;                                 // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_ColorProperty(int32 EntryPoint);
	void CycleColorDisplayMode();
	void UpdateColorPropertyValue(const struct FColor& NewColor, const bool bValueChanged);
	void PreConstruct(bool IsDesignTime);
	void OnColorDisplayModeChanged(const EColorDisplayMode NewDisplayMode);
	void BndEvt__WBP_ColorProperty_HexTextBox_K2Node_ComponentBoundEvent_8_OnTextBoxChanged__DelegateSignature(const class FText& NewText, EValueChangedEventType EventType);
	void BndEvt__WBP_ColorProperty_AlphaSlider_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature(float Value, EValueChangedEventType EventType);
	void BndEvt__WBP_ColorProperty_ValueSlider_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature(float Value, EValueChangedEventType EventType);
	void BndEvt__WBP_ColorProperty_SaturationSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature(float Value, EValueChangedEventType EventType);
	void BndEvt__WBP_ColorProperty_HueSlider_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature(float Value, EValueChangedEventType EventType);
	void BndEvt__WBP_ColorProperty_ColorPalette_K2Node_ComponentBoundEvent_3_OnColorChanged__DelegateSignature(const struct FLinearColor& NewColor, EValueChangedEventType EventType);
	void BndEvt__WBP_ColorProperty_ColorWheel_K2Node_ComponentBoundEvent_2_ColorChanged__DelegateSignature(const struct FLinearColor& NewColor, EValueChangedEventType EventType);
	void UpdateColorDisplayMode();
	void Destruct();
	void Construct();
	void BndEvt__WBP_ColorProperty_DisplayModeButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__WBP_ColorProperty_DisplayModeButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InContentStyleState);
	void SetCurrentColor(const struct FLinearColor& NewColor, const EValueChangedEventType EventType, bool bIsHSV);
	void UpdateCurrentColor(bool bUpdateHex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ColorProperty_C">();
	}
	static class UWBP_ColorProperty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ColorProperty_C>();
	}
};
static_assert(alignof(UWBP_ColorProperty_C) == 0x000008, "Wrong alignment on UWBP_ColorProperty_C");
static_assert(sizeof(UWBP_ColorProperty_C) == 0x000308, "Wrong size on UWBP_ColorProperty_C");
static_assert(offsetof(UWBP_ColorProperty_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ColorProperty_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, AlphaSlider) == 0x000288, "Member 'UWBP_ColorProperty_C::AlphaSlider' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, ColorBorder) == 0x000290, "Member 'UWBP_ColorProperty_C::ColorBorder' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, ColorNameTextBlock) == 0x000298, "Member 'UWBP_ColorProperty_C::ColorNameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, ColorPalette) == 0x0002A0, "Member 'UWBP_ColorProperty_C::ColorPalette' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, ColorWheel) == 0x0002A8, "Member 'UWBP_ColorProperty_C::ColorWheel' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, DisplayModeButton) == 0x0002B0, "Member 'UWBP_ColorProperty_C::DisplayModeButton' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, DisplayModeTextBlock) == 0x0002B8, "Member 'UWBP_ColorProperty_C::DisplayModeTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, HexTextBox) == 0x0002C0, "Member 'UWBP_ColorProperty_C::HexTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, HueSlider) == 0x0002C8, "Member 'UWBP_ColorProperty_C::HueSlider' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, SaturationSlider) == 0x0002D0, "Member 'UWBP_ColorProperty_C::SaturationSlider' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, ValueSlider) == 0x0002D8, "Member 'UWBP_ColorProperty_C::ValueSlider' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, CurrentColor) == 0x0002E0, "Member 'UWBP_ColorProperty_C::CurrentColor' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, CurrentColorHSV) == 0x0002F0, "Member 'UWBP_ColorProperty_C::CurrentColorHSV' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, LastUpdatedValue) == 0x000300, "Member 'UWBP_ColorProperty_C::LastUpdatedValue' has a wrong offset!");
static_assert(offsetof(UWBP_ColorProperty_C, bInitializedColor) == 0x000304, "Member 'UWBP_ColorProperty_C::bInitializedColor' has a wrong offset!");

}

