#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputAction

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputAction.WBP_InputAction_C.ExecuteUbergraph_WBP_InputAction
// 0x0020 (0x0020 - 0x0000)
struct WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_4;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            Temp_byte_Variable_5;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle_1;         // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState_1;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInCanBeRebound;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionListMode                          K2Node_Event_NewMode;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            K2Node_Select_Default_2;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction) == 0x000004, "Wrong alignment on WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction");
static_assert(sizeof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction) == 0x000020, "Wrong size on WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, EntryPoint) == 0x000000, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_byte_Variable) == 0x000004, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_bool_Variable) == 0x000006, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_byte_Variable_3) == 0x000008, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_bool_Variable_1) == 0x000009, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_byte_Variable_4) == 0x00000A, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_byte_Variable_5) == 0x00000B, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_bool_Variable_2) == 0x00000C, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_byte_Variable_6) == 0x00000D, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_byte_Variable_7) == 0x00000E, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_ComponentBoundEvent_InColorStyle_1) == 0x00000F, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_ComponentBoundEvent_InColorStyle_1' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_ComponentBoundEvent_InContentStyleState_1) == 0x000010, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_ComponentBoundEvent_InContentStyleState_1' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_ComponentBoundEvent_InColorStyle) == 0x000011, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_ComponentBoundEvent_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_ComponentBoundEvent_InContentStyleState) == 0x000012, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_ComponentBoundEvent_InContentStyleState' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_Event_bInCanBeRebound) == 0x000013, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_Event_bInCanBeRebound' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_Event_NewMode) == 0x000014, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_Event_NewMode' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000015, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000016, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_Select_Default) == 0x000017, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_Select_Default_1) == 0x000018, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_Select_Default_2) == 0x00001A, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, Temp_bool_Variable_3) == 0x00001B, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction, K2Node_Select_Default_3) == 0x00001C, "Member 'WBP_InputAction_C_ExecuteUbergraph_WBP_InputAction::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_InputAction.WBP_InputAction_C.UpdateInputActionListMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputAction_C_UpdateInputActionListMode final
{
public:
	EInputActionListMode                          NewMode;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputAction_C_UpdateInputActionListMode) == 0x000001, "Wrong alignment on WBP_InputAction_C_UpdateInputActionListMode");
static_assert(sizeof(WBP_InputAction_C_UpdateInputActionListMode) == 0x000001, "Wrong size on WBP_InputAction_C_UpdateInputActionListMode");
static_assert(offsetof(WBP_InputAction_C_UpdateInputActionListMode, NewMode) == 0x000000, "Member 'WBP_InputAction_C_UpdateInputActionListMode::NewMode' has a wrong offset!");

// Function WBP_InputAction.WBP_InputAction_C.UpdateCanActionBeRebound
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputAction_C_UpdateCanActionBeRebound final
{
public:
	bool                                          bInCanBeRebound;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_InputAction_C_UpdateCanActionBeRebound) == 0x000001, "Wrong alignment on WBP_InputAction_C_UpdateCanActionBeRebound");
static_assert(sizeof(WBP_InputAction_C_UpdateCanActionBeRebound) == 0x000001, "Wrong size on WBP_InputAction_C_UpdateCanActionBeRebound");
static_assert(offsetof(WBP_InputAction_C_UpdateCanActionBeRebound, bInCanBeRebound) == 0x000000, "Member 'WBP_InputAction_C_UpdateCanActionBeRebound::bInCanBeRebound' has a wrong offset!");

// Function WBP_InputAction.WBP_InputAction_C.BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            InContentStyleState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature");
static_assert(sizeof(WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature) == 0x000002, "Wrong size on WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature");
static_assert(offsetof(WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature, InColorStyle) == 0x000000, "Member 'WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature::InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature, InContentStyleState) == 0x000001, "Member 'WBP_InputAction_C_BndEvt__EditButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature::InContentStyleState' has a wrong offset!");

// Function WBP_InputAction.WBP_InputAction_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            InContentStyleState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature");
static_assert(sizeof(WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature) == 0x000002, "Wrong size on WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature");
static_assert(offsetof(WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature, InColorStyle) == 0x000000, "Member 'WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature::InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature, InContentStyleState) == 0x000001, "Member 'WBP_InputAction_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature::InContentStyleState' has a wrong offset!");

// Function WBP_InputAction.WBP_InputAction_C.GetWidgetToFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_InputAction_C_GetWidgetToFocus final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputAction_C_GetWidgetToFocus) == 0x000008, "Wrong alignment on WBP_InputAction_C_GetWidgetToFocus");
static_assert(sizeof(WBP_InputAction_C_GetWidgetToFocus) == 0x000008, "Wrong size on WBP_InputAction_C_GetWidgetToFocus");
static_assert(offsetof(WBP_InputAction_C_GetWidgetToFocus, ReturnValue) == 0x000000, "Member 'WBP_InputAction_C_GetWidgetToFocus::ReturnValue' has a wrong offset!");

}

