#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputMappings

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputMappings.WBP_InputMappings_C.OnRevertInputPopupClosed
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputMappings_C_OnRevertInputPopupClosed final
{
public:
	EPopupResult                                  Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputMappings_C_OnRevertInputPopupClosed) == 0x000001, "Wrong alignment on WBP_InputMappings_C_OnRevertInputPopupClosed");
static_assert(sizeof(WBP_InputMappings_C_OnRevertInputPopupClosed) == 0x000001, "Wrong size on WBP_InputMappings_C_OnRevertInputPopupClosed");
static_assert(offsetof(WBP_InputMappings_C_OnRevertInputPopupClosed, Result) == 0x000000, "Member 'WBP_InputMappings_C_OnRevertInputPopupClosed::Result' has a wrong offset!");

// Function WBP_InputMappings.WBP_InputMappings_C.ExecuteUbergraph_WBP_InputMappings
// 0x0060 (0x0060 - 0x0000)
struct WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EPopupResult Result)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWidget*                            CallFunc_GetMenuWidget_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupResult                                  K2Node_CustomEvent_Result;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuButtonWidget*                      CallFunc_CreateRevertButton_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBrickGameInstance*                     K2Node_DynamicCast_AsBrick_Game_Instance;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenMessagePopup_ReturnValue;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings) == 0x000008, "Wrong alignment on WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings");
static_assert(sizeof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings) == 0x000060, "Wrong size on WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, EntryPoint) == 0x000000, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, CallFunc_GetMenuWidget_ReturnValue) == 0x000028, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, K2Node_CustomEvent_Result) == 0x000030, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, CallFunc_CreateRevertButton_ReturnValue) == 0x000038, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::CallFunc_CreateRevertButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, K2Node_DynamicCast_AsBrick_Game_Instance) == 0x000050, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::K2Node_DynamicCast_AsBrick_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings, CallFunc_OpenMessagePopup_ReturnValue) == 0x000059, "Member 'WBP_InputMappings_C_ExecuteUbergraph_WBP_InputMappings::CallFunc_OpenMessagePopup_ReturnValue' has a wrong offset!");

}

