#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerBrowser.WBP_ServerBrowser_C
// 0x0018 (0x02C0 - 0x02A8)
class UWBP_ServerBrowser_C final : public UServerBrowserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMenuButtonWidget*                      RefreshButton;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      JoinButton;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ServerBrowser(int32 EntryPoint);
	void UpdateCanJoin(bool bCanJoin);
	void UpdateCanRefresh(bool bCanRefresh);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerBrowser_C">();
	}
	static class UWBP_ServerBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerBrowser_C>();
	}
};
static_assert(alignof(UWBP_ServerBrowser_C) == 0x000008, "Wrong alignment on UWBP_ServerBrowser_C");
static_assert(sizeof(UWBP_ServerBrowser_C) == 0x0002C0, "Wrong size on UWBP_ServerBrowser_C");
static_assert(offsetof(UWBP_ServerBrowser_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_ServerBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_C, RefreshButton) == 0x0002B0, "Member 'UWBP_ServerBrowser_C::RefreshButton' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_C, JoinButton) == 0x0002B8, "Member 'UWBP_ServerBrowser_C::JoinButton' has a wrong offset!");

}

