#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PagedListHeaderField

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PagedListHeaderField.WBP_PagedListHeaderField_C
// 0x0018 (0x0278 - 0x0260)
class UWBP_PagedListHeaderField_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           Border;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TextBlock;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PagedListHeaderField(int32 EntryPoint);
	void UpdateItem(bool bNewVisible, const class FText& NewText, EBrickUIColorStyle NewColorStyle, EBrickUITextStyle NewTextStyle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PagedListHeaderField_C">();
	}
	static class UWBP_PagedListHeaderField_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PagedListHeaderField_C>();
	}
};
static_assert(alignof(UWBP_PagedListHeaderField_C) == 0x000008, "Wrong alignment on UWBP_PagedListHeaderField_C");
static_assert(sizeof(UWBP_PagedListHeaderField_C) == 0x000278, "Wrong size on UWBP_PagedListHeaderField_C");
static_assert(offsetof(UWBP_PagedListHeaderField_C, UberGraphFrame) == 0x000260, "Member 'UWBP_PagedListHeaderField_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PagedListHeaderField_C, Border) == 0x000268, "Member 'UWBP_PagedListHeaderField_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_PagedListHeaderField_C, TextBlock) == 0x000270, "Member 'UWBP_PagedListHeaderField_C::TextBlock' has a wrong offset!");

}

