#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DashboardSlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DashboardSlider.WBP_DashboardSlider_C
// 0x0018 (0x0288 - 0x0270)
class UWBP_DashboardSlider_C final : public UDashboardSliderWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           IconBorder;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickImage*                            IconImage;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateIcon(int32 IconIndex);
	void UpdateColorStyle(EBrickUIColorStyle NewStyle);
	void ExecuteUbergraph_WBP_DashboardSlider(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DashboardSlider_C">();
	}
	static class UWBP_DashboardSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DashboardSlider_C>();
	}
};
static_assert(alignof(UWBP_DashboardSlider_C) == 0x000008, "Wrong alignment on UWBP_DashboardSlider_C");
static_assert(sizeof(UWBP_DashboardSlider_C) == 0x000288, "Wrong size on UWBP_DashboardSlider_C");
static_assert(offsetof(UWBP_DashboardSlider_C, UberGraphFrame) == 0x000270, "Member 'UWBP_DashboardSlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DashboardSlider_C, IconBorder) == 0x000278, "Member 'UWBP_DashboardSlider_C::IconBorder' has a wrong offset!");
static_assert(offsetof(UWBP_DashboardSlider_C, IconImage) == 0x000280, "Member 'UWBP_DashboardSlider_C::IconImage' has a wrong offset!");

}

