#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ColorProperty

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ColorProperty.WBP_ColorProperty_C.ExecuteUbergraph_WBP_ColorProperty
// 0x06C0 (0x06C0 - 0x0000)
struct WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	EColorDisplayMode                             Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_2;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_3;                              // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_4;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_5;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_6;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_7;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_8;                              // 0x004C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_9;                              // 0x004D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const EColorDisplayMode NewDisplayMode)> K2Node_CreateDelegate_OutputDelegate;    // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_RGBLinearToHSV_ReturnValue;               // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_1;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A8(0x0018)()
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_2;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_2;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_12;                             // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_13;                             // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00D0(0x0018)()
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_3;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_3;        // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENumericValueType                             K2Node_Select_Default;                             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0100(0x0018)()
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_4;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_4;        // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_5;                             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENumericValueType                             K2Node_Select_Default_1;                           // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_14;                             // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0130(0x0018)()
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_5;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_5;        // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0158(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0170(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0188(0x0040)(HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0018)()
	ENumericValueType                             K2Node_Select_Default_5;                           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_15;                             // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_6;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_6;        // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_6;                           // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_7;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             K2Node_Select_Default_7;                           // 0x0218(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_7;        // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0220(0x0018)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0248(0x0018)()
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_8;            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_8;        // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x0270(0x0018)()
	EColorDisplayMode                             Temp_byte_Variable_16;                             // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_8;                           // 0x0290(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02A8(0x0040)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_9;                           // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02F8(0x0010)(ReferenceParm)
	float                                         CallFunc_BreakColor_R;                             // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0318(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0330(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_17;                             // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B[0x1];                                      // 0x034B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_10;                          // 0x034C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENumericValueType                             K2Node_Select_Default_11;                          // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_6;                             // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_9;            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_9;        // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_12;                          // 0x0384(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_13;                          // 0x0394(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_2;                           // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_2;                           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_2;                           // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_2;                           // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_3;                           // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_3;                           // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_3;                           // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_3;                           // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_18;                             // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_6;                              // 0x03D0(0x0018)()
	float                                         K2Node_Select_Default_14;                          // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_10;           // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPropertyContainerWidget*               CallFunc_GetPropertyContainerWidget_ReturnValue;   // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_10;       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuButtonPanelWidget*                 CallFunc_GetMenuButtonPanelWidget_ReturnValue;     // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0414(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuButtonWidget*                      CallFunc_CreateDisplayModeButton_ReturnValue;      // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_11;           // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_12;           // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_13;           // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_11;       // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_452[0x6];                                      // 0x0452(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_7;                              // 0x0458(0x0018)()
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor_1;             // 0x0470(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_6;            // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor;               // 0x0484(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_5;            // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R_4;                           // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_4;                           // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_4;                           // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_4;                           // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_3;                // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_4;            // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_3;            // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x04B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x04C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_2;            // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_1;            // 0x04E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5[0x3];                                      // 0x04E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x04E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_NewText;                // 0x0508(0x0018)(ConstParm)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType;              // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             K2Node_CustomEvent_NewDisplayMode;                 // 0x0521(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_523[0x5];                                      // 0x0523(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0528(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HexToColor_ReturnValue;                   // 0x0538(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_19;                             // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_15;                          // 0x0550(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0568(0x0040)(HasGetValueTypeHash)
	struct FColor                                 K2Node_Event_NewColor;                             // 0x05A8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bValueChanged;                        // 0x05AC(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AD[0x3];                                      // 0x05AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x05B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x05C8(0x0018)()
	bool                                          CallFunc_HasAlphaChannel_ReturnValue;              // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_16;                          // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             Temp_byte_Variable_20;                             // 0x05E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E3[0x5];                                      // 0x05E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_14;           // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_17;                          // 0x05F0(0x0018)()
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_12;       // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0610(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_651[0x7];                                      // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0658(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0668(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrickUserSettings*                     CallFunc_GetUserSettings_ReturnValue_15;           // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorDisplayMode                             CallFunc_GetColorDisplayMode_ReturnValue_13;       // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0692(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0693(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0695(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0696(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_697[0x1];                                      // 0x0697(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R_5;                           // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_5;                           // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_5;                           // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_5;                           // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A9[0x3];                                      // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_4;                  // 0x06AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x06BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x06BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x06BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x06BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty) == 0x000008, "Wrong alignment on WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty");
static_assert(sizeof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty) == 0x0006C0, "Wrong size on WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, EntryPoint) == 0x000000, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable) == 0x000004, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_text_Variable) == 0x000008, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_text_Variable_1) == 0x000020, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_1) == 0x000038, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_float_Variable) == 0x00003C, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_float_Variable_1) == 0x000040, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_2) == 0x000044, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralByte_ReturnValue) == 0x000045, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000046, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_3) == 0x000047, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_4) == 0x000048, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_5) == 0x000049, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_6) == 0x00004A, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_7) == 0x00004B, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_8) == 0x00004C, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_9) == 0x00004D, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_bool_Variable) == 0x00004E, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_10) == 0x000060, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_11) == 0x000061, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_RGBLinearToHSV_ReturnValue) == 0x000064, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_RGBLinearToHSV_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000074, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000084, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue) == 0x000088, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue) == 0x000090, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000091, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000092, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue_1) == 0x000098, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue_1) == 0x0000A0, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralText_ReturnValue) == 0x0000A8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue_2) == 0x0000C0, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0000C8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue_2) == 0x0000C9, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_12) == 0x0000CA, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_13) == 0x0000CB, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000D0, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue_3) == 0x0000E8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_float_Variable_2) == 0x0000F0, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue_3) == 0x0000F4, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_float_Variable_3) == 0x0000F8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default) == 0x0000FC, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000100, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue_4) == 0x000118, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_float_Variable_4) == 0x000120, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue_4) == 0x000124, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_float_Variable_5) == 0x000128, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_1) == 0x00012C, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_14) == 0x00012D, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000130, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue_5) == 0x000148, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_2) == 0x000150, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue_5) == 0x000154, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_text_Variable_2) == 0x000158, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_3) == 0x000170, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_MakeStruct_FormatArgumentData) == 0x000188, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_4) == 0x0001C8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_MakeArray_Array) == 0x0001D0, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_Format_ReturnValue) == 0x0001E0, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_5) == 0x0001F8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_15) == 0x0001F9, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue_6) == 0x000200, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue_6) == 0x000208, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_6) == 0x00020C, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue_7) == 0x000210, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_7) == 0x000218, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue_7) == 0x000219, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_text_Variable_3) == 0x000220, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000238, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_Conv_StringToText_ReturnValue) == 0x000248, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetUserSettings_ReturnValue_8) == 0x000260, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_GetColorDisplayMode_ReturnValue_8) == 0x000268, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_GetColorDisplayMode_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_text_Variable_4) == 0x000270, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, Temp_byte_Variable_16) == 0x000288, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_8) == 0x000290, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002A8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_Select_Default_9) == 0x0002E8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, K2Node_MakeArray_Array_1) == 0x0002F8, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty, CallFunc_BreakColor_R) == 0x000308, "Member 'WBP_ColorProperty_C_ExecuteUbergraph_WBP_ColorProperty::CallFunc_BreakColor_R' has a wrong offset!");
