#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tooltip

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_Tooltip.WBP_Tooltip_C.ExecuteUbergraph_WBP_Tooltip
// 0x0058 (0x0058 - 0x0000)
struct WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTooltipContent                        K2Node_Event_InContent;                            // 0x0010(0x0040)(ConstParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip) == 0x000008, "Wrong alignment on WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip");
static_assert(sizeof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip) == 0x000058, "Wrong size on WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, EntryPoint) == 0x000000, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_bool_Variable) == 0x000004, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_byte_Variable) == 0x000005, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_bool_Variable_2) == 0x00000A, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_byte_Variable_4) == 0x00000B, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, Temp_byte_Variable_5) == 0x00000C, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, K2Node_Event_InContent) == 0x000010, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::K2Node_Event_InContent' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000050, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, CallFunc_TextIsEmpty_ReturnValue) == 0x000051, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, K2Node_Select_Default) == 0x000052, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, K2Node_Select_Default_1) == 0x000053, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, CallFunc_BooleanAND_ReturnValue) == 0x000054, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip, K2Node_Select_Default_2) == 0x000055, "Member 'WBP_Tooltip_C_ExecuteUbergraph_WBP_Tooltip::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_Tooltip.WBP_Tooltip_C.UpdateTooltipContent
// 0x0040 (0x0040 - 0x0000)
struct WBP_Tooltip_C_UpdateTooltipContent final
{
public:
	struct FTooltipContent                        InContent;                                         // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Tooltip_C_UpdateTooltipContent) == 0x000008, "Wrong alignment on WBP_Tooltip_C_UpdateTooltipContent");
static_assert(sizeof(WBP_Tooltip_C_UpdateTooltipContent) == 0x000040, "Wrong size on WBP_Tooltip_C_UpdateTooltipContent");
static_assert(offsetof(WBP_Tooltip_C_UpdateTooltipContent, InContent) == 0x000000, "Member 'WBP_Tooltip_C_UpdateTooltipContent::InContent' has a wrong offset!");

}

