#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchMenu.WBP_MatchMenu_C
// 0x0020 (0x0298 - 0x0278)
class UWBP_MatchMenu_C final : public UMatchMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_AdminLogin_C*                      WBP_AdminLogin;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButtonWidget*                      RestartButton;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPopupHandle                           ExitPopupHandle;                                   // 0x0290(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void OnClickedRestart();
	void OnConfirmRestartPopupClosed(EPopupResult Result);
	void UpdateCanApplyMatchSettings(bool bCanApply);
	void UpdateRestartMatchButton(bool bCanRestart, bool bSameLevelAndMode);
	void ExecuteUbergraph_WBP_MatchMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MatchMenu_C">();
	}
	static class UWBP_MatchMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchMenu_C>();
	}
};
static_assert(alignof(UWBP_MatchMenu_C) == 0x000008, "Wrong alignment on UWBP_MatchMenu_C");
static_assert(sizeof(UWBP_MatchMenu_C) == 0x000298, "Wrong size on UWBP_MatchMenu_C");
static_assert(offsetof(UWBP_MatchMenu_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MatchMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MatchMenu_C, WBP_AdminLogin) == 0x000280, "Member 'UWBP_MatchMenu_C::WBP_AdminLogin' has a wrong offset!");
static_assert(offsetof(UWBP_MatchMenu_C, RestartButton) == 0x000288, "Member 'UWBP_MatchMenu_C::RestartButton' has a wrong offset!");
static_assert(offsetof(UWBP_MatchMenu_C, ExitPopupHandle) == 0x000290, "Member 'UWBP_MatchMenu_C::ExitPopupHandle' has a wrong offset!");

}

