#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreboardPlayer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScoreboardPlayer.WBP_ScoreboardPlayer_C.ExecuteUbergraph_WBP_ScoreboardPlayer
// 0x0018 (0x0018 - 0x0000)
struct WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewSelected;                         // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsLocalPlayer;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETeamAttitude                                 K2Node_Event_TeamAttitude;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsAdmin;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsAlive;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer) == 0x000004, "Wrong alignment on WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer");
static_assert(sizeof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer) == 0x000018, "Wrong size on WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, EntryPoint) == 0x000000, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_bool_Variable) == 0x000004, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_byte_Variable) == 0x000005, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_bool_Variable_2) == 0x00000A, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_byte_Variable_4) == 0x00000B, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, Temp_byte_Variable_5) == 0x00000C, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_ComponentBoundEvent_InColorStyle) == 0x00000D, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_ComponentBoundEvent_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_ComponentBoundEvent_InContentStyleState) == 0x00000E, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_ComponentBoundEvent_InContentStyleState' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Event_bNewSelected) == 0x00000F, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Event_bNewSelected' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Event_bIsLocalPlayer) == 0x000010, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Event_bIsLocalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Event_TeamAttitude) == 0x000011, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Event_TeamAttitude' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Select_Default) == 0x000012, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Event_IsDesignTime) == 0x000013, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Event_bIsAdmin) == 0x000014, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Event_bIsAdmin' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Select_Default_1) == 0x000015, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Event_bIsAlive) == 0x000016, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Event_bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer, K2Node_Select_Default_2) == 0x000017, "Member 'WBP_ScoreboardPlayer_C_ExecuteUbergraph_WBP_ScoreboardPlayer::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_ScoreboardPlayer.WBP_ScoreboardPlayer_C.UpdateIsAlive
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreboardPlayer_C_UpdateIsAlive final
{
public:
	bool                                          bIsAlive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScoreboardPlayer_C_UpdateIsAlive) == 0x000001, "Wrong alignment on WBP_ScoreboardPlayer_C_UpdateIsAlive");
static_assert(sizeof(WBP_ScoreboardPlayer_C_UpdateIsAlive) == 0x000001, "Wrong size on WBP_ScoreboardPlayer_C_UpdateIsAlive");
static_assert(offsetof(WBP_ScoreboardPlayer_C_UpdateIsAlive, bIsAlive) == 0x000000, "Member 'WBP_ScoreboardPlayer_C_UpdateIsAlive::bIsAlive' has a wrong offset!");

// Function WBP_ScoreboardPlayer.WBP_ScoreboardPlayer_C.UpdateIsAdmin
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreboardPlayer_C_UpdateIsAdmin final
{
public:
	bool                                          bIsAdmin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScoreboardPlayer_C_UpdateIsAdmin) == 0x000001, "Wrong alignment on WBP_ScoreboardPlayer_C_UpdateIsAdmin");
static_assert(sizeof(WBP_ScoreboardPlayer_C_UpdateIsAdmin) == 0x000001, "Wrong size on WBP_ScoreboardPlayer_C_UpdateIsAdmin");
static_assert(offsetof(WBP_ScoreboardPlayer_C_UpdateIsAdmin, bIsAdmin) == 0x000000, "Member 'WBP_ScoreboardPlayer_C_UpdateIsAdmin::bIsAdmin' has a wrong offset!");

// Function WBP_ScoreboardPlayer.WBP_ScoreboardPlayer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScoreboardPlayer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScoreboardPlayer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ScoreboardPlayer_C_PreConstruct");
static_assert(sizeof(WBP_ScoreboardPlayer_C_PreConstruct) == 0x000001, "Wrong size on WBP_ScoreboardPlayer_C_PreConstruct");
static_assert(offsetof(WBP_ScoreboardPlayer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ScoreboardPlayer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ScoreboardPlayer.WBP_ScoreboardPlayer_C.UpdateButtonStyle
// 0x0003 (0x0003 - 0x0000)
struct WBP_ScoreboardPlayer_C_UpdateButtonStyle final
{
public:
	bool                                          bNewSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsLocalPlayer;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ETeamAttitude                                 TeamAttitude;                                      // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreboardPlayer_C_UpdateButtonStyle) == 0x000001, "Wrong alignment on WBP_ScoreboardPlayer_C_UpdateButtonStyle");
static_assert(sizeof(WBP_ScoreboardPlayer_C_UpdateButtonStyle) == 0x000003, "Wrong size on WBP_ScoreboardPlayer_C_UpdateButtonStyle");
static_assert(offsetof(WBP_ScoreboardPlayer_C_UpdateButtonStyle, bNewSelected) == 0x000000, "Member 'WBP_ScoreboardPlayer_C_UpdateButtonStyle::bNewSelected' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_UpdateButtonStyle, bIsLocalPlayer) == 0x000001, "Member 'WBP_ScoreboardPlayer_C_UpdateButtonStyle::bIsLocalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_UpdateButtonStyle, TeamAttitude) == 0x000002, "Member 'WBP_ScoreboardPlayer_C_UpdateButtonStyle::TeamAttitude' has a wrong offset!");

// Function WBP_ScoreboardPlayer.WBP_ScoreboardPlayer_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            InContentStyleState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature");
static_assert(sizeof(WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature) == 0x000002, "Wrong size on WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature");
static_assert(offsetof(WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature, InColorStyle) == 0x000000, "Member 'WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature::InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature, InContentStyleState) == 0x000001, "Member 'WBP_ScoreboardPlayer_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature::InContentStyleState' has a wrong offset!");

}

