#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UGCTaskPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UGCTaskPopup.WBP_UGCTaskPopup_C
// 0x0018 (0x02E0 - 0x02C8)
class UWBP_UGCTaskPopup_C final : public UUGCTaskPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BrickSliderReadOnly_C*             Slider;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuButtonWidget*                      ConfirmButton;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UGCTaskPopup(int32 EntryPoint);
	void UpdateIsFinished(bool bNewFinished, bool bNewSuccess);
	void Construct();
	void UpdateProgress(float NewProgress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UGCTaskPopup_C">();
	}
	static class UWBP_UGCTaskPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UGCTaskPopup_C>();
	}
};
static_assert(alignof(UWBP_UGCTaskPopup_C) == 0x000008, "Wrong alignment on UWBP_UGCTaskPopup_C");
static_assert(sizeof(UWBP_UGCTaskPopup_C) == 0x0002E0, "Wrong size on UWBP_UGCTaskPopup_C");
static_assert(offsetof(UWBP_UGCTaskPopup_C, UberGraphFrame) == 0x0002C8, "Member 'UWBP_UGCTaskPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UGCTaskPopup_C, Slider) == 0x0002D0, "Member 'UWBP_UGCTaskPopup_C::Slider' has a wrong offset!");
static_assert(offsetof(UWBP_UGCTaskPopup_C, ConfirmButton) == 0x0002D8, "Member 'UWBP_UGCTaskPopup_C::ConfirmButton' has a wrong offset!");

}

