#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Map

#include "Basic.hpp"

#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Map.WBP_Map_C
// 0x0018 (0x0498 - 0x0480)
class UWBP_Map_C final : public UMapWidget
{
public:
	class UBrickImage*                            BackgroundImage;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickImage*                            BrickImage_85;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickImage*                            BrickImage_140;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddGameOverlayWidget(class UGameOverlayWidget* Widget);

	class UMaterialInstanceDynamic* CreateMapMID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Map_C">();
	}
	static class UWBP_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Map_C>();
	}
};
static_assert(alignof(UWBP_Map_C) == 0x000008, "Wrong alignment on UWBP_Map_C");
static_assert(sizeof(UWBP_Map_C) == 0x000498, "Wrong size on UWBP_Map_C");
static_assert(offsetof(UWBP_Map_C, BackgroundImage) == 0x000480, "Member 'UWBP_Map_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, BrickImage_85) == 0x000488, "Member 'UWBP_Map_C::BrickImage_85' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, BrickImage_140) == 0x000490, "Member 'UWBP_Map_C::BrickImage_140' has a wrong offset!");

}

