#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BrickComboBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BrickComboBox.WBP_BrickComboBox_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_BrickComboBox_C final : public UBrickComboBoxWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickImage*                            ArrowImage;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             ButtonPanel;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BrickComboBox(int32 EntryPoint);
	void UpdateUseItemList(bool bInUseItemList);
	void AddSelectedItemWidget(class UBrickComboBoxItemWidget* Widget);
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InContentStyleState);
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BrickComboBox_C">();
	}
	static class UWBP_BrickComboBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BrickComboBox_C>();
	}
};
static_assert(alignof(UWBP_BrickComboBox_C) == 0x000008, "Wrong alignment on UWBP_BrickComboBox_C");
static_assert(sizeof(UWBP_BrickComboBox_C) == 0x000308, "Wrong size on UWBP_BrickComboBox_C");
static_assert(offsetof(UWBP_BrickComboBox_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_BrickComboBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BrickComboBox_C, ArrowImage) == 0x0002F8, "Member 'UWBP_BrickComboBox_C::ArrowImage' has a wrong offset!");
static_assert(offsetof(UWBP_BrickComboBox_C, ButtonPanel) == 0x000300, "Member 'UWBP_BrickComboBox_C::ButtonPanel' has a wrong offset!");

}

