#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlacableObject

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlacableObject.WBP_PlacableObject_C.OnMouseButtonUp
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_PlacableObject_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0160(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0178(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0238(0x00B8)()
};
static_assert(alignof(WBP_PlacableObject_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on WBP_PlacableObject_C_OnMouseButtonUp");
static_assert(sizeof(WBP_PlacableObject_C_OnMouseButtonUp) == 0x0002F0, "Wrong size on WBP_PlacableObject_C_OnMouseButtonUp");
static_assert(offsetof(WBP_PlacableObject_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'WBP_PlacableObject_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'WBP_PlacableObject_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'WBP_PlacableObject_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_OnMouseButtonUp, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000160, "Member 'WBP_PlacableObject_C_OnMouseButtonUp::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_OnMouseButtonUp, CallFunc_Unhandled_ReturnValue) == 0x000178, "Member 'WBP_PlacableObject_C_OnMouseButtonUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_OnMouseButtonUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000230, "Member 'WBP_PlacableObject_C_OnMouseButtonUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000238, "Member 'WBP_PlacableObject_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_PlacableObject.WBP_PlacableObject_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            InContentStyleState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature");
static_assert(sizeof(WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature) == 0x000002, "Wrong size on WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature");
static_assert(offsetof(WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature, InColorStyle) == 0x000000, "Member 'WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature::InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature, InContentStyleState) == 0x000001, "Member 'WBP_PlacableObject_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature::InContentStyleState' has a wrong offset!");

// Function WBP_PlacableObject.WBP_PlacableObject_C.UpdateIsFilterWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlacableObject_C_UpdateIsFilterWidget final
{
public:
	bool                                          bNewIsFilter;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlacableObject_C_UpdateIsFilterWidget) == 0x000001, "Wrong alignment on WBP_PlacableObject_C_UpdateIsFilterWidget");
static_assert(sizeof(WBP_PlacableObject_C_UpdateIsFilterWidget) == 0x000001, "Wrong size on WBP_PlacableObject_C_UpdateIsFilterWidget");
static_assert(offsetof(WBP_PlacableObject_C_UpdateIsFilterWidget, bNewIsFilter) == 0x000000, "Member 'WBP_PlacableObject_C_UpdateIsFilterWidget::bNewIsFilter' has a wrong offset!");

// Function WBP_PlacableObject.WBP_PlacableObject_C.ExecuteUbergraph_WBP_PlacableObject
// 0x000C (0x000C - 0x0000)
struct WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIBrushStyle                            Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIBrushStyle                            Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewIsFilter;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIBrushStyle                            K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject) == 0x000004, "Wrong alignment on WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject");
static_assert(sizeof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject) == 0x00000C, "Wrong size on WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, EntryPoint) == 0x000000, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, Temp_bool_Variable) == 0x000004, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, Temp_byte_Variable) == 0x000005, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, K2Node_ComponentBoundEvent_InColorStyle) == 0x000007, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::K2Node_ComponentBoundEvent_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, K2Node_ComponentBoundEvent_InContentStyleState) == 0x000008, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::K2Node_ComponentBoundEvent_InContentStyleState' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, K2Node_Event_bNewIsFilter) == 0x000009, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::K2Node_Event_bNewIsFilter' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject, K2Node_Select_Default) == 0x00000B, "Member 'WBP_PlacableObject_C_ExecuteUbergraph_WBP_PlacableObject::K2Node_Select_Default' has a wrong offset!");

}

