#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConnectorSpacingProperty

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ConnectorSpacingProperty.WBP_ConnectorSpacingProperty_C.ExecuteUbergraph_WBP_ConnectorSpacingProperty
// 0x0098 (0x0098 - 0x0000)
struct WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFluAxisSigned Axis)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	EAxis                                         CallFunc_IndexToAxis_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFluAxisSigned                                CallFunc_MakeAxisSigned_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFluAxisSigned                                K2Node_CustomEvent_Axis;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x1];                                       // 0x0039(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableBrickConnectorSpacing         K2Node_Event_NewSpacing;                           // 0x003A(0x0002)(ConstParm, NoDestructor)
	uint8                                         K2Node_Event_AxisFlags;                            // 0x003C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BitmaskHasFlag_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RecycleWidget_bOutRecycled;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_RecycleWidget_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ConnectorSpacingAxis_C*            K2Node_DynamicCast_AsWBP_Connector_Spacing_Axis;   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConnectorSpacing                             CallFunc_GetScalableBrickConnectorSpacingAxis_ReturnValue; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConnectorSpacing                             CallFunc_GetScalableBrickConnectorSpacingAxis_ReturnValue_1; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty) == 0x000008, "Wrong alignment on WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty");
static_assert(sizeof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty) == 0x000098, "Wrong size on WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, EntryPoint) == 0x000000, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, Temp_int_Variable) == 0x000008, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, Temp_int_Variable_1) == 0x00001C, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_IndexToAxis_ReturnValue) == 0x000030, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_IndexToAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_MakeAxisSigned_ReturnValue) == 0x000031, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_MakeAxisSigned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000032, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, K2Node_CustomEvent_Axis) == 0x000038, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::K2Node_CustomEvent_Axis' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, K2Node_Event_NewSpacing) == 0x00003A, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::K2Node_Event_NewSpacing' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, K2Node_Event_AxisFlags) == 0x00003C, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::K2Node_Event_AxisFlags' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000040, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_BitmaskHasFlag_ReturnValue) == 0x000044, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_BitmaskHasFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, Temp_int_Variable_2) == 0x000048, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_RecycleWidget_bOutRecycled) == 0x00004C, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_RecycleWidget_bOutRecycled' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_RecycleWidget_ReturnValue) == 0x000050, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_RecycleWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, K2Node_DynamicCast_AsWBP_Connector_Spacing_Axis) == 0x000060, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::K2Node_DynamicCast_AsWBP_Connector_Spacing_Axis' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Percent_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_GetScalableBrickConnectorSpacingAxis_ReturnValue) == 0x000070, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_GetScalableBrickConnectorSpacingAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Divide_IntInt_ReturnValue) == 0x000074, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_AddChildToGrid_ReturnValue) == 0x000078, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_GetScalableBrickConnectorSpacingAxis_ReturnValue_1) == 0x000080, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_GetScalableBrickConnectorSpacingAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000084, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Add_IntInt_ReturnValue_3) == 0x000088, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Percent_IntInt_ReturnValue_1) == 0x00008C, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_Conv_IntToByte_ReturnValue) == 0x000090, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty, CallFunc_GetValidValue_ReturnValue) == 0x000091, "Member 'WBP_ConnectorSpacingProperty_C_ExecuteUbergraph_WBP_ConnectorSpacingProperty::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function WBP_ConnectorSpacingProperty.WBP_ConnectorSpacingProperty_C.UpdateConnectorSpacing
// 0x0004 (0x0004 - 0x0000)
struct WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing final
{
public:
	struct FScalableBrickConnectorSpacing         NewSpacing;                                        // 0x0000(0x0002)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	uint8                                         AxisFlags;                                         // 0x0002(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing) == 0x000002, "Wrong alignment on WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing");
static_assert(sizeof(WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing) == 0x000004, "Wrong size on WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing, NewSpacing) == 0x000000, "Member 'WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing::NewSpacing' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing, AxisFlags) == 0x000002, "Member 'WBP_ConnectorSpacingProperty_C_UpdateConnectorSpacing::AxisFlags' has a wrong offset!");

// Function WBP_ConnectorSpacingProperty.WBP_ConnectorSpacingProperty_C.OnAxisClicked
// 0x0001 (0x0001 - 0x0000)
struct WBP_ConnectorSpacingProperty_C_OnAxisClicked final
{
public:
	EFluAxisSigned                                Axis;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConnectorSpacingProperty_C_OnAxisClicked) == 0x000001, "Wrong alignment on WBP_ConnectorSpacingProperty_C_OnAxisClicked");
static_assert(sizeof(WBP_ConnectorSpacingProperty_C_OnAxisClicked) == 0x000001, "Wrong size on WBP_ConnectorSpacingProperty_C_OnAxisClicked");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_OnAxisClicked, Axis) == 0x000000, "Member 'WBP_ConnectorSpacingProperty_C_OnAxisClicked::Axis' has a wrong offset!");

// Function WBP_ConnectorSpacingProperty.WBP_ConnectorSpacingProperty_C.GetFocusedSubProperty
// 0x0030 (0x0030 - 0x0000)
struct WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty final
{
public:
	struct FWidgetPathWrapper                     WidgetPath;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class FName                                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_FindFirstWidgetInWidgetPath_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ConnectorSpacingAxis_C*            K2Node_DynamicCast_AsWBP_Connector_Spacing_Axis;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty) == 0x000008, "Wrong alignment on WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty");
static_assert(sizeof(WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty) == 0x000030, "Wrong size on WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty, WidgetPath) == 0x000000, "Member 'WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty::WidgetPath' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty, ReturnValue) == 0x000008, "Member 'WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty, CallFunc_FindFirstWidgetInWidgetPath_ReturnValue) == 0x000010, "Member 'WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty::CallFunc_FindFirstWidgetInWidgetPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty, K2Node_DynamicCast_AsWBP_Connector_Spacing_Axis) == 0x000018, "Member 'WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty::K2Node_DynamicCast_AsWBP_Connector_Spacing_Axis' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty, CallFunc_GetEnumeratorName_ReturnValue) == 0x000024, "Member 'WBP_ConnectorSpacingProperty_C_GetFocusedSubProperty::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");

}

