#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchTimer.WBP_MatchTimer_C
// 0x0018 (0x0278 - 0x0260)
class UWBP_MatchTimer_C final : public UMatchTimerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           Border;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TextBlock;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MatchTimer(int32 EntryPoint);
	void UpdateTimer(int32 NewTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MatchTimer_C">();
	}
	static class UWBP_MatchTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchTimer_C>();
	}
};
static_assert(alignof(UWBP_MatchTimer_C) == 0x000008, "Wrong alignment on UWBP_MatchTimer_C");
static_assert(sizeof(UWBP_MatchTimer_C) == 0x000278, "Wrong size on UWBP_MatchTimer_C");
static_assert(offsetof(UWBP_MatchTimer_C, UberGraphFrame) == 0x000260, "Member 'UWBP_MatchTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MatchTimer_C, Border) == 0x000268, "Member 'UWBP_MatchTimer_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_MatchTimer_C, TextBlock) == 0x000270, "Member 'UWBP_MatchTimer_C::TextBlock' has a wrong offset!");

}

