#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UGCMetaDataPopup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UGCMetaDataPopup.WBP_UGCMetaDataPopup_C.ExecuteUbergraph_WBP_UGCMetaDataPopup
// 0x0020 (0x0020 - 0x0000)
struct WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPopupContainerWidget*                  CallFunc_GetPopupContainer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateConfirmButton_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateCancelButton_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup) == 0x000008, "Wrong alignment on WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup");
static_assert(sizeof(WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup) == 0x000020, "Wrong size on WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup");
static_assert(offsetof(WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup, EntryPoint) == 0x000000, "Member 'WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup, CallFunc_GetPopupContainer_ReturnValue) == 0x000008, "Member 'WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup::CallFunc_GetPopupContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup, CallFunc_CreateConfirmButton_ReturnValue) == 0x000010, "Member 'WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup::CallFunc_CreateConfirmButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup, CallFunc_CreateCancelButton_ReturnValue) == 0x000018, "Member 'WBP_UGCMetaDataPopup_C_ExecuteUbergraph_WBP_UGCMetaDataPopup::CallFunc_CreateCancelButton_ReturnValue' has a wrong offset!");

// Function WBP_UGCMetaDataPopup.WBP_UGCMetaDataPopup_C.GetPopupTitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_UGCMetaDataPopup_C_GetPopupTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_UGCMetaDataPopup_C_GetPopupTitle) == 0x000008, "Wrong alignment on WBP_UGCMetaDataPopup_C_GetPopupTitle");
static_assert(sizeof(WBP_UGCMetaDataPopup_C_GetPopupTitle) == 0x000018, "Wrong size on WBP_UGCMetaDataPopup_C_GetPopupTitle");
static_assert(offsetof(WBP_UGCMetaDataPopup_C_GetPopupTitle, ReturnValue) == 0x000000, "Member 'WBP_UGCMetaDataPopup_C_GetPopupTitle::ReturnValue' has a wrong offset!");

}

