#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputHelp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputHelp.WBP_InputHelp_C
// 0x0018 (0x0290 - 0x0278)
class UWBP_InputHelp_C final : public UInputHelpWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BrickButton_C*                     Button;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControlHint_C*                     ControlHint;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InputHelp(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__WBP_InputHelp_Button_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InContentStyleState);
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void UpdateIsAlwaysOpen(bool bNewAlwaysOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InputHelp_C">();
	}
	static class UWBP_InputHelp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputHelp_C>();
	}
};
static_assert(alignof(UWBP_InputHelp_C) == 0x000008, "Wrong alignment on UWBP_InputHelp_C");
static_assert(sizeof(UWBP_InputHelp_C) == 0x000290, "Wrong size on UWBP_InputHelp_C");
static_assert(offsetof(UWBP_InputHelp_C, UberGraphFrame) == 0x000278, "Member 'UWBP_InputHelp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InputHelp_C, Button) == 0x000280, "Member 'UWBP_InputHelp_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_InputHelp_C, ControlHint) == 0x000288, "Member 'UWBP_InputHelp_C::ControlHint' has a wrong offset!");

}

