#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UnsavedChangesPopup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UnsavedChangesPopup.WBP_UnsavedChangesPopup_C.ExecuteUbergraph_WBP_UnsavedChangesPopup
// 0x0048 (0x0048 - 0x0000)
struct WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPopupContainerWidget*                  CallFunc_GetPopupContainer_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateCancelButton_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateButton_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateButton_ReturnValue_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup) == 0x000008, "Wrong alignment on WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup");
static_assert(sizeof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup) == 0x000048, "Wrong size on WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup");
static_assert(offsetof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup, EntryPoint) == 0x000000, "Member 'WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup, CallFunc_GetPopupContainer_ReturnValue) == 0x000028, "Member 'WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup::CallFunc_GetPopupContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup, CallFunc_CreateCancelButton_ReturnValue) == 0x000030, "Member 'WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup::CallFunc_CreateCancelButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup, CallFunc_CreateButton_ReturnValue) == 0x000038, "Member 'WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup::CallFunc_CreateButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup, CallFunc_CreateButton_ReturnValue_1) == 0x000040, "Member 'WBP_UnsavedChangesPopup_C_ExecuteUbergraph_WBP_UnsavedChangesPopup::CallFunc_CreateButton_ReturnValue_1' has a wrong offset!");

}

