#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UGCTaskPopup

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_UGCTaskPopup.WBP_UGCTaskPopup_C.ExecuteUbergraph_WBP_UGCTaskPopup
// 0x0038 (0x0038 - 0x0000)
struct WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_NewProgress;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPopupContainerWidget*                  CallFunc_GetPopupContainer_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewFinished;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewSuccess;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuButtonWidget*                      CallFunc_CreateConfirmButton_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default_1;                           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPopupContainerWidget*                  CallFunc_GetPopupContainer_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup) == 0x000008, "Wrong alignment on WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup");
static_assert(sizeof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup) == 0x000038, "Wrong size on WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, EntryPoint) == 0x000000, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, Temp_bool_Variable) == 0x000004, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, Temp_byte_Variable) == 0x000005, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, K2Node_Event_NewProgress) == 0x00000C, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::K2Node_Event_NewProgress' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, CallFunc_GetPopupContainer_ReturnValue) == 0x000010, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::CallFunc_GetPopupContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, K2Node_Event_bNewFinished) == 0x000018, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::K2Node_Event_bNewFinished' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, K2Node_Event_bNewSuccess) == 0x000019, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::K2Node_Event_bNewSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, CallFunc_CreateConfirmButton_ReturnValue) == 0x000020, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::CallFunc_CreateConfirmButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, K2Node_Select_Default) == 0x000028, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, K2Node_Select_Default_1) == 0x000029, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup, CallFunc_GetPopupContainer_ReturnValue_1) == 0x000030, "Member 'WBP_UGCTaskPopup_C_ExecuteUbergraph_WBP_UGCTaskPopup::CallFunc_GetPopupContainer_ReturnValue_1' has a wrong offset!");

// Function WBP_UGCTaskPopup.WBP_UGCTaskPopup_C.UpdateIsFinished
// 0x0002 (0x0002 - 0x0000)
struct WBP_UGCTaskPopup_C_UpdateIsFinished final
{
public:
	bool                                          bNewFinished;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNewSuccess;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UGCTaskPopup_C_UpdateIsFinished) == 0x000001, "Wrong alignment on WBP_UGCTaskPopup_C_UpdateIsFinished");
static_assert(sizeof(WBP_UGCTaskPopup_C_UpdateIsFinished) == 0x000002, "Wrong size on WBP_UGCTaskPopup_C_UpdateIsFinished");
static_assert(offsetof(WBP_UGCTaskPopup_C_UpdateIsFinished, bNewFinished) == 0x000000, "Member 'WBP_UGCTaskPopup_C_UpdateIsFinished::bNewFinished' has a wrong offset!");
static_assert(offsetof(WBP_UGCTaskPopup_C_UpdateIsFinished, bNewSuccess) == 0x000001, "Member 'WBP_UGCTaskPopup_C_UpdateIsFinished::bNewSuccess' has a wrong offset!");

// Function WBP_UGCTaskPopup.WBP_UGCTaskPopup_C.UpdateProgress
// 0x0004 (0x0004 - 0x0000)
struct WBP_UGCTaskPopup_C_UpdateProgress final
{
public:
	float                                         NewProgress;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UGCTaskPopup_C_UpdateProgress) == 0x000004, "Wrong alignment on WBP_UGCTaskPopup_C_UpdateProgress");
static_assert(sizeof(WBP_UGCTaskPopup_C_UpdateProgress) == 0x000004, "Wrong size on WBP_UGCTaskPopup_C_UpdateProgress");
static_assert(offsetof(WBP_UGCTaskPopup_C_UpdateProgress, NewProgress) == 0x000000, "Member 'WBP_UGCTaskPopup_C_UpdateProgress::NewProgress' has a wrong offset!");

}

