#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tooltip.WBP_Tooltip_C
// 0x0038 (0x02E8 - 0x02B0)
class UWBP_Tooltip_C final : public UTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           ContentBorder;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControlHint_C*                     ControlHint;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FadingPanel_C*                     FadingPanel;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TextBlock;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickBorder*                           TitleBorder;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TitleTextBlock;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Tooltip(int32 EntryPoint);
	void UpdateTooltipContent(const struct FTooltipContent& InContent);
	void FadeIn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tooltip_C">();
	}
	static class UWBP_Tooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tooltip_C>();
	}
};
static_assert(alignof(UWBP_Tooltip_C) == 0x000008, "Wrong alignment on UWBP_Tooltip_C");
static_assert(sizeof(UWBP_Tooltip_C) == 0x0002E8, "Wrong size on UWBP_Tooltip_C");
static_assert(offsetof(UWBP_Tooltip_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_Tooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_C, ContentBorder) == 0x0002B8, "Member 'UWBP_Tooltip_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_C, ControlHint) == 0x0002C0, "Member 'UWBP_Tooltip_C::ControlHint' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_C, FadingPanel) == 0x0002C8, "Member 'UWBP_Tooltip_C::FadingPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_C, TextBlock) == 0x0002D0, "Member 'UWBP_Tooltip_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_C, TitleBorder) == 0x0002D8, "Member 'UWBP_Tooltip_C::TitleBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Tooltip_C, TitleTextBlock) == 0x0002E0, "Member 'UWBP_Tooltip_C::TitleTextBlock' has a wrong offset!");

}

