#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PopupContainer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PopupContainer.WBP_PopupContainer_C.ExecuteUbergraph_WBP_PopupContainer
// 0x0058 (0x0058 - 0x0000)
struct WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_4;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable_5;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_6;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPopupWidget*                           K2Node_Event_Widget;                               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_NewTitle;                             // 0x0028(0x0018)(ConstParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowContent;                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPopupSizeRule                                K2Node_Event_SizeRule;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            K2Node_Select_Default_1;                           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_2;                           // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            K2Node_Event_InColorStyle;                         // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer) == 0x000008, "Wrong alignment on WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer");
static_assert(sizeof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer) == 0x000058, "Wrong size on WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, EntryPoint) == 0x000000, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_byte_Variable) == 0x000004, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_bool_Variable) == 0x000010, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_byte_Variable_2) == 0x000012, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_bool_Variable_1) == 0x000013, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_byte_Variable_3) == 0x000014, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_byte_Variable_4) == 0x000015, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_bool_Variable_2) == 0x000016, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_byte_Variable_5) == 0x000017, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_byte_Variable_6) == 0x000018, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Event_Widget) == 0x000020, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Event_NewTitle) == 0x000028, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Event_NewTitle' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_TextIsEmpty_ReturnValue) == 0x000048, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Select_Default) == 0x000049, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Event_bShowContent) == 0x00004A, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Event_bShowContent' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Event_SizeRule) == 0x00004B, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Event_SizeRule' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004C, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00004D, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00004E, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_BooleanOR_ReturnValue) == 0x00004F, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000050, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, CallFunc_BooleanOR_ReturnValue_1) == 0x000051, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Select_Default_1) == 0x000052, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Select_Default_2) == 0x000053, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_byte_Variable_7) == 0x000054, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, Temp_bool_Variable_3) == 0x000055, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Event_InColorStyle) == 0x000056, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Event_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer, K2Node_Select_Default_3) == 0x000057, "Member 'WBP_PopupContainer_C_ExecuteUbergraph_WBP_PopupContainer::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_PopupContainer.WBP_PopupContainer_C.UpdateColorStyle
// 0x0001 (0x0001 - 0x0000)
struct WBP_PopupContainer_C_UpdateColorStyle final
{
public:
	EBrickUIColorStyle                            InColorStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupContainer_C_UpdateColorStyle) == 0x000001, "Wrong alignment on WBP_PopupContainer_C_UpdateColorStyle");
static_assert(sizeof(WBP_PopupContainer_C_UpdateColorStyle) == 0x000001, "Wrong size on WBP_PopupContainer_C_UpdateColorStyle");
static_assert(offsetof(WBP_PopupContainer_C_UpdateColorStyle, InColorStyle) == 0x000000, "Member 'WBP_PopupContainer_C_UpdateColorStyle::InColorStyle' has a wrong offset!");

// Function WBP_PopupContainer.WBP_PopupContainer_C.UpdateContentSlot
// 0x0002 (0x0002 - 0x0000)
struct WBP_PopupContainer_C_UpdateContentSlot final
{
public:
	bool                                          bShowContent;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPopupSizeRule                                SizeRule;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupContainer_C_UpdateContentSlot) == 0x000001, "Wrong alignment on WBP_PopupContainer_C_UpdateContentSlot");
static_assert(sizeof(WBP_PopupContainer_C_UpdateContentSlot) == 0x000002, "Wrong size on WBP_PopupContainer_C_UpdateContentSlot");
static_assert(offsetof(WBP_PopupContainer_C_UpdateContentSlot, bShowContent) == 0x000000, "Member 'WBP_PopupContainer_C_UpdateContentSlot::bShowContent' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_UpdateContentSlot, SizeRule) == 0x000001, "Member 'WBP_PopupContainer_C_UpdateContentSlot::SizeRule' has a wrong offset!");

// Function WBP_PopupContainer.WBP_PopupContainer_C.UpdateTitleText
// 0x0018 (0x0018 - 0x0000)
struct WBP_PopupContainer_C_UpdateTitleText final
{
public:
	class FText                                   NewTitle;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PopupContainer_C_UpdateTitleText) == 0x000008, "Wrong alignment on WBP_PopupContainer_C_UpdateTitleText");
static_assert(sizeof(WBP_PopupContainer_C_UpdateTitleText) == 0x000018, "Wrong size on WBP_PopupContainer_C_UpdateTitleText");
static_assert(offsetof(WBP_PopupContainer_C_UpdateTitleText, NewTitle) == 0x000000, "Member 'WBP_PopupContainer_C_UpdateTitleText::NewTitle' has a wrong offset!");

// Function WBP_PopupContainer.WBP_PopupContainer_C.AddPopupWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_PopupContainer_C_AddPopupWidget final
{
public:
	class UPopupWidget*                           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupContainer_C_AddPopupWidget) == 0x000008, "Wrong alignment on WBP_PopupContainer_C_AddPopupWidget");
static_assert(sizeof(WBP_PopupContainer_C_AddPopupWidget) == 0x000008, "Wrong size on WBP_PopupContainer_C_AddPopupWidget");
static_assert(offsetof(WBP_PopupContainer_C_AddPopupWidget, Widget) == 0x000000, "Member 'WBP_PopupContainer_C_AddPopupWidget::Widget' has a wrong offset!");

// Function WBP_PopupContainer.WBP_PopupContainer_C.CreateConfirmButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_PopupContainer_C_CreateConfirmButton final
{
public:
	class UMenuButtonWidget*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UMenuButtonWidget*                      CallFunc_CreateConfirmButton_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupContainer_C_CreateConfirmButton) == 0x000008, "Wrong alignment on WBP_PopupContainer_C_CreateConfirmButton");
static_assert(sizeof(WBP_PopupContainer_C_CreateConfirmButton) == 0x000020, "Wrong size on WBP_PopupContainer_C_CreateConfirmButton");
static_assert(offsetof(WBP_PopupContainer_C_CreateConfirmButton, ReturnValue) == 0x000000, "Member 'WBP_PopupContainer_C_CreateConfirmButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_CreateConfirmButton, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PopupContainer_C_CreateConfirmButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_CreateConfirmButton, CallFunc_CreateConfirmButton_ReturnValue) == 0x000018, "Member 'WBP_PopupContainer_C_CreateConfirmButton::CallFunc_CreateConfirmButton_ReturnValue' has a wrong offset!");

// Function WBP_PopupContainer.WBP_PopupContainer_C.CreateCancelButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_PopupContainer_C_CreateCancelButton final
{
public:
	class UMenuButtonWidget*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UMenuButtonWidget*                      CallFunc_CreateCancelButton_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupContainer_C_CreateCancelButton) == 0x000008, "Wrong alignment on WBP_PopupContainer_C_CreateCancelButton");
static_assert(sizeof(WBP_PopupContainer_C_CreateCancelButton) == 0x000020, "Wrong size on WBP_PopupContainer_C_CreateCancelButton");
static_assert(offsetof(WBP_PopupContainer_C_CreateCancelButton, ReturnValue) == 0x000000, "Member 'WBP_PopupContainer_C_CreateCancelButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_CreateCancelButton, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PopupContainer_C_CreateCancelButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PopupContainer_C_CreateCancelButton, CallFunc_CreateCancelButton_ReturnValue) == 0x000018, "Member 'WBP_PopupContainer_C_CreateCancelButton::CallFunc_CreateCancelButton_ReturnValue' has a wrong offset!");

}

