#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialMediaLink

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "BrickRigs_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialMediaLink.WBP_SocialMediaLink_C
// 0x0050 (0x02B0 - 0x0260)
class UWBP_SocialMediaLink_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickImage*                            IconImage;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TextBlock;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BrickButton_C*                     WBP_BrickButton;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBrickUIIconSlot                       IconSlot;                                          // 0x0280(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class FText                                   DisplayText;                                       // 0x0288(0x0018)(Edit, BlueprintVisible)
	class FString                                 URL;                                               // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SocialMediaLink(int32 EntryPoint);
	void BndEvt__WBP_SocialMediaLink_WBP_BrickButton_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InContentStyleState);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__WBP_BrickButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SocialMediaLink_C">();
	}
	static class UWBP_SocialMediaLink_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialMediaLink_C>();
	}
};
static_assert(alignof(UWBP_SocialMediaLink_C) == 0x000008, "Wrong alignment on UWBP_SocialMediaLink_C");
static_assert(sizeof(UWBP_SocialMediaLink_C) == 0x0002B0, "Wrong size on UWBP_SocialMediaLink_C");
static_assert(offsetof(UWBP_SocialMediaLink_C, UberGraphFrame) == 0x000260, "Member 'UWBP_SocialMediaLink_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SocialMediaLink_C, IconImage) == 0x000268, "Member 'UWBP_SocialMediaLink_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_SocialMediaLink_C, TextBlock) == 0x000270, "Member 'UWBP_SocialMediaLink_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_SocialMediaLink_C, WBP_BrickButton) == 0x000278, "Member 'UWBP_SocialMediaLink_C::WBP_BrickButton' has a wrong offset!");
static_assert(offsetof(UWBP_SocialMediaLink_C, IconSlot) == 0x000280, "Member 'UWBP_SocialMediaLink_C::IconSlot' has a wrong offset!");
static_assert(offsetof(UWBP_SocialMediaLink_C, DisplayText) == 0x000288, "Member 'UWBP_SocialMediaLink_C::DisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_SocialMediaLink_C, URL) == 0x0002A0, "Member 'UWBP_SocialMediaLink_C::URL' has a wrong offset!");

}

