#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryPopup.WBP_InventoryPopup_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_InventoryPopup_C final : public UInventoryPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickImage*                            BrickImage_85;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickImage*                            BrickImage_572;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickBorder*                           CenterBorder;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickImage*                            DropImage;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InventoryPopup(int32 EntryPoint);
	void BndEvt__DropButton_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InContentStyleState);
	void UpdateDropArea(bool bInIsDragging, bool bInCanDrop, bool bInIsDragOver);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryPopup_C">();
	}
	static class UWBP_InventoryPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryPopup_C>();
	}
};
static_assert(alignof(UWBP_InventoryPopup_C) == 0x000008, "Wrong alignment on UWBP_InventoryPopup_C");
static_assert(sizeof(UWBP_InventoryPopup_C) == 0x000318, "Wrong size on UWBP_InventoryPopup_C");
static_assert(offsetof(UWBP_InventoryPopup_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_InventoryPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryPopup_C, BrickImage_85) == 0x0002F8, "Member 'UWBP_InventoryPopup_C::BrickImage_85' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryPopup_C, BrickImage_572) == 0x000300, "Member 'UWBP_InventoryPopup_C::BrickImage_572' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryPopup_C, CenterBorder) == 0x000308, "Member 'UWBP_InventoryPopup_C::CenterBorder' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryPopup_C, DropImage) == 0x000310, "Member 'UWBP_InventoryPopup_C::DropImage' has a wrong offset!");

}

