#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConfirmResolutionPopup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ConfirmResolutionPopup.WBP_ConfirmResolutionPopup_C.ExecuteUbergraph_WBP_ConfirmResolutionPopup
// 0x0020 (0x0020 - 0x0000)
struct WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPopupContainerWidget*                  CallFunc_GetPopupContainer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateCancelButton_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateConfirmButton_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup) == 0x000008, "Wrong alignment on WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup");
static_assert(sizeof(WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup) == 0x000020, "Wrong size on WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup");
static_assert(offsetof(WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup, EntryPoint) == 0x000000, "Member 'WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup, CallFunc_GetPopupContainer_ReturnValue) == 0x000008, "Member 'WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup::CallFunc_GetPopupContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup, CallFunc_CreateCancelButton_ReturnValue) == 0x000010, "Member 'WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup::CallFunc_CreateCancelButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup, CallFunc_CreateConfirmButton_ReturnValue) == 0x000018, "Member 'WBP_ConfirmResolutionPopup_C_ExecuteUbergraph_WBP_ConfirmResolutionPopup::CallFunc_CreateConfirmButton_ReturnValue' has a wrong offset!");

}

