#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameOverlay.WBP_GameOverlay_C
// 0x0038 (0x0350 - 0x0318)
class UWBP_GameOverlay_C final : public UGameOverlayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickHorizontalBox*                    FriendlyTeamsBox;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickHorizontalBox*                    HostileTeamsBox;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickVerticalBox*                      HUDNotificationsBox;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvasPanel;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickVerticalBox*                      MatchStateBox;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             MatchTimerSlot;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GameOverlay(int32 EntryPoint);
	void UpdateVehicleConstructionNotification(class UHUDNotificationWidget* Widget, const class FText& VehicleDisplayName, float Progress);
	void UpdateVehicleSeatNotification(class UHUDNotificationWidget* Widget, const class FText& SeatDisplayName);
	void UpdateRespawnDelayNotification(class UHUDNotificationWidget* Widget, float Remaining);
	void UpdateRestartFailedNotification(class UHUDNotificationWidget* Widget, const class FText& Message);
	void UpdateProjectileCameraNotification(class UHUDNotificationWidget* Widget, bool bNewEnabled);
	void UpdateCameraModeNotification(class UHUDNotificationWidget* Widget, ECameraMode NewMode);
	void UpdateHUDVisibilityNotification(class UHUDNotificationWidget* Widget, EHUDVisibility NewVisibility);
	void AddTeamScoreWidget(class UTeamScoreWidget* Widget, ETeamAttitude TeamAttitude);
	void AddMatchStateWidget(class UMatchStateWidget* Widget);
	void UpdateCameraZoomNotification(class UHUDNotificationWidget* Widget, float NewZoomRatio);
	void UpdateCameraSpeedNotification(class UHUDNotificationWidget* Widget, float NewSpeedRatio, float NewMaxSpeed);
	void UpdateSaveNotification(class UHUDNotificationWidget* Widget, bool bSuccess, bool bIsAutoSave);
	void AddChatWidget(class UChatWidget* Widget);
	void AddInputHelpWidget(class UInputHelpWidget* Widget);
	void UpdateVehicleDownloadNotification(class UHUDNotificationWidget* Widget, const class FText& VehicleDisplayName, float Progress);
	void UpdateVehicleCameraNotification(class UHUDNotificationWidget* Widget, const class FText& CameraDisplayName);
	void AddMatchTimerWidget(class UMatchTimerWidget* Widget);
	void UpdateThumbnailNotification(class UHUDNotificationWidget* Widget);
	void UpdateFreeCamNotification(class UHUDNotificationWidget* Widget, bool bIsInFreeCam, EFreeCamMode InFreeCamMode, bool bIsFixedCam);
	void UpdateMoneyNotification(class UHUDNotificationWidget* Widget, float NewAmount, float AmountAdded);
	void UpdateSlomoNotification(class UHUDNotificationWidget* Widget, float SlomoSpeed, bool bInvertSpeed, bool bSlomoEnabled, bool bIsPaused);
	void AddHUDNotification(class UHUDNotificationWidget* Widget, int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameOverlay_C">();
	}
	static class UWBP_GameOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameOverlay_C>();
	}
};
static_assert(alignof(UWBP_GameOverlay_C) == 0x000008, "Wrong alignment on UWBP_GameOverlay_C");
static_assert(sizeof(UWBP_GameOverlay_C) == 0x000350, "Wrong size on UWBP_GameOverlay_C");
static_assert(offsetof(UWBP_GameOverlay_C, UberGraphFrame) == 0x000318, "Member 'UWBP_GameOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameOverlay_C, FriendlyTeamsBox) == 0x000320, "Member 'UWBP_GameOverlay_C::FriendlyTeamsBox' has a wrong offset!");
static_assert(offsetof(UWBP_GameOverlay_C, HostileTeamsBox) == 0x000328, "Member 'UWBP_GameOverlay_C::HostileTeamsBox' has a wrong offset!");
static_assert(offsetof(UWBP_GameOverlay_C, HUDNotificationsBox) == 0x000330, "Member 'UWBP_GameOverlay_C::HUDNotificationsBox' has a wrong offset!");
static_assert(offsetof(UWBP_GameOverlay_C, MainCanvasPanel) == 0x000338, "Member 'UWBP_GameOverlay_C::MainCanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GameOverlay_C, MatchStateBox) == 0x000340, "Member 'UWBP_GameOverlay_C::MatchStateBox' has a wrong offset!");
static_assert(offsetof(UWBP_GameOverlay_C, MatchTimerSlot) == 0x000348, "Member 'UWBP_GameOverlay_C::MatchTimerSlot' has a wrong offset!");

}

