#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TeamScore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TeamScore.WBP_TeamScore_C
// 0x0020 (0x0298 - 0x0278)
class UWBP_TeamScore_C final : public UTeamScoreWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           Border;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickImage*                            IconImage;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        ScoreTextBlock;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TeamScore(int32 EntryPoint);
	void UpdateTeamIcon(class UTexture2D* NewIcon);
	void UpdateTeamAttitude(ETeamAttitude NewTeamAttitude);
	void UpdateScore(int32 NewScore, int32 NewMaxScore);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TeamScore_C">();
	}
	static class UWBP_TeamScore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TeamScore_C>();
	}
};
static_assert(alignof(UWBP_TeamScore_C) == 0x000008, "Wrong alignment on UWBP_TeamScore_C");
static_assert(sizeof(UWBP_TeamScore_C) == 0x000298, "Wrong size on UWBP_TeamScore_C");
static_assert(offsetof(UWBP_TeamScore_C, UberGraphFrame) == 0x000278, "Member 'UWBP_TeamScore_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TeamScore_C, Border) == 0x000280, "Member 'UWBP_TeamScore_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_TeamScore_C, IconImage) == 0x000288, "Member 'UWBP_TeamScore_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_TeamScore_C, ScoreTextBlock) == 0x000290, "Member 'UWBP_TeamScore_C::ScoreTextBlock' has a wrong offset!");

}

