#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameOverlay

#include "Basic.hpp"

#include "BrickRigs_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameOverlay.WBP_GameOverlay_C.ExecuteUbergraph_WBP_GameOverlay
// 0x0D88 (0x0D88 - 0x0000)
struct WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0080(0x0018)()
	EFreeCamMode                                  Temp_byte_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x00A0(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x00B8(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0100(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_1;                              // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_7;                              // 0x0120(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_8;                              // 0x0140(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0158(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_2;                              // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            Temp_byte_Variable_3;                              // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0187(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable_10;                             // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x01A0(0x0018)()
	bool                                          Temp_bool_Variable_8;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_4;                              // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            Temp_byte_Variable_5;                              // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BF[0x1];                                      // 0x01BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_12;                             // 0x01C0(0x0018)()
	float                                         CallFunc_BreakVector2D_X;                          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x01EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x020C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_21;                            // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_20;                            // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_SlomoSpeed;                           // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInvertSpeed;                         // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSlomoEnabled;                        // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsPaused;                            // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23F[0x1];                                      // 0x023F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_19;                            // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewAmount;                            // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AmountAdded;                          // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0258(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0270(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_NumberToText_ReturnValue;                 // 0x02B0(0x0018)()
	class FText                                   CallFunc_NumberToText_ReturnValue_1;               // 0x02C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02E0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0320(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0368(0x0010)(ReferenceParm)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0380(0x0018)()
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x03A0(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot;                 // 0x03B8(0x0008)(NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x03C0(0x0040)(HasGetValueTypeHash)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_1;               // 0x0400(0x0008)(NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0408(0x0010)(ReferenceParm)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_18;                            // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInFreeCam;                         // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFreeCamMode                                  K2Node_Event_InFreeCamMode;                        // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFixedCam;                          // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423[0x5];                                      // 0x0423(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0428(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0440(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0460(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0480(0x0040)(HasGetValueTypeHash)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_2;               // 0x04C0(0x0008)(NoDestructor)
	class FText                                   K2Node_Select_Default_3;                           // 0x04C8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x04E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x04F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0538(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0578(0x0010)(ReferenceParm)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_17;                            // 0x0588(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0590(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_3;               // 0x05A8(0x0008)(NoDestructor)
	class FText                                   K2Node_Select_Default_4;                           // 0x05B0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x05C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x05E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0620(0x0010)(ReferenceParm)
	class UMatchTimerWidget*                      K2Node_Event_Widget_16;                            // 0x0630(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0638(0x0018)()
	class UHUDNotificationWidget*                 K2Node_Event_Widget_15;                            // 0x0650(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_CameraDisplayName;                    // 0x0658(0x0018)(ConstParm)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_4;               // 0x0670(0x0008)(NoDestructor)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_14;                            // 0x0678(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_VehicleDisplayName_1;                 // 0x0680(0x0018)(ConstParm)
	float                                         K2Node_Event_Progress_1;                           // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_NumberToText_ReturnValue_2;               // 0x06A0(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_5;               // 0x06B8(0x0008)(NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x06C0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0700(0x0018)()
	class UInputHelpWidget*                       K2Node_Event_Widget_13;                            // 0x0718(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0720(0x0040)(HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0760(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0768(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0778(0x0018)()
	class UChatWidget*                            K2Node_Event_Widget_12;                            // 0x0790(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0798(0x0010)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_1;           // 0x07A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x07B0(0x0010)(NoDestructor)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_11;                            // 0x07C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccess;                             // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsAutoSave;                          // 0x07C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CA[0x6];                                      // 0x07CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_10;                            // 0x07D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewSpeedRatio;                        // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewMaxSpeed;                          // 0x07DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_NumberToText_ReturnValue_3;               // 0x07E0(0x0018)()
	class FText                                   K2Node_Select_Default_5;                           // 0x07F8(0x0018)()
	int32                                         K2Node_Select_Default_6;                           // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default_7;                           // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default_8;                           // 0x0815(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_816[0x2];                                      // 0x0816(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_9;                           // 0x0818(0x0018)()
	class UHUDNotificationWidget*                 K2Node_Event_Widget_9;                             // 0x0830(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewZoomRatio;                         // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_10;                          // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_NumberToText_ReturnValue_4;               // 0x0840(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_6;               // 0x0858(0x0008)(NoDestructor)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_7;               // 0x0860(0x0008)(NoDestructor)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_8;               // 0x0868(0x0008)(NoDestructor)
	class UMatchStateWidget*                      K2Node_Event_Widget_8;                             // 0x0870(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTeamScoreWidget*                       K2Node_Event_Widget_7;                             // 0x0878(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 K2Node_Event_TeamAttitude;                         // 0x0880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0881(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_882[0x6];                                      // 0x0882(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0888(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_6;                             // 0x0890(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHUDVisibility                                K2Node_Event_NewVisibility;                        // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_5;                             // 0x08A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECameraMode                                   K2Node_Event_NewMode;                              // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A9[0x7];                                      // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHUDVisibilityDisplayText_ReturnValue;  // 0x08B0(0x0018)()
	class FText                                   CallFunc_GetCameraModeDisplayText_ReturnValue;     // 0x08C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x08E0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x0920(0x0040)(HasGetValueTypeHash)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_9;               // 0x0960(0x0008)(NoDestructor)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0968(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0980(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0998(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_13;           // 0x09B0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_14;           // 0x09F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0A30(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0A40(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0A50(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x0A68(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_10;              // 0x0A80(0x0008)(NoDestructor)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_4;                             // 0x0A88(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewEnabled;                          // 0x0A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A91[0x3];                                      // 0x0A91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_11;              // 0x0A94(0x0008)(NoDestructor)
	EBrickUIColorStyle                            Temp_byte_Variable_6;                              // 0x0A9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9D[0x3];                                      // 0x0A9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0AA0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_15;           // 0x0AB8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x0AF8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x0B10(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_12;              // 0x0B28(0x0008)(NoDestructor)
	class FText                                   K2Node_Select_Default_11;                          // 0x0B30(0x0018)()
	class UHUDNotificationWidget*                 K2Node_Event_Widget_3;                             // 0x0B48(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Message;                              // 0x0B50(0x0018)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_16;           // 0x0B68(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x0BA8(0x0010)(ReferenceParm)
	class UHUDNotificationWidget*                 K2Node_Event_Widget_2;                             // 0x0BB8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Remaining;                            // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC4[0x4];                                      // 0x0BC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x0BC8(0x0018)()
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0BE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0BE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE9[0x7];                                      // 0x0BE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_NumberToText_ReturnValue_5;               // 0x0BF0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_17;           // 0x0C08(0x0040)(HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default_12;                          // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C49[0x7];                                      // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x0C50(0x0010)(ReferenceParm)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_13;              // 0x0C60(0x0008)(NoDestructor)
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x0C68(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0C80(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0C88(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            Temp_byte_Variable_7;                              // 0x0C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C91[0x7];                                      // 0x0C91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         K2Node_Select_Default_13;                          // 0x0C98(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0CA0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIColorStyle                            K2Node_Select_Default_14;                          // 0x0CA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA9[0x7];                                      // 0x0CA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDNotificationWidget*                 K2Node_Event_Widget_1;                             // 0x0CB0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_SeatDisplayName;                      // 0x0CB8(0x0018)(ConstParm)
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_14;              // 0x0CD0(0x0008)(NoDestructor)
	class UHUDNotificationWidget*                 K2Node_Event_Widget;                               // 0x0CD8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_VehicleDisplayName;                   // 0x0CE0(0x0018)(ConstParm)
	float                                         K2Node_Event_Progress;                             // 0x0CF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFC[0x4];                                      // 0x0CFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_NumberToText_ReturnValue_6;               // 0x0D00(0x0018)()
	struct FBrickUIIconSlot                       K2Node_MakeStruct_BrickUIIconSlot_15;              // 0x0D18(0x0008)(NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_18;           // 0x0D20(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_9;                          // 0x0D60(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_9;                     // 0x0D70(0x0018)()
};
static_assert(alignof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay) == 0x000008, "Wrong alignment on WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay");
static_assert(sizeof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay) == 0x000D88, "Wrong size on WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, EntryPoint) == 0x000000, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable) == 0x000020, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable) == 0x000068, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_1) == 0x000080, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable) == 0x000098, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_2) == 0x0000A0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_3) == 0x0000B8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_4) == 0x0000D0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_5) == 0x0000E8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_6) == 0x000100, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_1) == 0x000118, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_1) == 0x000119, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_2) == 0x00011A, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_7) == 0x000120, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_3) == 0x000138, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_8) == 0x000140, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_9) == 0x000158, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_4) == 0x000170, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_int_Variable) == 0x000174, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_5) == 0x000178, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_int_Variable_1) == 0x00017C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_int_Variable_2) == 0x000180, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_6) == 0x000184, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_2) == 0x000185, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_3) == 0x000186, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_7) == 0x000187, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_10) == 0x000188, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_11) == 0x0001A0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_8) == 0x0001B8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_9) == 0x0001B9, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_10) == 0x0001BA, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_11) == 0x0001BB, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_4) == 0x0001BC, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_byte_Variable_5) == 0x0001BD, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_12) == 0x0001BE, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_text_Variable_12) == 0x0001C0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_X) == 0x0001D8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_Y) == 0x0001DC, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_X_1) == 0x0001E0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_Y_1) == 0x0001E4, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, Temp_bool_Variable_13) == 0x0001E8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_Margin) == 0x0001EC, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_X_2) == 0x0001FC, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_Y_2) == 0x000200, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_X_3) == 0x000204, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BreakVector2D_Y_3) == 0x000208, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_Margin_1) == 0x00020C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_21) == 0x000220, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_21' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Index) == 0x000228, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_20) == 0x000230, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_20' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_SlomoSpeed) == 0x000238, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_SlomoSpeed' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bInvertSpeed) == 0x00023C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bInvertSpeed' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bSlomoEnabled) == 0x00023D, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bSlomoEnabled' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bIsPaused) == 0x00023E, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bIsPaused' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_19) == 0x000240, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_19' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_NewAmount) == 0x000248, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_NewAmount' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_AmountAdded) == 0x00024C, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_AmountAdded' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000250, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default) == 0x000258, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_1) == 0x000270, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_NumberToText_ReturnValue) == 0x0002B0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_NumberToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_NumberToText_ReturnValue_1) == 0x0002C8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_NumberToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002E0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_3) == 0x000320, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_SelectInt_ReturnValue) == 0x000360, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeArray_Array) == 0x000368, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_SelectInt_ReturnValue_1) == 0x000378, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Format_ReturnValue) == 0x000380, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_SelectInt_ReturnValue_2) == 0x000398, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Conv_FloatToText_ReturnValue) == 0x0003A0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_BrickUIIconSlot) == 0x0003B8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_BrickUIIconSlot' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_4) == 0x0003C0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_BrickUIIconSlot_1) == 0x000400, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_BrickUIIconSlot_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeArray_Array_1) == 0x000408, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_18) == 0x000418, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_18' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bIsInFreeCam) == 0x000420, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bIsInFreeCam' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_InFreeCamMode) == 0x000421, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_InFreeCamMode' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_bIsFixedCam) == 0x000422, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_bIsFixedCam' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Format_ReturnValue_1) == 0x000428, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default_1) == 0x000440, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000458, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default_2) == 0x000460, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_BooleanAND_ReturnValue) == 0x000478, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_5) == 0x000480, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_BrickUIIconSlot_2) == 0x0004C0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_BrickUIIconSlot_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default_3) == 0x0004C8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0004E0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_6) == 0x0004F8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_FormatArgumentData_7) == 0x000538, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeArray_Array_2) == 0x000578, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Event_Widget_17) == 0x000588, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Event_Widget_17' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, CallFunc_Format_ReturnValue_2) == 0x000590, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_MakeStruct_BrickUIIconSlot_3) == 0x0005A8, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_MakeStruct_BrickUIIconSlot_3' has a wrong offset!");
static_assert(offsetof(WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay, K2Node_Select_Default_4) == 0x0005B0, "Member 'WBP_GameOverlay_C_ExecuteUbergraph_WBP_GameOverlay::K2Node_Select_Default_4' has a wrong offset!");
