#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PropertyCategory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PropertyCategory.WBP_PropertyCategory_C
// 0x0020 (0x0298 - 0x0278)
class UWBP_PropertyCategory_C final : public UPropertyCategoryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           NameBorder;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        NameTextBlock;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickGridPanel*                        PropertiesPanel;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateCategory(const class FText& DisplayName);
	void UpdatePropertyContainerWidgetSlot(class UPropertyContainerWidget* Widget, int32 Index_0, int32 NumPerRow);
	void AddPropertyContainerWidget(class UPropertyContainerWidget* Widget);
	void ExecuteUbergraph_WBP_PropertyCategory(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PropertyCategory_C">();
	}
	static class UWBP_PropertyCategory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PropertyCategory_C>();
	}
};
static_assert(alignof(UWBP_PropertyCategory_C) == 0x000008, "Wrong alignment on UWBP_PropertyCategory_C");
static_assert(sizeof(UWBP_PropertyCategory_C) == 0x000298, "Wrong size on UWBP_PropertyCategory_C");
static_assert(offsetof(UWBP_PropertyCategory_C, UberGraphFrame) == 0x000278, "Member 'UWBP_PropertyCategory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PropertyCategory_C, NameBorder) == 0x000280, "Member 'UWBP_PropertyCategory_C::NameBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PropertyCategory_C, NameTextBlock) == 0x000288, "Member 'UWBP_PropertyCategory_C::NameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_PropertyCategory_C, PropertiesPanel) == 0x000290, "Member 'UWBP_PropertyCategory_C::PropertiesPanel' has a wrong offset!");

}

