#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputActionCategory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputActionCategory.WBP_InputActionCategory_C
// 0x0018 (0x0298 - 0x0280)
class UWBP_InputActionCategory_C final : public UInputActionCategoryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BrickButton_C*                     Button;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TextBlock;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InputActionCategory(int32 EntryPoint);
	void UpdateInputActionListMode(EInputActionListMode NewMode);
	void UpdateIsSelected(bool bNewSelected);
	void InitializeCategory(const class FText& InCategoryName);
	void BndEvt__Button_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnUpdateContentStyle__DelegateSignature(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InContentStyleState);

	class UWidget* GetWidgetToFocus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InputActionCategory_C">();
	}
	static class UWBP_InputActionCategory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputActionCategory_C>();
	}
};
static_assert(alignof(UWBP_InputActionCategory_C) == 0x000008, "Wrong alignment on UWBP_InputActionCategory_C");
static_assert(sizeof(UWBP_InputActionCategory_C) == 0x000298, "Wrong size on UWBP_InputActionCategory_C");
static_assert(offsetof(UWBP_InputActionCategory_C, UberGraphFrame) == 0x000280, "Member 'UWBP_InputActionCategory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InputActionCategory_C, Button) == 0x000288, "Member 'UWBP_InputActionCategory_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_InputActionCategory_C, TextBlock) == 0x000290, "Member 'UWBP_InputActionCategory_C::TextBlock' has a wrong offset!");

}

