#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UGCProperty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UGCProperty.WBP_UGCProperty_C
// 0x0018 (0x02C8 - 0x02B0)
class UWBP_UGCProperty_C final : public UUGCPropertyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BrickButton_C*                     Button;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        ItemsTextBlock;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UGCProperty(int32 EntryPoint);
	void BndEvt__WBP_UGCProperty_Button_K2Node_ComponentBoundEvent_1_OnUpdateContentStyle__DelegateSignature(EBrickUIColorStyle InColorStyle, EBrickUIStyleState InContentStyleState);
	void UpdateItemsText(int32 NumSelected);
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UGCProperty_C">();
	}
	static class UWBP_UGCProperty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UGCProperty_C>();
	}
};
static_assert(alignof(UWBP_UGCProperty_C) == 0x000008, "Wrong alignment on UWBP_UGCProperty_C");
static_assert(sizeof(UWBP_UGCProperty_C) == 0x0002C8, "Wrong size on UWBP_UGCProperty_C");
static_assert(offsetof(UWBP_UGCProperty_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_UGCProperty_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UGCProperty_C, Button) == 0x0002B8, "Member 'UWBP_UGCProperty_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_UGCProperty_C, ItemsTextBlock) == 0x0002C0, "Member 'UWBP_UGCProperty_C::ItemsTextBlock' has a wrong offset!");

}

