#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PopupContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PopupContainer.WBP_PopupContainer_C
// 0x0050 (0x02F8 - 0x02A8)
class UWBP_PopupContainer_C final : public UPopupContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickBorder*                           BackgroundBorder;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickBorder*                           PopupBorder;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PopupBox;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PopupOverlay;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             PopupSlot;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ShadowBorder_C*                     ShadowBorder;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickBorder*                           TitleBorder;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TitleSizeBox;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TitleTextBlock;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PopupContainer(int32 EntryPoint);
	void UpdateColorStyle(EBrickUIColorStyle InColorStyle);
	void UpdateContentSlot(bool bShowContent, EPopupSizeRule SizeRule);
	void UpdateTitleText(const class FText& NewTitle);
	void AddPopupWidget(class UPopupWidget* Widget);
	class UMenuButtonWidget* CreateConfirmButton();
	class UMenuButtonWidget* CreateCancelButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PopupContainer_C">();
	}
	static class UWBP_PopupContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PopupContainer_C>();
	}
};
static_assert(alignof(UWBP_PopupContainer_C) == 0x000008, "Wrong alignment on UWBP_PopupContainer_C");
static_assert(sizeof(UWBP_PopupContainer_C) == 0x0002F8, "Wrong size on UWBP_PopupContainer_C");
static_assert(offsetof(UWBP_PopupContainer_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_PopupContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, BackgroundBorder) == 0x0002B0, "Member 'UWBP_PopupContainer_C::BackgroundBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, PopupBorder) == 0x0002B8, "Member 'UWBP_PopupContainer_C::PopupBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, PopupBox) == 0x0002C0, "Member 'UWBP_PopupContainer_C::PopupBox' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, PopupOverlay) == 0x0002C8, "Member 'UWBP_PopupContainer_C::PopupOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, PopupSlot) == 0x0002D0, "Member 'UWBP_PopupContainer_C::PopupSlot' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, ShadowBorder) == 0x0002D8, "Member 'UWBP_PopupContainer_C::ShadowBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, TitleBorder) == 0x0002E0, "Member 'UWBP_PopupContainer_C::TitleBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, TitleSizeBox) == 0x0002E8, "Member 'UWBP_PopupContainer_C::TitleSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_PopupContainer_C, TitleTextBlock) == 0x0002F0, "Member 'UWBP_PopupContainer_C::TitleTextBlock' has a wrong offset!");

}

