#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchState.WBP_MatchState_C
// 0x0020 (0x0298 - 0x0278)
class UWBP_MatchState_C final : public UMatchStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeAnimation;                                     // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBrickBorder*                           Border;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TextBlock;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MatchState(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void UpdateMatchState(const class FText& NewDisplayText, EBrickUIColorStyle NewColorStyle, bool bFadeOut);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MatchState_C">();
	}
	static class UWBP_MatchState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchState_C>();
	}
};
static_assert(alignof(UWBP_MatchState_C) == 0x000008, "Wrong alignment on UWBP_MatchState_C");
static_assert(sizeof(UWBP_MatchState_C) == 0x000298, "Wrong size on UWBP_MatchState_C");
static_assert(offsetof(UWBP_MatchState_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MatchState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MatchState_C, FadeAnimation) == 0x000280, "Member 'UWBP_MatchState_C::FadeAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_MatchState_C, Border) == 0x000288, "Member 'UWBP_MatchState_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_MatchState_C, TextBlock) == 0x000290, "Member 'UWBP_MatchState_C::TextBlock' has a wrong offset!");

}

