#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ContextMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ContextMenu.WBP_ContextMenu_C
// 0x0020 (0x02C0 - 0x02A0)
class UWBP_ContextMenu_C final : public UContextMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_0;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickBorder*                           TitleBorder;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickTextBlock*                        TitleTextBlock;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ContextMenu(int32 EntryPoint);
	void UpdateTitleText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ContextMenu_C">();
	}
	static class UWBP_ContextMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ContextMenu_C>();
	}
};
static_assert(alignof(UWBP_ContextMenu_C) == 0x000008, "Wrong alignment on UWBP_ContextMenu_C");
static_assert(sizeof(UWBP_ContextMenu_C) == 0x0002C0, "Wrong size on UWBP_ContextMenu_C");
static_assert(offsetof(UWBP_ContextMenu_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_ContextMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ContextMenu_C, SizeBox_0) == 0x0002A8, "Member 'UWBP_ContextMenu_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_ContextMenu_C, TitleBorder) == 0x0002B0, "Member 'UWBP_ContextMenu_C::TitleBorder' has a wrong offset!");
static_assert(offsetof(UWBP_ContextMenu_C, TitleTextBlock) == 0x0002B8, "Member 'UWBP_ContextMenu_C::TitleTextBlock' has a wrong offset!");

}

