#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapCrosshair

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapCrosshair.WBP_MapCrosshair_C
// 0x0018 (0x0278 - 0x0260)
class UWBP_MapCrosshair_C final : public UMapCrosshairWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickImage*                            ArrowHeadImage;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickImage*                            LineImage;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetColorStyle(EBrickUIColorStyle NewStyle);
	void SetStyleState(EBrickUIStyleState NewState);
	void ExecuteUbergraph_WBP_MapCrosshair(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapCrosshair_C">();
	}
	static class UWBP_MapCrosshair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapCrosshair_C>();
	}
};
static_assert(alignof(UWBP_MapCrosshair_C) == 0x000008, "Wrong alignment on UWBP_MapCrosshair_C");
static_assert(sizeof(UWBP_MapCrosshair_C) == 0x000278, "Wrong size on UWBP_MapCrosshair_C");
static_assert(offsetof(UWBP_MapCrosshair_C, UberGraphFrame) == 0x000260, "Member 'UWBP_MapCrosshair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapCrosshair_C, ArrowHeadImage) == 0x000268, "Member 'UWBP_MapCrosshair_C::ArrowHeadImage' has a wrong offset!");
static_assert(offsetof(UWBP_MapCrosshair_C, LineImage) == 0x000270, "Member 'UWBP_MapCrosshair_C::LineImage' has a wrong offset!");

}

