#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimespanProperty

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_TimespanProperty.WBP_TimespanProperty_C.ExecuteUbergraph_WBP_TimespanProperty
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable_2;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_TimespanMaxValue_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TimespanTimespan_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TimespanTimespan_ReturnValue;  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_TimespanMaxValue_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TimespanTimespan_ReturnValue_1;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TimespanTimespan_ReturnValue_1; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_TimespanMaxValue_ReturnValue_2;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TimespanTimespan_ReturnValue_2;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TimespanTimespan_ReturnValue_2; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_TimespanMaxValue_ReturnValue_3;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TimespanTimespan_ReturnValue_3;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TimespanTimespan_ReturnValue_3; // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              K2Node_Event_Timespan;                             // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_Event_MinValue;                             // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_Event_MaxValue;                             // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAllowInfinite;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrickUIColorStyle                            K2Node_ComponentBoundEvent_InColorStyle;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrickUIStyleState                            K2Node_ComponentBoundEvent_InContentStyleState;    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalDays_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalHours_ReturnValue;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalMinutes_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_2;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_3;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHours_ReturnValue;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinutes_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeconds_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalDays_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_4;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_6;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_7;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_TimespanMaxValue_ReturnValue_4;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TimespanTimespan_ReturnValue_4; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_TimespanMaxValue_ReturnValue_5;           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value_3;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_3;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_2;            // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType_1;            // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        K2Node_ComponentBoundEvent_EventType;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days_1;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours_1;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes_1;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds_1;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds_1;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue_1;               // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days_2;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours_2;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes_2;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds_2;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds_2;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue_2;               // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days_3;                     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours_3;                    // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes_3;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds_3;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds_3;             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue_3;               // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_TimespanMaxValue_ReturnValue_6;           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TimespanAsText_ReturnValue;               // 0x01C0(0x0018)()
	bool                                          CallFunc_EqualEqual_TimespanTimespan_ReturnValue_5; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              K2Node_Select_Default_9;                           // 0x01E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty) == 0x000008, "Wrong alignment on WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty");
static_assert(sizeof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty) == 0x0001E8, "Wrong size on WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, EntryPoint) == 0x000000, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable) == 0x000004, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable) == 0x000005, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_float_Variable) == 0x000008, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_2) == 0x00000C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_2) == 0x00000D, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_3) == 0x00000E, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_3) == 0x00000F, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_float_Variable_1) == 0x000010, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_4) == 0x000014, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_4) == 0x000015, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_5) == 0x000016, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_5) == 0x000017, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_float_Variable_2) == 0x000018, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_6) == 0x00001C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_6) == 0x00001D, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_7) == 0x00001E, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_7) == 0x00001F, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_8) == 0x000020, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_byte_Variable_9) == 0x000021, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_8) == 0x000022, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_TimespanMaxValue_ReturnValue) == 0x000028, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_TimespanMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_NotEqual_TimespanTimespan_ReturnValue) == 0x000030, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_NotEqual_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_EqualEqual_TimespanTimespan_ReturnValue) == 0x000031, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_EqualEqual_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_float_Variable_3) == 0x000034, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_TimespanMaxValue_ReturnValue_1) == 0x000038, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_TimespanMaxValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_NotEqual_TimespanTimespan_ReturnValue_1) == 0x000040, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_NotEqual_TimespanTimespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_EqualEqual_TimespanTimespan_ReturnValue_1) == 0x000041, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_EqualEqual_TimespanTimespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_TimespanMaxValue_ReturnValue_2) == 0x000048, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_TimespanMaxValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_NotEqual_TimespanTimespan_ReturnValue_2) == 0x000050, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_NotEqual_TimespanTimespan_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_EqualEqual_TimespanTimespan_ReturnValue_2) == 0x000051, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_EqualEqual_TimespanTimespan_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, Temp_bool_Variable_9) == 0x000052, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_TimespanMaxValue_ReturnValue_3) == 0x000058, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_TimespanMaxValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_NotEqual_TimespanTimespan_ReturnValue_3) == 0x000060, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_NotEqual_TimespanTimespan_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_EqualEqual_TimespanTimespan_ReturnValue_3) == 0x000061, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_EqualEqual_TimespanTimespan_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Event_Timespan) == 0x000068, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Event_Timespan' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Event_MinValue) == 0x000070, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Event_MinValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Event_MaxValue) == 0x000078, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Event_MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Event_bAllowInfinite) == 0x000080, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Event_bAllowInfinite' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_InColorStyle) == 0x000081, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_InColorStyle' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_InContentStyleState) == 0x000082, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_InContentStyleState' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_GetTotalSeconds_ReturnValue) == 0x000084, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_GetTotalDays_ReturnValue) == 0x000088, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_GetTotalDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FFloor_ReturnValue) == 0x00008C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FFloor_ReturnValue_1) == 0x000090, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_Greater_IntInt_ReturnValue) == 0x000094, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000095, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BooleanOR_ReturnValue) == 0x000096, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BooleanOR_ReturnValue_1) == 0x000097, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default) == 0x000098, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_1) == 0x000099, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_GetTotalHours_ReturnValue) == 0x00009C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_GetTotalHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_GetTotalMinutes_ReturnValue) == 0x0000A0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_GetTotalMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FFloor_ReturnValue_2) == 0x0000A4, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FFloor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FFloor_ReturnValue_3) == 0x0000A8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FFloor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0000AC, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_Greater_IntInt_ReturnValue_3) == 0x0000AD, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BooleanOR_ReturnValue_2) == 0x0000AE, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BooleanOR_ReturnValue_3) == 0x0000AF, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_2) == 0x0000B0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_3) == 0x0000B1, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_GetHours_ReturnValue) == 0x0000B4, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_GetHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_GetMinutes_ReturnValue) == 0x0000B8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_GetMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000BC, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0000C0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_4) == 0x0000C4, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_5) == 0x0000C8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_GetSeconds_ReturnValue) == 0x0000CC, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_GetSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_GetTotalDays_ReturnValue_1) == 0x0000D0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_GetTotalDays_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x0000D4, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FFloor_ReturnValue_4) == 0x0000D8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FFloor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_6) == 0x0000DC, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x0000E0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_7) == 0x0000E4, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_TimespanMaxValue_ReturnValue_4) == 0x0000E8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_TimespanMaxValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_EqualEqual_TimespanTimespan_ReturnValue_4) == 0x0000F0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_EqualEqual_TimespanTimespan_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BooleanOR_ReturnValue_4) == 0x0000F1, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_TimespanMaxValue_ReturnValue_5) == 0x0000F8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_TimespanMaxValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_8) == 0x000100, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_Value_3) == 0x000104, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_EventType_3) == 0x000108, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_EventType_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FTrunc_ReturnValue) == 0x00010C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_Value_2) == 0x000110, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_EventType_2) == 0x000114, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_EventType_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Days) == 0x000118, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Days' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Hours) == 0x00011C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Hours' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Minutes) == 0x000120, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Minutes' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Seconds) == 0x000124, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Seconds' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Milliseconds) == 0x000128, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Milliseconds' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FTrunc_ReturnValue_1) == 0x00012C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_MakeTimespan_ReturnValue) == 0x000130, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_Value_1) == 0x000138, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_EventType_1) == 0x00013C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_EventType_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FTrunc_ReturnValue_2) == 0x000140, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_Value) == 0x000144, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_ComponentBoundEvent_EventType) == 0x000148, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_ComponentBoundEvent_EventType' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_FTrunc_ReturnValue_3) == 0x00014C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Days_1) == 0x000150, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Days_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Hours_1) == 0x000154, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Hours_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Minutes_1) == 0x000158, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Minutes_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Seconds_1) == 0x00015C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Seconds_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Milliseconds_1) == 0x000160, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Milliseconds_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_MakeTimespan_ReturnValue_1) == 0x000168, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_MakeTimespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Days_2) == 0x000170, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Days_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Hours_2) == 0x000174, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Hours_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Minutes_2) == 0x000178, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Minutes_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Seconds_2) == 0x00017C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Seconds_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Milliseconds_2) == 0x000180, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Milliseconds_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_MakeTimespan_ReturnValue_2) == 0x000188, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_MakeTimespan_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Days_3) == 0x000190, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Days_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Hours_3) == 0x000194, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Hours_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Minutes_3) == 0x000198, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Minutes_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Seconds_3) == 0x00019C, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Seconds_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_BreakTimespan_Milliseconds_3) == 0x0001A0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_BreakTimespan_Milliseconds_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_MakeTimespan_ReturnValue_3) == 0x0001A8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_MakeTimespan_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Event_IsDesignTime) == 0x0001B0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_TimespanMaxValue_ReturnValue_6) == 0x0001B8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_TimespanMaxValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_TimespanAsText_ReturnValue) == 0x0001C0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_TimespanAsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, CallFunc_EqualEqual_TimespanTimespan_ReturnValue_5) == 0x0001D8, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::CallFunc_EqualEqual_TimespanTimespan_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty, K2Node_Select_Default_9) == 0x0001E0, "Member 'WBP_TimespanProperty_C_ExecuteUbergraph_WBP_TimespanProperty::K2Node_Select_Default_9' has a wrong offset!");

// Function WBP_TimespanProperty.WBP_TimespanProperty_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TimespanProperty_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_TimespanProperty_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TimespanProperty_C_PreConstruct");
static_assert(sizeof(WBP_TimespanProperty_C_PreConstruct) == 0x000001, "Wrong size on WBP_TimespanProperty_C_PreConstruct");
static_assert(offsetof(WBP_TimespanProperty_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TimespanProperty_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TimespanProperty.WBP_TimespanProperty_C.BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueChangedEventType                        EventType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature, EventType) == 0x000004, "Member 'WBP_TimespanProperty_C_BndEvt__WBP_TimespanProperty_DaysSlider_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature::EventType' has a wrong offset!");

// Function WBP_TimespanProperty.WBP_TimespanProperty_C.BndEvt__WBP_TimespanProperty_HoursSlider_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature
