#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dashboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Dashboard.WBP_Dashboard_C
// 0x0018 (0x02D0 - 0x02B8)
class UWBP_Dashboard_C final : public UDashboardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBrickHorizontalBox*                    IconsBox;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrickGridPanel*                        SlidersPanel;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddSliderWidget(class UDashboardSliderWidget* Widget);
	void AddIconWidget(class UDashboardIconWidget* Widget, int32 Index_0);
	void UpdateSliderWidgetSlot(class UDashboardSliderWidget* Widget, int32 Index_0, int32 NumSliders);
	void ExecuteUbergraph_WBP_Dashboard(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Dashboard_C">();
	}
	static class UWBP_Dashboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Dashboard_C>();
	}
};
static_assert(alignof(UWBP_Dashboard_C) == 0x000008, "Wrong alignment on UWBP_Dashboard_C");
static_assert(sizeof(UWBP_Dashboard_C) == 0x0002D0, "Wrong size on UWBP_Dashboard_C");
static_assert(offsetof(UWBP_Dashboard_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_Dashboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Dashboard_C, IconsBox) == 0x0002C0, "Member 'UWBP_Dashboard_C::IconsBox' has a wrong offset!");
static_assert(offsetof(UWBP_Dashboard_C, SlidersPanel) == 0x0002C8, "Member 'UWBP_Dashboard_C::SlidersPanel' has a wrong offset!");

}

