#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JoinSessionPopup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BrickRigs_structs.hpp"


namespace SDK::Params
{

// Function WBP_JoinSessionPopup.WBP_JoinSessionPopup_C.ExecuteUbergraph_WBP_JoinSessionPopup
// 0x0068 (0x0068 - 0x0000)
struct WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPopupContainerWidget*                  CallFunc_GetPopupContainer_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuButtonWidget*                      CallFunc_CreateCancelButton_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuButtonWidget*                      CallFunc_CreateConfirmButton_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0038(0x0018)()
	EJoinSessionState                             K2Node_Event_InJoinState;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInPasswordRequired;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInHasPassword;                       // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoinSessionState                             Temp_byte_Variable_4;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup) == 0x000008, "Wrong alignment on WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup");
static_assert(sizeof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup) == 0x000068, "Wrong size on WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, EntryPoint) == 0x000000, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_float_Variable) == 0x000004, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_float_Variable_1) == 0x000008, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_float_Variable_2) == 0x00000C, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_bool_Variable) == 0x000010, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_byte_Variable) == 0x000011, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_bool_Variable_1) == 0x000013, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_byte_Variable_2) == 0x000014, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_byte_Variable_3) == 0x000015, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_GetPopupContainer_ReturnValue) == 0x000018, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_GetPopupContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_CreateCancelButton_ReturnValue) == 0x000028, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_CreateCancelButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_CreateConfirmButton_ReturnValue) == 0x000030, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_CreateConfirmButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_MakeLiteralText_ReturnValue) == 0x000038, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, K2Node_Event_InJoinState) == 0x000050, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::K2Node_Event_InJoinState' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, K2Node_Event_bInPasswordRequired) == 0x000051, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::K2Node_Event_bInPasswordRequired' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, K2Node_Event_bInHasPassword) == 0x000052, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::K2Node_Event_bInHasPassword' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_Not_PreBool_ReturnValue) == 0x000053, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000054, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_BooleanOR_ReturnValue) == 0x000055, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_BooleanAND_ReturnValue) == 0x000056, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, K2Node_Select_Default) == 0x000057, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_BooleanAND_ReturnValue_1) == 0x000058, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000059, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, K2Node_Select_Default_1) == 0x00005A, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_float_Variable_3) == 0x00005C, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, Temp_byte_Variable_4) == 0x000060, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup, K2Node_Select_Default_2) == 0x000064, "Member 'WBP_JoinSessionPopup_C_ExecuteUbergraph_WBP_JoinSessionPopup::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_JoinSessionPopup.WBP_JoinSessionPopup_C.UpdateJoinState
// 0x0003 (0x0003 - 0x0000)
struct WBP_JoinSessionPopup_C_UpdateJoinState final
{
public:
	EJoinSessionState                             InJoinState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInPasswordRequired;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInHasPassword;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_JoinSessionPopup_C_UpdateJoinState) == 0x000001, "Wrong alignment on WBP_JoinSessionPopup_C_UpdateJoinState");
static_assert(sizeof(WBP_JoinSessionPopup_C_UpdateJoinState) == 0x000003, "Wrong size on WBP_JoinSessionPopup_C_UpdateJoinState");
static_assert(offsetof(WBP_JoinSessionPopup_C_UpdateJoinState, InJoinState) == 0x000000, "Member 'WBP_JoinSessionPopup_C_UpdateJoinState::InJoinState' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_UpdateJoinState, bInPasswordRequired) == 0x000001, "Member 'WBP_JoinSessionPopup_C_UpdateJoinState::bInPasswordRequired' has a wrong offset!");
static_assert(offsetof(WBP_JoinSessionPopup_C_UpdateJoinState, bInHasPassword) == 0x000002, "Member 'WBP_JoinSessionPopup_C_UpdateJoinState::bInHasPassword' has a wrong offset!");

// Function WBP_JoinSessionPopup.WBP_JoinSessionPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_JoinSessionPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_JoinSessionPopup_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_JoinSessionPopup_C_PreConstruct");
static_assert(sizeof(WBP_JoinSessionPopup_C_PreConstruct) == 0x000001, "Wrong size on WBP_JoinSessionPopup_C_PreConstruct");
static_assert(offsetof(WBP_JoinSessionPopup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_JoinSessionPopup_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

