#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UGCBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BrickRigs_structs.hpp"
#include "BrickRigs_classes.hpp"
#include "FluUGC_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UGCBrowser.WBP_UGCBrowser_C
// 0x0048 (0x0390 - 0x0348)
class UWBP_UGCBrowser_C final : public UUGCBrowserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EPlayerSpawnResult                            Can_Spawn_Result;                                  // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Num_Bricks;                                        // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVehicleSpawnProperties                SpawnProps;                                        // 0x0358(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          Can_Spawn;                                         // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Spawn_Failure_Text;                                // 0x0378(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_UGCBrowser(int32 EntryPoint);
	void VoteDown();
	void RemoveItem();
	void AddItem();
	void CreateAddOrRemoveItemButton(bool bIsArrayProperty, bool bIsSelected);
	void CreateSpawnInvincibilityButton(const class FText& CurrentInvincibilityText);
	void CreateOpenInExplorerButton();
	void OnClickedSaveOverwrite();
	void OnClickedSaveNew();
	void CreateSaveOverwriteButton();
	void CreateSaveNewButton();
	void OnClickedUpdateExisting();
	void OnClickedUploadNew();
	void CreateUpdateExistingButton();
	void CreateUploadNewButton();
	void CreateRecoverAutoSaveButton();
	void OnClickedReplaceCurrent();
	void OnClickedSpawnNew();
	void CreateImportButton();
	void OnClickedUnfavorite();
	void OnClickedFavorite();
	void OnClickedUnsubscribe();
	void OnClickedSubscribe();
	void OnClickedCancel();
	void CreateCancelButton();
	void VoteUp();
	void CreateVoteButtons(const EFluUGCItemVote Vote);
	void CreateViewInBrowserButton();
	void CreateSubscribeButton(bool bIsSubscribed);
	void CreateSpawnButton(bool bCanReplaceCurrent, bool bCanSpawn, const class FText& SpawnFailureText);
	void CreateNewItemButton();
	void CreateFavoriteButton(bool bIsFavorited);
	void CreateEditButton();
	void CreateDuplicateButton();
	void CreateDeleteButton();
	void CreateClearItemsButton(bool bIsArrayProperty);
	bool GetSpawnButtonTooltipContent(struct FTooltipContent* OutContent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UGCBrowser_C">();
	}
	static class UWBP_UGCBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UGCBrowser_C>();
	}
};
static_assert(alignof(UWBP_UGCBrowser_C) == 0x000008, "Wrong alignment on UWBP_UGCBrowser_C");
static_assert(sizeof(UWBP_UGCBrowser_C) == 0x000390, "Wrong size on UWBP_UGCBrowser_C");
static_assert(offsetof(UWBP_UGCBrowser_C, UberGraphFrame) == 0x000348, "Member 'UWBP_UGCBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UGCBrowser_C, Can_Spawn_Result) == 0x000350, "Member 'UWBP_UGCBrowser_C::Can_Spawn_Result' has a wrong offset!");
static_assert(offsetof(UWBP_UGCBrowser_C, Num_Bricks) == 0x000354, "Member 'UWBP_UGCBrowser_C::Num_Bricks' has a wrong offset!");
static_assert(offsetof(UWBP_UGCBrowser_C, SpawnProps) == 0x000358, "Member 'UWBP_UGCBrowser_C::SpawnProps' has a wrong offset!");
static_assert(offsetof(UWBP_UGCBrowser_C, Can_Spawn) == 0x000370, "Member 'UWBP_UGCBrowser_C::Can_Spawn' has a wrong offset!");
static_assert(offsetof(UWBP_UGCBrowser_C, Spawn_Failure_Text) == 0x000378, "Member 'UWBP_UGCBrowser_C::Spawn_Failure_Text' has a wrong offset!");

}

